TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:37 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_EPwm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioCtrlRegs")

     640                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     641                      .dwattr $C$DW$26, DW_AT_name("_InitEPwm6Gpio")
     642                      .dwattr $C$DW$26, DW_AT_TI_call
     643              
     644 000000c4 7640'         LCR       #_InitEPwm6Gpio       ; [CPU_] |52| 
         000000c5 008D 
     645                      ; call occurs [#_InitEPwm6Gpio] ; [] |52| 
     646                      .dwpsn  file "../source/DSP2803x_EPwm.c",line 55,column 4,is_stmt,isa 0
     647              $C$DW$27        .dwtag  DW_TAG_TI_branch
     648                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     649                      .dwattr $C$DW$27, DW_AT_name("_InitEPwm7Gpio")
     650                      .dwattr $C$DW$27, DW_AT_TI_call
     651              
     652 000000c6 7640'         LCR       #_InitEPwm7Gpio       ; [CPU_] |55| 
         000000c7 00A3 
     653                      ; call occurs [#_InitEPwm7Gpio] ; [] |55| 
     654              $C$DW$28        .dwtag  DW_TAG_TI_branch
     655                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   14

     656                      .dwattr $C$DW$28, DW_AT_TI_return
     657              
     658 000000c8 0006          LRETR     ; [CPU_] 
     659                      ; return occurs ; [] 
     660                      .dwattr $C$DW$20, DW_AT_TI_end_file("../source/DSP2803x_EPwm.c")
     661                      .dwattr $C$DW$20, DW_AT_TI_end_line(0x39)
     662                      .dwattr $C$DW$20, DW_AT_TI_end_column(0x01)
     663                      .dwendentry
     664                      .dwendtag $C$DW$20
     665              
     666 000000c9               .sect   ".text"
     667                      .clink
     668                      .global _InitEPwm
     669              
     670              $C$DW$29        .dwtag  DW_TAG_subprogram
     671                      .dwattr $C$DW$29, DW_AT_name("InitEPwm")
     672                      .dwattr $C$DW$29, DW_AT_low_pc(_InitEPwm)
     673                      .dwattr $C$DW$29, DW_AT_high_pc(0x00)
     674                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_InitEPwm")
     675                      .dwattr $C$DW$29, DW_AT_external
     676                      .dwattr $C$DW$29, DW_AT_TI_begin_file("../source/DSP2803x_EPwm.c")
     677                      .dwattr $C$DW$29, DW_AT_TI_begin_line(0x16)
     678                      .dwattr $C$DW$29, DW_AT_TI_begin_column(0x06)
     679                      .dwattr $C$DW$29, DW_AT_TI_max_frame_size(-2)
     680                      .dwpsn  file "../source/DSP2803x_EPwm.c",line 23,column 1,is_stmt,address _InitEPwm,isa 0
     681              
     682                      .dwfde $C$DW$CIE, _InitEPwm
     683              
     684              ;***************************************************************
     685              ;* FNAME: _InitEPwm                     FR SIZE:   0           *
     686              ;*                                                             *
     687              ;* FUNCTION ENVIRONMENT                                        *
     688              ;*                                                             *
     689              ;* FUNCTION PROPERTIES                                         *
     690              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     691              ;***************************************************************
     692              
     693 000000c9       _InitEPwm:
     694                      .dwcfi  cfa_offset, -2
     695                      .dwcfi  save_reg_to_mem, 26, 0
     696              $C$DW$30        .dwtag  DW_TAG_TI_branch
     697                      .dwattr $C$DW$30, DW_AT_low_pc(0x00)
     698                      .dwattr $C$DW$30, DW_AT_TI_return
     699              
     700 000000c9 0006          LRETR     ; [CPU_] 
     701                      ; return occurs ; [] 
     702                      .dwattr $C$DW$29, DW_AT_TI_end_file("../source/DSP2803x_EPwm.c")
     703                      .dwattr $C$DW$29, DW_AT_TI_end_line(0x1c)
     704                      .dwattr $C$DW$29, DW_AT_TI_end_column(0x01)
     705                      .dwendentry
     706                      .dwendtag $C$DW$29
     707              
     708              ;**************************************************************
     709              ;* UNDEFINED EXTERNAL REFERENCES                              *
     710              ;**************************************************************
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   15

     711                      .global _GpioCtrlRegs
     712              
     713              ;***************************************************************
     714              ;* TYPE INFORMATION                                            *
     715              ;***************************************************************
     716              
     717              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     718                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     719                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     720              $C$DW$31        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$31, DW_AT_name("rsvd1")
     723                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd1")
     724                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0f)
     725                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     726                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     728              
     729              $C$DW$32        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$32, DW_AT_name("rsvd2")
     732                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd2")
     733                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0e)
     734                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     735                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$33        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$33, DW_AT_name("AIO2")
     741                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_AIO2")
     742                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0d)
     743                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     744                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     746              
     747              $C$DW$34        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$34, DW_AT_name("rsvd3")
     750                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd3")
     751                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c)
     752                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     753                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     755              
     756              $C$DW$35        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$35, DW_AT_name("AIO4")
     759                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_AIO4")
     760                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0b)
     761                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     762                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765              $C$DW$36        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   16

     766                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$36, DW_AT_name("rsvd4")
     768                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd4")
     769                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0a)
     770                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     771                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     773              
     774              $C$DW$37        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$37, DW_AT_name("AIO6")
     777                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_AIO6")
     778                      .dwattr $C$DW$37, DW_AT_bit_offset(0x09)
     779                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     780                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     782              
     783              $C$DW$38        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$38, DW_AT_name("rsvd5")
     786                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd5")
     787                      .dwattr $C$DW$38, DW_AT_bit_offset(0x08)
     788                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     789                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     791              
     792              $C$DW$39        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$39, DW_AT_name("rsvd6")
     795                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd6")
     796                      .dwattr $C$DW$39, DW_AT_bit_offset(0x07)
     797                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     798                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801              $C$DW$40        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$40, DW_AT_name("rsvd7")
     804                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd7")
     805                      .dwattr $C$DW$40, DW_AT_bit_offset(0x06)
     806                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     807                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$41        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$41, DW_AT_name("AIO10")
     813                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_AIO10")
     814                      .dwattr $C$DW$41, DW_AT_bit_offset(0x05)
     815                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     816                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819              $C$DW$42        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   17

     821                      .dwattr $C$DW$42, DW_AT_name("rsvd8")
     822                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd8")
     823                      .dwattr $C$DW$42, DW_AT_bit_offset(0x04)
     824                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     825                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     826                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     827              
     828              $C$DW$43        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$43, DW_AT_name("AIO12")
     831                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_AIO12")
     832                      .dwattr $C$DW$43, DW_AT_bit_offset(0x03)
     833                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     834                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$44        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$44, DW_AT_name("rsvd9")
     840                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd9")
     841                      .dwattr $C$DW$44, DW_AT_bit_offset(0x02)
     842                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$45        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$45, DW_AT_name("AIO14")
     849                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_AIO14")
     850                      .dwattr $C$DW$45, DW_AT_bit_offset(0x01)
     851                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855              $C$DW$46        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$46, DW_AT_name("rsvd10")
     858                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd10")
     859                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     860                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     861                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864                      .dwendtag $C$DW$T$20
     865              
     866              
     867              $C$DW$T$21      .dwtag  DW_TAG_union_type
     868                      .dwattr $C$DW$T$21, DW_AT_name("AIODAT_REG")
     869                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     870              $C$DW$47        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$47, DW_AT_name("all")
     873                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
     874                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   18

     876              
     877              $C$DW$48        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     879                      .dwattr $C$DW$48, DW_AT_name("bit")
     880                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
     881                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884                      .dwendtag $C$DW$T$21
     885              
     886              
     887              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     888                      .dwattr $C$DW$T$22, DW_AT_name("AIO_BITS")
     889                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     890              $C$DW$49        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     892                      .dwattr $C$DW$49, DW_AT_name("rsvd1")
     893                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd1")
     894                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0e)
     895                      .dwattr $C$DW$49, DW_AT_bit_size(0x02)
     896                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$50        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$50, DW_AT_name("rsvd2")
     902                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd2")
     903                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0c)
     904                      .dwattr $C$DW$50, DW_AT_bit_size(0x02)
     905                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     907              
     908              $C$DW$51        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$51, DW_AT_name("AIO2")
     911                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_AIO2")
     912                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0a)
     913                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
     914                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     916              
     917              $C$DW$52        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$52, DW_AT_name("rsvd3")
     920                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd3")
     921                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     922                      .dwattr $C$DW$52, DW_AT_bit_size(0x02)
     923                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926              $C$DW$53        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$53, DW_AT_name("AIO4")
     929                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_AIO4")
     930                      .dwattr $C$DW$53, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   19

     931                      .dwattr $C$DW$53, DW_AT_bit_size(0x02)
     932                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935              $C$DW$54        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$54, DW_AT_name("rsvd4")
     938                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd4")
     939                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     940                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
     941                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944              $C$DW$55        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$55, DW_AT_name("AIO6")
     947                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_AIO6")
     948                      .dwattr $C$DW$55, DW_AT_bit_offset(0x02)
     949                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     950                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     952              
     953              $C$DW$56        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     955                      .dwattr $C$DW$56, DW_AT_name("rsvd5")
     956                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd5")
     957                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00)
     958                      .dwattr $C$DW$56, DW_AT_bit_size(0x02)
     959                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     961              
     962              $C$DW$57        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$57, DW_AT_name("rsvd6")
     965                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd6")
     966                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0e)
     967                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
     968                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     969                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971              $C$DW$58        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     973                      .dwattr $C$DW$58, DW_AT_name("rsvd7")
     974                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd7")
     975                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
     976                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
     977                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     978                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     979              
     980              $C$DW$59        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$59, DW_AT_name("AIO10")
     983                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_AIO10")
     984                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a)
     985                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   20

     986                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     987                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     988              
     989              $C$DW$60        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$60, DW_AT_name("rsvd8")
     992                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd8")
     993                      .dwattr $C$DW$60, DW_AT_bit_offset(0x08)
     994                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
     995                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     996                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     997              
     998              $C$DW$61        .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1000                      .dwattr $C$DW$61, DW_AT_name("AIO12")
    1001                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_AIO12")
    1002                      .dwattr $C$DW$61, DW_AT_bit_offset(0x06)
    1003                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
    1004                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1005                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1006              
    1007              $C$DW$62        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$62, DW_AT_name("rsvd9")
    1010                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd9")
    1011                      .dwattr $C$DW$62, DW_AT_bit_offset(0x04)
    1012                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
    1013                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1014                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$63        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$63, DW_AT_name("AIO14")
    1019                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_AIO14")
    1020                      .dwattr $C$DW$63, DW_AT_bit_offset(0x02)
    1021                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1023                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1024              
    1025              $C$DW$64        .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$64, DW_AT_name("rsvd10")
    1028                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd10")
    1029                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
    1030                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
    1031                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1032                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1033              
    1034                      .dwendtag $C$DW$T$22
    1035              
    1036              
    1037              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1038                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
    1039                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1040              $C$DW$65        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   21

    1041                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$23)
    1042                      .dwattr $C$DW$65, DW_AT_name("all")
    1043                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
    1044                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$66        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1049                      .dwattr $C$DW$66, DW_AT_name("bit")
    1050                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
    1051                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054                      .dwendtag $C$DW$T$24
    1055              
    1056              
    1057              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1058                      .dwattr $C$DW$T$25, DW_AT_name("GPA1_BITS")
    1059                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1060              $C$DW$67        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$67, DW_AT_name("GPIO0")
    1063                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO0")
    1064                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e)
    1065                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
    1066                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$68        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$68, DW_AT_name("GPIO1")
    1072                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO1")
    1073                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0c)
    1074                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
    1075                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078              $C$DW$69        .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$69, DW_AT_name("GPIO2")
    1081                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO2")
    1082                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0a)
    1083                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
    1084                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$70        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$70, DW_AT_name("GPIO3")
    1090                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO3")
    1091                      .dwattr $C$DW$70, DW_AT_bit_offset(0x08)
    1092                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
    1093                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1095              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   22

    1096              $C$DW$71        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$71, DW_AT_name("GPIO4")
    1099                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO4")
    1100                      .dwattr $C$DW$71, DW_AT_bit_offset(0x06)
    1101                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
    1102                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1104              
    1105              $C$DW$72        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$72, DW_AT_name("GPIO5")
    1108                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO5")
    1109                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
    1110                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
    1111                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114              $C$DW$73        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$73, DW_AT_name("GPIO6")
    1117                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO6")
    1118                      .dwattr $C$DW$73, DW_AT_bit_offset(0x02)
    1119                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
    1120                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$74        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$74, DW_AT_name("GPIO7")
    1126                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO7")
    1127                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1128                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
    1129                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1131              
    1132              $C$DW$75        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1134                      .dwattr $C$DW$75, DW_AT_name("GPIO8")
    1135                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO8")
    1136                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0e)
    1137                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
    1138                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1139                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141              $C$DW$76        .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$76, DW_AT_name("GPIO9")
    1144                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO9")
    1145                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
    1146                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
    1147                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1148                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1149              
    1150              $C$DW$77        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   23

    1151                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$77, DW_AT_name("GPIO10")
    1153                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO10")
    1154                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a)
    1155                      .dwattr $C$DW$77, DW_AT_bit_size(0x02)
    1156                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1157                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$78        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$78, DW_AT_name("GPIO11")
    1162                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO11")
    1163                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08)
    1164                      .dwattr $C$DW$78, DW_AT_bit_size(0x02)
    1165                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1166                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1167              
    1168              $C$DW$79        .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$79, DW_AT_name("GPIO12")
    1171                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO12")
    1172                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
    1173                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
    1174                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1175                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1176              
    1177              $C$DW$80        .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$80, DW_AT_name("GPIO13")
    1180                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO13")
    1181                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1182                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
    1183                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1184                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$81        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$81, DW_AT_name("GPIO14")
    1189                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO14")
    1190                      .dwattr $C$DW$81, DW_AT_bit_offset(0x02)
    1191                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
    1192                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1193                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1194              
    1195              $C$DW$82        .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$82, DW_AT_name("GPIO15")
    1198                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO15")
    1199                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1200                      .dwattr $C$DW$82, DW_AT_bit_size(0x02)
    1201                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1202                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204                      .dwendtag $C$DW$T$25
    1205              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   24

    1206              
    1207              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1208                      .dwattr $C$DW$T$26, DW_AT_name("GPA1_REG")
    1209                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1210              $C$DW$83        .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1212                      .dwattr $C$DW$83, DW_AT_name("all")
    1213                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1214                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$84        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1219                      .dwattr $C$DW$84, DW_AT_name("bit")
    1220                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
    1221                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224                      .dwendtag $C$DW$T$26
    1225              
    1226              
    1227              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1228                      .dwattr $C$DW$T$27, DW_AT_name("GPA2_BITS")
    1229                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1230              $C$DW$85        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$85, DW_AT_name("GPIO16")
    1233                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO16")
    1234                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e)
    1235                      .dwattr $C$DW$85, DW_AT_bit_size(0x02)
    1236                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$86        .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$86, DW_AT_name("GPIO17")
    1242                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO17")
    1243                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c)
    1244                      .dwattr $C$DW$86, DW_AT_bit_size(0x02)
    1245                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$87        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$87, DW_AT_name("GPIO18")
    1251                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO18")
    1252                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a)
    1253                      .dwattr $C$DW$87, DW_AT_bit_size(0x02)
    1254                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$88        .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$88, DW_AT_name("GPIO19")
    1260                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO19")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   25

    1261                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
    1262                      .dwattr $C$DW$88, DW_AT_bit_size(0x02)
    1263                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$89        .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$89, DW_AT_name("GPIO20")
    1269                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO20")
    1270                      .dwattr $C$DW$89, DW_AT_bit_offset(0x06)
    1271                      .dwattr $C$DW$89, DW_AT_bit_size(0x02)
    1272                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$90        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$90, DW_AT_name("GPIO21")
    1278                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO21")
    1279                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04)
    1280                      .dwattr $C$DW$90, DW_AT_bit_size(0x02)
    1281                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$91        .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$91, DW_AT_name("GPIO22")
    1287                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO22")
    1288                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02)
    1289                      .dwattr $C$DW$91, DW_AT_bit_size(0x02)
    1290                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293              $C$DW$92        .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$92, DW_AT_name("GPIO23")
    1296                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO23")
    1297                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1298                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1299                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302              $C$DW$93        .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1304                      .dwattr $C$DW$93, DW_AT_name("GPIO24")
    1305                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO24")
    1306                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e)
    1307                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1308                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1309                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$94        .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$94, DW_AT_name("GPIO25")
    1314                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO25")
    1315                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   26

    1316                      .dwattr $C$DW$94, DW_AT_bit_size(0x02)
    1317                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1318                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$95        .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$95, DW_AT_name("GPIO26")
    1323                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO26")
    1324                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a)
    1325                      .dwattr $C$DW$95, DW_AT_bit_size(0x02)
    1326                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1327                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$96        .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$96, DW_AT_name("GPIO27")
    1332                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO27")
    1333                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08)
    1334                      .dwattr $C$DW$96, DW_AT_bit_size(0x02)
    1335                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1336                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$97        .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$97, DW_AT_name("GPIO28")
    1341                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO28")
    1342                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1343                      .dwattr $C$DW$97, DW_AT_bit_size(0x02)
    1344                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1345                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1346              
    1347              $C$DW$98        .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$98, DW_AT_name("GPIO29")
    1350                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO29")
    1351                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04)
    1352                      .dwattr $C$DW$98, DW_AT_bit_size(0x02)
    1353                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$99        .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$99, DW_AT_name("GPIO30")
    1359                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO30")
    1360                      .dwattr $C$DW$99, DW_AT_bit_offset(0x02)
    1361                      .dwattr $C$DW$99, DW_AT_bit_size(0x02)
    1362                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1363                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1364              
    1365              $C$DW$100       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1367                      .dwattr $C$DW$100, DW_AT_name("GPIO31")
    1368                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO31")
    1369                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1370                      .dwattr $C$DW$100, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   27

    1371                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1372                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374                      .dwendtag $C$DW$T$27
    1375              
    1376              
    1377              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1378                      .dwattr $C$DW$T$28, DW_AT_name("GPA2_REG")
    1379                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1380              $C$DW$101       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1382                      .dwattr $C$DW$101, DW_AT_name("all")
    1383                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1384                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1386              
    1387              $C$DW$102       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$27)
    1389                      .dwattr $C$DW$102, DW_AT_name("bit")
    1390                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1391                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394                      .dwendtag $C$DW$T$28
    1395              
    1396              
    1397              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1398                      .dwattr $C$DW$T$29, DW_AT_name("GPACTRL_BITS")
    1399                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1400              $C$DW$103       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1402                      .dwattr $C$DW$103, DW_AT_name("QUALPRD0")
    1403                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_QUALPRD0")
    1404                      .dwattr $C$DW$103, DW_AT_bit_offset(0x08)
    1405                      .dwattr $C$DW$103, DW_AT_bit_size(0x08)
    1406                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1408              
    1409              $C$DW$104       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$104, DW_AT_name("QUALPRD1")
    1412                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_QUALPRD1")
    1413                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1414                      .dwattr $C$DW$104, DW_AT_bit_size(0x08)
    1415                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418              $C$DW$105       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1420                      .dwattr $C$DW$105, DW_AT_name("QUALPRD2")
    1421                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_QUALPRD2")
    1422                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1423                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    1424                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1425                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   28

    1426              
    1427              $C$DW$106       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$106, DW_AT_name("QUALPRD3")
    1430                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_QUALPRD3")
    1431                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    1432                      .dwattr $C$DW$106, DW_AT_bit_size(0x08)
    1433                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1434                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1435              
    1436                      .dwendtag $C$DW$T$29
    1437              
    1438              
    1439              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1440                      .dwattr $C$DW$T$30, DW_AT_name("GPACTRL_REG")
    1441                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1442              $C$DW$107       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$23)
    1444                      .dwattr $C$DW$107, DW_AT_name("all")
    1445                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    1446                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449              $C$DW$108       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$29)
    1451                      .dwattr $C$DW$108, DW_AT_name("bit")
    1452                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    1453                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1455              
    1456                      .dwendtag $C$DW$T$30
    1457              
    1458              
    1459              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1460                      .dwattr $C$DW$T$31, DW_AT_name("GPADAT_BITS")
    1461                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1462              $C$DW$109       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1464                      .dwattr $C$DW$109, DW_AT_name("GPIO0")
    1465                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO0")
    1466                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0f)
    1467                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1468                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$110       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1473                      .dwattr $C$DW$110, DW_AT_name("GPIO1")
    1474                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO1")
    1475                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e)
    1476                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1477                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1479              
    1480              $C$DW$111       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   29

    1481                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$111, DW_AT_name("GPIO2")
    1483                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO2")
    1484                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d)
    1485                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1486                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$112       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$112, DW_AT_name("GPIO3")
    1492                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO3")
    1493                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c)
    1494                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1495                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498              $C$DW$113       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$113, DW_AT_name("GPIO4")
    1501                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO4")
    1502                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b)
    1503                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1504                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1506              
    1507              $C$DW$114       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1509                      .dwattr $C$DW$114, DW_AT_name("GPIO5")
    1510                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO5")
    1511                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a)
    1512                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1513                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1515              
    1516              $C$DW$115       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1518                      .dwattr $C$DW$115, DW_AT_name("GPIO6")
    1519                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO6")
    1520                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09)
    1521                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1524              
    1525              $C$DW$116       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$116, DW_AT_name("GPIO7")
    1528                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO7")
    1529                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1530                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1531                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1533              
    1534              $C$DW$117       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   30

    1536                      .dwattr $C$DW$117, DW_AT_name("GPIO8")
    1537                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO8")
    1538                      .dwattr $C$DW$117, DW_AT_bit_offset(0x07)
    1539                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1540                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1542              
    1543              $C$DW$118       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$118, DW_AT_name("GPIO9")
    1546                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO9")
    1547                      .dwattr $C$DW$118, DW_AT_bit_offset(0x06)
    1548                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1549                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$119       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$119, DW_AT_name("GPIO10")
    1555                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO10")
    1556                      .dwattr $C$DW$119, DW_AT_bit_offset(0x05)
    1557                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1558                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1560              
    1561              $C$DW$120       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1563                      .dwattr $C$DW$120, DW_AT_name("GPIO11")
    1564                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO11")
    1565                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1566                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1567                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$121       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1572                      .dwattr $C$DW$121, DW_AT_name("GPIO12")
    1573                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO12")
    1574                      .dwattr $C$DW$121, DW_AT_bit_offset(0x03)
    1575                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1576                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1578              
    1579              $C$DW$122       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1581                      .dwattr $C$DW$122, DW_AT_name("GPIO13")
    1582                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO13")
    1583                      .dwattr $C$DW$122, DW_AT_bit_offset(0x02)
    1584                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588              $C$DW$123       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$123, DW_AT_name("GPIO14")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   31

    1591                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO14")
    1592                      .dwattr $C$DW$123, DW_AT_bit_offset(0x01)
    1593                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1594                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$124       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$124, DW_AT_name("GPIO15")
    1600                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO15")
    1601                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1602                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1603                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$125       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$125, DW_AT_name("GPIO16")
    1609                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO16")
    1610                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0f)
    1611                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1612                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1613                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$126       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$126, DW_AT_name("GPIO17")
    1618                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO17")
    1619                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e)
    1620                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1622                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1623              
    1624              $C$DW$127       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$127, DW_AT_name("GPIO18")
    1627                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO18")
    1628                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d)
    1629                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1630                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1631                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$128       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$128, DW_AT_name("GPIO19")
    1636                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO19")
    1637                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1638                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1639                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1640                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1641              
    1642              $C$DW$129       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1644                      .dwattr $C$DW$129, DW_AT_name("GPIO20")
    1645                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO20")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   32

    1646                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0b)
    1647                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1648                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1649                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1650              
    1651              $C$DW$130       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$130, DW_AT_name("GPIO21")
    1654                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO21")
    1655                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    1656                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1657                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1658                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$131       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$131, DW_AT_name("GPIO22")
    1663                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO22")
    1664                      .dwattr $C$DW$131, DW_AT_bit_offset(0x09)
    1665                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1666                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1667                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$132       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$132, DW_AT_name("GPIO23")
    1672                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO23")
    1673                      .dwattr $C$DW$132, DW_AT_bit_offset(0x08)
    1674                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1675                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1676                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$133       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$133, DW_AT_name("GPIO24")
    1681                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO24")
    1682                      .dwattr $C$DW$133, DW_AT_bit_offset(0x07)
    1683                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1685                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$134       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$134, DW_AT_name("GPIO25")
    1690                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO25")
    1691                      .dwattr $C$DW$134, DW_AT_bit_offset(0x06)
    1692                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1693                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1694                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$135       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$135, DW_AT_name("GPIO26")
    1699                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO26")
    1700                      .dwattr $C$DW$135, DW_AT_bit_offset(0x05)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   33

    1701                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1702                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1703                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$136       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$136, DW_AT_name("GPIO27")
    1708                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO27")
    1709                      .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1710                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1711                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1712                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714              $C$DW$137       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$137, DW_AT_name("GPIO28")
    1717                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO28")
    1718                      .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    1719                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1720                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1721                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723              $C$DW$138       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$138, DW_AT_name("GPIO29")
    1726                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO29")
    1727                      .dwattr $C$DW$138, DW_AT_bit_offset(0x02)
    1728                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1729                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1730                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$139       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1734                      .dwattr $C$DW$139, DW_AT_name("GPIO30")
    1735                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO30")
    1736                      .dwattr $C$DW$139, DW_AT_bit_offset(0x01)
    1737                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1738                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1739                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1740              
    1741              $C$DW$140       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1743                      .dwattr $C$DW$140, DW_AT_name("GPIO31")
    1744                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO31")
    1745                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    1746                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1747                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1748                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1749              
    1750                      .dwendtag $C$DW$T$31
    1751              
    1752              
    1753              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1754                      .dwattr $C$DW$T$32, DW_AT_name("GPADAT_REG")
    1755                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   34

    1756              $C$DW$141       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    1758                      .dwattr $C$DW$141, DW_AT_name("all")
    1759                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    1760                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1762              
    1763              $C$DW$142       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
    1765                      .dwattr $C$DW$142, DW_AT_name("bit")
    1766                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    1767                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770                      .dwendtag $C$DW$T$32
    1771              
    1772              
    1773              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1774                      .dwattr $C$DW$T$33, DW_AT_name("GPB1_BITS")
    1775                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1776              $C$DW$143       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1778                      .dwattr $C$DW$143, DW_AT_name("GPIO32")
    1779                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO32")
    1780                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
    1781                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    1782                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1784              
    1785              $C$DW$144       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1787                      .dwattr $C$DW$144, DW_AT_name("GPIO33")
    1788                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO33")
    1789                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0c)
    1790                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1791                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1793              
    1794              $C$DW$145       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$145, DW_AT_name("GPIO34")
    1797                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO34")
    1798                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0a)
    1799                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    1800                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1801                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1802              
    1803              $C$DW$146       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$146, DW_AT_name("GPIO35")
    1806                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO35")
    1807                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08)
    1808                      .dwattr $C$DW$146, DW_AT_bit_size(0x02)
    1809                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   35

    1811              
    1812              $C$DW$147       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$147, DW_AT_name("GPIO36")
    1815                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO36")
    1816                      .dwattr $C$DW$147, DW_AT_bit_offset(0x06)
    1817                      .dwattr $C$DW$147, DW_AT_bit_size(0x02)
    1818                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821              $C$DW$148       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$148, DW_AT_name("GPIO37")
    1824                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO37")
    1825                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04)
    1826                      .dwattr $C$DW$148, DW_AT_bit_size(0x02)
    1827                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$149       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1832                      .dwattr $C$DW$149, DW_AT_name("GPIO38")
    1833                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO38")
    1834                      .dwattr $C$DW$149, DW_AT_bit_offset(0x02)
    1835                      .dwattr $C$DW$149, DW_AT_bit_size(0x02)
    1836                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1838              
    1839              $C$DW$150       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1841                      .dwattr $C$DW$150, DW_AT_name("GPIO39")
    1842                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO39")
    1843                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    1844                      .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    1845                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1847              
    1848              $C$DW$151       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1850                      .dwattr $C$DW$151, DW_AT_name("GPIO40")
    1851                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO40")
    1852                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e)
    1853                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    1854                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1855                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1856              
    1857              $C$DW$152       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1859                      .dwattr $C$DW$152, DW_AT_name("GPIO41")
    1860                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO41")
    1861                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    1862                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    1863                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1864                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1865              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   36

    1866              $C$DW$153       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1868                      .dwattr $C$DW$153, DW_AT_name("GPIO42")
    1869                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO42")
    1870                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    1871                      .dwattr $C$DW$153, DW_AT_bit_size(0x02)
    1872                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1873                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1874              
    1875              $C$DW$154       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$154, DW_AT_name("GPIO43")
    1878                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO43")
    1879                      .dwattr $C$DW$154, DW_AT_bit_offset(0x08)
    1880                      .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    1881                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1882                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1883              
    1884              $C$DW$155       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$155, DW_AT_name("GPIO44")
    1887                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO44")
    1888                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    1889                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    1890                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1891                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893              $C$DW$156       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1895                      .dwattr $C$DW$156, DW_AT_name("rsvd1")
    1896                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd1")
    1897                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    1898                      .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    1899                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1900                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1901              
    1902                      .dwendtag $C$DW$T$33
    1903              
    1904              
    1905              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1906                      .dwattr $C$DW$T$34, DW_AT_name("GPB1_REG")
    1907                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1908              $C$DW$157       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    1910                      .dwattr $C$DW$157, DW_AT_name("all")
    1911                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_all")
    1912                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915              $C$DW$158       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$33)
    1917                      .dwattr $C$DW$158, DW_AT_name("bit")
    1918                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_bit")
    1919                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   37

    1921              
    1922                      .dwendtag $C$DW$T$34
    1923              
    1924              
    1925              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1926                      .dwattr $C$DW$T$35, DW_AT_name("GPBCTRL_BITS")
    1927                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1928              $C$DW$159       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$159, DW_AT_name("QUALPRD0")
    1931                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_QUALPRD0")
    1932                      .dwattr $C$DW$159, DW_AT_bit_offset(0x08)
    1933                      .dwattr $C$DW$159, DW_AT_bit_size(0x08)
    1934                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$160       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    1940                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    1941                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    1942                      .dwattr $C$DW$160, DW_AT_bit_size(0x08)
    1943                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$161       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$161, DW_AT_name("rsvd2")
    1949                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd2")
    1950                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    1951                      .dwattr $C$DW$161, DW_AT_bit_size(0x10)
    1952                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1953                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1954              
    1955                      .dwendtag $C$DW$T$35
    1956              
    1957              
    1958              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1959                      .dwattr $C$DW$T$36, DW_AT_name("GPBCTRL_REG")
    1960                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1961              $C$DW$162       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    1963                      .dwattr $C$DW$162, DW_AT_name("all")
    1964                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_all")
    1965                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1967              
    1968              $C$DW$163       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$35)
    1970                      .dwattr $C$DW$163, DW_AT_name("bit")
    1971                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_bit")
    1972                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1974              
    1975                      .dwendtag $C$DW$T$36
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{AA81AB81-8289-4443-AD89-992604C4BF4C} PAGE   38

    1976              
    1977              
    1978              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1979                      .dwattr $C$DW$T$37, DW_AT_name("GPBDAT_BITS")
    1980                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1981              $C$DW$164       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1983                      .dwattr $C$DW$164, DW_AT_name("GPIO32")
    1984                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO32")
    1985                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0f)
    1986                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1987                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1989              
    1990              $C$DW$165       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1992                      .dwattr $C$DW$165, DW_AT_name("GPIO33")
    1993                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO33")
    1994                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    1995                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1996                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999              $C$DW$166       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$166, DW_AT_name("GPIO34")
    2002                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO34")
    2003                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0d)
    2004                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2005                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
