TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.12 *
       3              ;* Date/Time created: Thu Nov 16 10:01:33 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=on --mem_model
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_SWPrioritizedPieVect.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.12 Copyright (c) 1996-2017 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\TI_CCS_Workspace\EPWMSync\KT1205_MGI_V8.5_REVC_MASTER_GPRS_17111
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("LIN1INTA_ISR")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_LIN1INTA_ISR")

     575              $C$DW$78        .dwtag  DW_TAG_TI_branch
     576                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
     577                      .dwattr $C$DW$78, DW_AT_TI_return
     578 00000010 0006          LRETR     ; [CPU_] 
     579                      ; return occurs ; [] 
     580                      .dwattr $C$DW$75, DW_AT_TI_end_file("../source/DSP2803x_SWPrioritizedPieVect.c")
     581                      .dwattr $C$DW$75, DW_AT_TI_end_line(0x1ee)
     582                      .dwattr $C$DW$75, DW_AT_TI_end_column(0x01)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   14

     583                      .dwendentry
     584                      .dwendtag $C$DW$75
     585              
     586              ;**************************************************************
     587              ;* UNDEFINED EXTERNAL REFERENCES                              *
     588              ;**************************************************************
     589                      .global _LIN1INTA_ISR
     590                      .global _ECAN0INTA_ISR
     591                      .global _SCITXINTA_ISR
     592                      .global _LIN0INTA_ISR
     593                      .global _ADCINT4_ISR
     594                      .global _ADCINT5_ISR
     595                      .global _ECAN1INTA_ISR
     596                      .global _ADCINT3_ISR
     597                      .global _SCIRXINTA_ISR
     598                      .global _ECAP1_INT_ISR
     599                      .global _EQEP1_INT_ISR
     600                      .global _EPWM6_INT_ISR
     601                      .global _EPWM7_INT_ISR
     602                      .global _I2CINT1A_ISR
     603                      .global _I2CINT2A_ISR
     604                      .global _SPIRXINTA_ISR
     605                      .global _SPITXINTA_ISR
     606                      .global _EPWM5_INT_ISR
     607                      .global _LVF_ISR
     608                      .global _LUF_ISR
     609                      .global _CLA1_INT8_ISR
     610                      .global _XINT3_ISR
     611                      .global _INT_NOTUSED_ISR
     612                      .global _PIE_RESERVED
     613                      .global _rsvd_ISR
     614                      .global _CLA1_INT7_ISR
     615                      .global _CLA1_INT1_ISR
     616                      .global _CLA1_INT2_ISR
     617                      .global _ADCINT7_ISR
     618                      .global _ADCINT8_ISR
     619                      .global _CLA1_INT5_ISR
     620                      .global _CLA1_INT6_ISR
     621                      .global _CLA1_INT3_ISR
     622                      .global _CLA1_INT4_ISR
     623                      .global _ADCINT6_ISR
     624                      .global _USER7_ISR
     625                      .global _USER8_ISR
     626                      .global _USER5_ISR
     627                      .global _USER6_ISR
     628                      .global _USER11_ISR
     629                      .global _USER12_ISR
     630                      .global _USER9_ISR
     631                      .global _USER10_ISR
     632                      .global _USER4_ISR
     633                      .global _RTOSINT_ISR
     634                      .global _NMI_ISR
     635                      .global _INT14_ISR
     636                      .global _DATALOG_ISR
     637                      .global _USER2_ISR
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   15

     638                      .global _USER3_ISR
     639                      .global _ILLEGAL_ISR
     640                      .global _USER1_ISR
     641                      .global _INT13_ISR
     642                      .global _EPWM6_TZINT_ISR
     643                      .global _EPWM7_TZINT_ISR
     644                      .global _EPWM4_TZINT_ISR
     645                      .global _EPWM5_TZINT_ISR
     646                      .global _EPWM3_INT_ISR
     647                      .global _EPWM4_INT_ISR
     648                      .global _EPWM1_INT_ISR
     649                      .global _EPWM2_INT_ISR
     650                      .global _EPWM3_TZINT_ISR
     651                      .global _XINT2_ISR
     652                      .global _ADCINT9_ISR
     653                      .global _ADCINT2_ISR
     654                      .global _XINT1_ISR
     655                      .global _EPWM1_TZINT_ISR
     656                      .global _EPWM2_TZINT_ISR
     657                      .global _TINT0_ISR
     658                      .global _WAKEINT_ISR
     659                      .global _ADCINT1_ISR
     660                      .global _PieCtrlRegs
     661                      .global _PieVectTable
     662              
     663              ;***************************************************************
     664              ;* TYPE INFORMATION                                            *
     665              ;***************************************************************
     666              
     667              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     668                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     669                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     670              $C$DW$79        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$79, DW_AT_name("ACK1")
     673                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ACK1")
     674                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     675                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     677              $C$DW$80        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     679                      .dwattr $C$DW$80, DW_AT_name("ACK2")
     680                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ACK2")
     681                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$81        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$81, DW_AT_name("ACK3")
     687                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_ACK3")
     688                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$82        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   16

     693                      .dwattr $C$DW$82, DW_AT_name("ACK4")
     694                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ACK4")
     695                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$83        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$83, DW_AT_name("ACK5")
     701                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ACK5")
     702                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     703                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     705              $C$DW$84        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$84, DW_AT_name("ACK6")
     708                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ACK6")
     709                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     710                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     711                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     712              $C$DW$85        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$85, DW_AT_name("ACK7")
     715                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ACK7")
     716                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     717                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     719              $C$DW$86        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$86, DW_AT_name("ACK8")
     722                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ACK8")
     723                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     724                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     725                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     726              $C$DW$87        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$87, DW_AT_name("ACK9")
     729                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ACK9")
     730                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     731                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$88        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$88, DW_AT_name("ACK10")
     736                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ACK10")
     737                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$89        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$89, DW_AT_name("ACK11")
     743                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ACK11")
     744                      .dwattr $C$DW$89, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     745                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$90        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   17

     748                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$90, DW_AT_name("ACK12")
     750                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ACK12")
     751                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     752                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     754              $C$DW$91        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$91, DW_AT_name("rsvd")
     757                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd")
     758                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     759                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     761                      .dwendtag $C$DW$T$20
     762              
     763              
     764              $C$DW$T$21      .dwtag  DW_TAG_union_type
     765                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
     766                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     767              $C$DW$92        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$92, DW_AT_name("all")
     770                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_all")
     771                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     773              $C$DW$93        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
     775                      .dwattr $C$DW$93, DW_AT_name("bit")
     776                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_bit")
     777                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     779                      .dwendtag $C$DW$T$21
     780              
     781              
     782              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     783                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
     784                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     785              $C$DW$94        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$94, DW_AT_name("ENPIE")
     788                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_ENPIE")
     789                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     790                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$95        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$95, DW_AT_name("PIEVECT")
     795                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PIEVECT")
     796                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     797                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     799                      .dwendtag $C$DW$T$22
     800              
     801              
     802              $C$DW$T$23      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   18

     803                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
     804                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     805              $C$DW$96        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$96, DW_AT_name("all")
     808                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
     809                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$97        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
     813                      .dwattr $C$DW$97, DW_AT_name("bit")
     814                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
     815                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     817                      .dwendtag $C$DW$T$23
     818              
     819              
     820              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     821                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
     822                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     823              $C$DW$98        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     825                      .dwattr $C$DW$98, DW_AT_name("INTx1")
     826                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTx1")
     827                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     830              $C$DW$99        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$99, DW_AT_name("INTx2")
     833                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTx2")
     834                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     837              $C$DW$100       .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$100, DW_AT_name("INTx3")
     840                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx3")
     841                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     842                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     844              $C$DW$101       .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$101, DW_AT_name("INTx4")
     847                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTx4")
     848                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     849                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     851              $C$DW$102       .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$102, DW_AT_name("INTx5")
     854                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTx5")
     855                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     856                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   19

     858              $C$DW$103       .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$103, DW_AT_name("INTx6")
     861                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx6")
     862                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     863                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$104       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$104, DW_AT_name("INTx7")
     868                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx7")
     869                      .dwattr $C$DW$104, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     870                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     872              $C$DW$105       .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     874                      .dwattr $C$DW$105, DW_AT_name("INTx8")
     875                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx8")
     876                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     877                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$106       .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$106, DW_AT_name("rsvd")
     882                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd")
     883                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     884                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     886                      .dwendtag $C$DW$T$24
     887              
     888              
     889              $C$DW$T$25      .dwtag  DW_TAG_union_type
     890                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
     891                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     892              $C$DW$107       .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$107, DW_AT_name("all")
     895                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
     896                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$108       .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$24)
     900                      .dwattr $C$DW$108, DW_AT_name("bit")
     901                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
     902                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     904                      .dwendtag $C$DW$T$25
     905              
     906              
     907              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     908                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
     909                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     910              $C$DW$109       .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$109, DW_AT_name("INTx1")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   20

     913                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx1")
     914                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     915                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$110       .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$110, DW_AT_name("INTx2")
     920                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx2")
     921                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     922                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$111       .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$111, DW_AT_name("INTx3")
     927                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx3")
     928                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     929                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$112       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$112, DW_AT_name("INTx4")
     934                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx4")
     935                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     936                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     938              $C$DW$113       .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$113, DW_AT_name("INTx5")
     941                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INTx5")
     942                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     943                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     945              $C$DW$114       .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$114, DW_AT_name("INTx6")
     948                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_INTx6")
     949                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     950                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$115       .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
     954                      .dwattr $C$DW$115, DW_AT_name("INTx7")
     955                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx7")
     956                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     957                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     958                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     959              $C$DW$116       .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$116, DW_AT_name("INTx8")
     962                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx8")
     963                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     964                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     966              $C$DW$117       .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   21

     968                      .dwattr $C$DW$117, DW_AT_name("rsvd")
     969                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd")
     970                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     971                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     973                      .dwendtag $C$DW$T$26
     974              
     975              
     976              $C$DW$T$27      .dwtag  DW_TAG_union_type
     977                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
     978                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     979              $C$DW$118       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$118, DW_AT_name("all")
     982                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
     983                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$119       .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$26)
     987                      .dwattr $C$DW$119, DW_AT_name("bit")
     988                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
     989                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     991                      .dwendtag $C$DW$T$27
     992              
     993              
     994              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     995                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
     996                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
     997              $C$DW$120       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$23)
     999                      .dwattr $C$DW$120, DW_AT_name("PIECTRL")
    1000                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PIECTRL")
    1001                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$121       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1005                      .dwattr $C$DW$121, DW_AT_name("PIEACK")
    1006                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PIEACK")
    1007                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1008                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$122       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$25)
    1011                      .dwattr $C$DW$122, DW_AT_name("PIEIER1")
    1012                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PIEIER1")
    1013                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1014                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$123       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    1017                      .dwattr $C$DW$123, DW_AT_name("PIEIFR1")
    1018                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PIEIFR1")
    1019                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1020                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$124       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   22

    1023                      .dwattr $C$DW$124, DW_AT_name("PIEIER2")
    1024                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PIEIER2")
    1025                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1026                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$125       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    1029                      .dwattr $C$DW$125, DW_AT_name("PIEIFR2")
    1030                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PIEIFR2")
    1031                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1032                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$126       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1035                      .dwattr $C$DW$126, DW_AT_name("PIEIER3")
    1036                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PIEIER3")
    1037                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1038                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$127       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    1041                      .dwattr $C$DW$127, DW_AT_name("PIEIFR3")
    1042                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PIEIFR3")
    1043                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1044                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$128       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$25)
    1047                      .dwattr $C$DW$128, DW_AT_name("PIEIER4")
    1048                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PIEIER4")
    1049                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1050                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$129       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    1053                      .dwattr $C$DW$129, DW_AT_name("PIEIFR4")
    1054                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PIEIFR4")
    1055                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1056                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$130       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$25)
    1059                      .dwattr $C$DW$130, DW_AT_name("PIEIER5")
    1060                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PIEIER5")
    1061                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1062                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$131       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    1065                      .dwattr $C$DW$131, DW_AT_name("PIEIFR5")
    1066                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PIEIFR5")
    1067                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1068                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$132       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$25)
    1071                      .dwattr $C$DW$132, DW_AT_name("PIEIER6")
    1072                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PIEIER6")
    1073                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1074                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$133       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    1077                      .dwattr $C$DW$133, DW_AT_name("PIEIFR6")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   23

    1078                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PIEIFR6")
    1079                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1080                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$134       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$25)
    1083                      .dwattr $C$DW$134, DW_AT_name("PIEIER7")
    1084                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PIEIER7")
    1085                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1086                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$135       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
    1089                      .dwattr $C$DW$135, DW_AT_name("PIEIFR7")
    1090                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PIEIFR7")
    1091                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1092                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$136       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$25)
    1095                      .dwattr $C$DW$136, DW_AT_name("PIEIER8")
    1096                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PIEIER8")
    1097                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1098                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$137       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    1101                      .dwattr $C$DW$137, DW_AT_name("PIEIFR8")
    1102                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PIEIFR8")
    1103                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1104                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$138       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$25)
    1107                      .dwattr $C$DW$138, DW_AT_name("PIEIER9")
    1108                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PIEIER9")
    1109                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1110                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$139       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    1113                      .dwattr $C$DW$139, DW_AT_name("PIEIFR9")
    1114                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PIEIFR9")
    1115                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1116                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$140       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$25)
    1119                      .dwattr $C$DW$140, DW_AT_name("PIEIER10")
    1120                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEIER10")
    1121                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1122                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$141       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    1125                      .dwattr $C$DW$141, DW_AT_name("PIEIFR10")
    1126                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PIEIFR10")
    1127                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1128                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$142       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$25)
    1131                      .dwattr $C$DW$142, DW_AT_name("PIEIER11")
    1132                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PIEIER11")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   24

    1133                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1134                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$143       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    1137                      .dwattr $C$DW$143, DW_AT_name("PIEIFR11")
    1138                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PIEIFR11")
    1139                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1140                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$144       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$25)
    1143                      .dwattr $C$DW$144, DW_AT_name("PIEIER12")
    1144                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEIER12")
    1145                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1146                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$145       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    1149                      .dwattr $C$DW$145, DW_AT_name("PIEIFR12")
    1150                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIEIFR12")
    1151                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1152                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1153                      .dwendtag $C$DW$T$28
    1154              
    1155              $C$DW$146       .dwtag  DW_TAG_TI_far_type
    1156                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$28)
    1157              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1158                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$146)
    1159              
    1160              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1161                      .dwattr $C$DW$T$32, DW_AT_name("PIE_VECT_TABLE")
    1162                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x100)
    1163              $C$DW$147       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$31)
    1165                      .dwattr $C$DW$147, DW_AT_name("PIE1_RESERVED")
    1166                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIE1_RESERVED")
    1167                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$148       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
    1171                      .dwattr $C$DW$148, DW_AT_name("PIE2_RESERVED")
    1172                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PIE2_RESERVED")
    1173                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1174                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$149       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1177                      .dwattr $C$DW$149, DW_AT_name("PIE3_RESERVED")
    1178                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PIE3_RESERVED")
    1179                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1180                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1181              $C$DW$150       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    1183                      .dwattr $C$DW$150, DW_AT_name("PIE4_RESERVED")
    1184                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PIE4_RESERVED")
    1185                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1186                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$151       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   25

    1188                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    1189                      .dwattr $C$DW$151, DW_AT_name("PIE5_RESERVED")
    1190                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PIE5_RESERVED")
    1191                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1192                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$152       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1195                      .dwattr $C$DW$152, DW_AT_name("PIE6_RESERVED")
    1196                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PIE6_RESERVED")
    1197                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1198                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1199              $C$DW$153       .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1201                      .dwattr $C$DW$153, DW_AT_name("PIE7_RESERVED")
    1202                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PIE7_RESERVED")
    1203                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1204                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$154       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1207                      .dwattr $C$DW$154, DW_AT_name("PIE8_RESERVED")
    1208                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PIE8_RESERVED")
    1209                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1210                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$155       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
    1213                      .dwattr $C$DW$155, DW_AT_name("PIE9_RESERVED")
    1214                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PIE9_RESERVED")
    1215                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1216                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$156       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    1219                      .dwattr $C$DW$156, DW_AT_name("PIE10_RESERVED")
    1220                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PIE10_RESERVED")
    1221                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1222                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$157       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    1225                      .dwattr $C$DW$157, DW_AT_name("PIE11_RESERVED")
    1226                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PIE11_RESERVED")
    1227                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1228                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$158       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1231                      .dwattr $C$DW$158, DW_AT_name("PIE12_RESERVED")
    1232                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PIE12_RESERVED")
    1233                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1234                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$159       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1237                      .dwattr $C$DW$159, DW_AT_name("PIE13_RESERVED")
    1238                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PIE13_RESERVED")
    1239                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1240                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$160       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   26

    1243                      .dwattr $C$DW$160, DW_AT_name("TINT1")
    1244                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_TINT1")
    1245                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1246                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$161       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1249                      .dwattr $C$DW$161, DW_AT_name("TINT2")
    1250                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_TINT2")
    1251                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1252                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$162       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    1255                      .dwattr $C$DW$162, DW_AT_name("DATALOG")
    1256                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DATALOG")
    1257                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1258                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$163       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1261                      .dwattr $C$DW$163, DW_AT_name("RTOSINT")
    1262                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RTOSINT")
    1263                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1264                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$164       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    1267                      .dwattr $C$DW$164, DW_AT_name("EMUINT")
    1268                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_EMUINT")
    1269                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1270                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$165       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    1273                      .dwattr $C$DW$165, DW_AT_name("NMI")
    1274                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_NMI")
    1275                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1276                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$166       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    1279                      .dwattr $C$DW$166, DW_AT_name("ILLEGAL")
    1280                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ILLEGAL")
    1281                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1282                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$167       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    1285                      .dwattr $C$DW$167, DW_AT_name("USER1")
    1286                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_USER1")
    1287                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1288                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$168       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1291                      .dwattr $C$DW$168, DW_AT_name("USER2")
    1292                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_USER2")
    1293                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1294                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1295              $C$DW$169       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
    1297                      .dwattr $C$DW$169, DW_AT_name("USER3")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   27

    1298                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_USER3")
    1299                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1300                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$170       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
    1303                      .dwattr $C$DW$170, DW_AT_name("USER4")
    1304                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_USER4")
    1305                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1306                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$171       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    1309                      .dwattr $C$DW$171, DW_AT_name("USER5")
    1310                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_USER5")
    1311                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1312                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$172       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    1315                      .dwattr $C$DW$172, DW_AT_name("USER6")
    1316                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_USER6")
    1317                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1318                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$173       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    1321                      .dwattr $C$DW$173, DW_AT_name("USER7")
    1322                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_USER7")
    1323                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1324                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1325              $C$DW$174       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    1327                      .dwattr $C$DW$174, DW_AT_name("USER8")
    1328                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_USER8")
    1329                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1330                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$175       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    1333                      .dwattr $C$DW$175, DW_AT_name("USER9")
    1334                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_USER9")
    1335                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1336                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1337              $C$DW$176       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    1339                      .dwattr $C$DW$176, DW_AT_name("USER10")
    1340                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_USER10")
    1341                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1342                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$177       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1345                      .dwattr $C$DW$177, DW_AT_name("USER11")
    1346                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_USER11")
    1347                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1348                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$178       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1351                      .dwattr $C$DW$178, DW_AT_name("USER12")
    1352                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_USER12")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   28

    1353                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1354                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$179       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    1357                      .dwattr $C$DW$179, DW_AT_name("ADCINT1")
    1358                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCINT1")
    1359                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1360                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$180       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1363                      .dwattr $C$DW$180, DW_AT_name("ADCINT2")
    1364                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADCINT2")
    1365                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1366                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$181       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    1369                      .dwattr $C$DW$181, DW_AT_name("rsvd1_3")
    1370                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1_3")
    1371                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1372                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$182       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1375                      .dwattr $C$DW$182, DW_AT_name("XINT1")
    1376                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_XINT1")
    1377                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1378                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1379              $C$DW$183       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1381                      .dwattr $C$DW$183, DW_AT_name("XINT2")
    1382                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_XINT2")
    1383                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1384                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$184       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1387                      .dwattr $C$DW$184, DW_AT_name("ADCINT9")
    1388                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCINT9")
    1389                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1390                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$185       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    1393                      .dwattr $C$DW$185, DW_AT_name("TINT0")
    1394                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_TINT0")
    1395                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1396                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$186       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1399                      .dwattr $C$DW$186, DW_AT_name("WAKEINT")
    1400                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_WAKEINT")
    1401                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1402                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$187       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1405                      .dwattr $C$DW$187, DW_AT_name("EPWM1_TZINT")
    1406                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    1407                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   29

    1408                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$188       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1411                      .dwattr $C$DW$188, DW_AT_name("EPWM2_TZINT")
    1412                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    1413                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1414                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1415              $C$DW$189       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1417                      .dwattr $C$DW$189, DW_AT_name("EPWM3_TZINT")
    1418                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    1419                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1420                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1421              $C$DW$190       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1423                      .dwattr $C$DW$190, DW_AT_name("EPWM4_TZINT")
    1424                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    1425                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1426                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1427              $C$DW$191       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    1429                      .dwattr $C$DW$191, DW_AT_name("EPWM5_TZINT")
    1430                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    1431                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1432                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1433              $C$DW$192       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$31)
    1435                      .dwattr $C$DW$192, DW_AT_name("EPWM6_TZINT")
    1436                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    1437                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1438                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$193       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
    1441                      .dwattr $C$DW$193, DW_AT_name("EPWM7_TZINT")
    1442                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_EPWM7_TZINT")
    1443                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1444                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$194       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
    1447                      .dwattr $C$DW$194, DW_AT_name("rsvd2_8")
    1448                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd2_8")
    1449                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1450                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$195       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
    1453                      .dwattr $C$DW$195, DW_AT_name("EPWM1_INT")
    1454                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_EPWM1_INT")
    1455                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1456                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1457              $C$DW$196       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$31)
    1459                      .dwattr $C$DW$196, DW_AT_name("EPWM2_INT")
    1460                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_EPWM2_INT")
    1461                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1462                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   30

    1463              $C$DW$197       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$31)
    1465                      .dwattr $C$DW$197, DW_AT_name("EPWM3_INT")
    1466                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EPWM3_INT")
    1467                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1468                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1469              $C$DW$198       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$31)
    1471                      .dwattr $C$DW$198, DW_AT_name("EPWM4_INT")
    1472                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EPWM4_INT")
    1473                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    1474                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1475              $C$DW$199       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$31)
    1477                      .dwattr $C$DW$199, DW_AT_name("EPWM5_INT")
    1478                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EPWM5_INT")
    1479                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1480                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1481              $C$DW$200       .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
    1483                      .dwattr $C$DW$200, DW_AT_name("EPWM6_INT")
    1484                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EPWM6_INT")
    1485                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    1486                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1487              $C$DW$201       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$31)
    1489                      .dwattr $C$DW$201, DW_AT_name("EPWM7_INT")
    1490                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EPWM7_INT")
    1491                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1492                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1493              $C$DW$202       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
    1495                      .dwattr $C$DW$202, DW_AT_name("rsvd3_8")
    1496                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd3_8")
    1497                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    1498                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1499              $C$DW$203       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    1501                      .dwattr $C$DW$203, DW_AT_name("ECAP1_INT")
    1502                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ECAP1_INT")
    1503                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1504                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1505              $C$DW$204       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    1507                      .dwattr $C$DW$204, DW_AT_name("rsvd4_2")
    1508                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd4_2")
    1509                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1510                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1511              $C$DW$205       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
    1513                      .dwattr $C$DW$205, DW_AT_name("rsvd4_3")
    1514                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd4_3")
    1515                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1516                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$206       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   31

    1518                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    1519                      .dwattr $C$DW$206, DW_AT_name("rsvd4_4")
    1520                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd4_4")
    1521                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1522                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1523              $C$DW$207       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
    1525                      .dwattr $C$DW$207, DW_AT_name("rsvd4_5")
    1526                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd4_5")
    1527                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1528                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1529              $C$DW$208       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$31)
    1531                      .dwattr $C$DW$208, DW_AT_name("rsvd4_6")
    1532                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd4_6")
    1533                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1534                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1535              $C$DW$209       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    1537                      .dwattr $C$DW$209, DW_AT_name("rsvd4_7")
    1538                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd4_7")
    1539                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1540                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$210       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$31)
    1543                      .dwattr $C$DW$210, DW_AT_name("rsvd4_8")
    1544                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd4_8")
    1545                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1546                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$211       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1549                      .dwattr $C$DW$211, DW_AT_name("EQEP1_INT")
    1550                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_EQEP1_INT")
    1551                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1552                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$212       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    1555                      .dwattr $C$DW$212, DW_AT_name("rsvd5_2")
    1556                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd5_2")
    1557                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1558                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$213       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
    1561                      .dwattr $C$DW$213, DW_AT_name("rsvd5_3")
    1562                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd5_3")
    1563                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1564                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$214       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$31)
    1567                      .dwattr $C$DW$214, DW_AT_name("rsvd5_4")
    1568                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd5_4")
    1569                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    1570                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$215       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   32

    1573                      .dwattr $C$DW$215, DW_AT_name("rsvd5_5")
    1574                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd5_5")
    1575                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1576                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$216       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
    1579                      .dwattr $C$DW$216, DW_AT_name("rsvd5_6")
    1580                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd5_6")
    1581                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1582                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$217       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$31)
    1585                      .dwattr $C$DW$217, DW_AT_name("rsvd5_7")
    1586                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd5_7")
    1587                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1588                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$218       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    1591                      .dwattr $C$DW$218, DW_AT_name("rsvd5_8")
    1592                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd5_8")
    1593                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    1594                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$219       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$31)
    1597                      .dwattr $C$DW$219, DW_AT_name("SPIRXINTA")
    1598                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SPIRXINTA")
    1599                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1600                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$220       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$31)
    1603                      .dwattr $C$DW$220, DW_AT_name("SPITXINTA")
    1604                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_SPITXINTA")
    1605                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1606                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1607              $C$DW$221       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
    1609                      .dwattr $C$DW$221, DW_AT_name("SPIRXINTB")
    1610                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_SPIRXINTB")
    1611                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1612                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1613              $C$DW$222       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    1615                      .dwattr $C$DW$222, DW_AT_name("SPITXINTB")
    1616                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SPITXINTB")
    1617                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    1618                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$223       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
    1621                      .dwattr $C$DW$223, DW_AT_name("rsvd6_5")
    1622                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd6_5")
    1623                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1624                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1625              $C$DW$224       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    1627                      .dwattr $C$DW$224, DW_AT_name("rsvd6_6")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   33

    1628                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd6_6")
    1629                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    1630                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1631              $C$DW$225       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
    1633                      .dwattr $C$DW$225, DW_AT_name("rsvd6_7")
    1634                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd6_7")
    1635                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1636                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$226       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$31)
    1639                      .dwattr $C$DW$226, DW_AT_name("rsvd6_8")
    1640                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd6_8")
    1641                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    1642                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$227       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
    1645                      .dwattr $C$DW$227, DW_AT_name("rsvd7_1")
    1646                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd7_1")
    1647                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1648                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1649              $C$DW$228       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
    1651                      .dwattr $C$DW$228, DW_AT_name("rsvd7_2")
    1652                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_rsvd7_2")
    1653                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    1654                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$229       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
    1657                      .dwattr $C$DW$229, DW_AT_name("rsvd7_3")
    1658                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_rsvd7_3")
    1659                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1660                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1661              $C$DW$230       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
    1663                      .dwattr $C$DW$230, DW_AT_name("rsvd7_4")
    1664                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd7_4")
    1665                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    1666                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1667              $C$DW$231       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$31)
    1669                      .dwattr $C$DW$231, DW_AT_name("rsvd7_5")
    1670                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd7_5")
    1671                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1672                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1673              $C$DW$232       .dwtag  DW_TAG_member
    1674                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
    1675                      .dwattr $C$DW$232, DW_AT_name("rsvd7_6")
    1676                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd7_6")
    1677                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    1678                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1679              $C$DW$233       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    1681                      .dwattr $C$DW$233, DW_AT_name("rsvd7_7")
    1682                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_rsvd7_7")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   34

    1683                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1684                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1685              $C$DW$234       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$31)
    1687                      .dwattr $C$DW$234, DW_AT_name("rsvd7_8")
    1688                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd7_8")
    1689                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    1690                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1691              $C$DW$235       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$31)
    1693                      .dwattr $C$DW$235, DW_AT_name("I2CINT1A")
    1694                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_I2CINT1A")
    1695                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1696                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1697              $C$DW$236       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
    1699                      .dwattr $C$DW$236, DW_AT_name("I2CINT2A")
    1700                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_I2CINT2A")
    1701                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    1702                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1703              $C$DW$237       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$31)
    1705                      .dwattr $C$DW$237, DW_AT_name("rsvd8_3")
    1706                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd8_3")
    1707                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1708                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1709              $C$DW$238       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$31)
    1711                      .dwattr $C$DW$238, DW_AT_name("rsvd8_4")
    1712                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd8_4")
    1713                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    1714                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1715              $C$DW$239       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    1717                      .dwattr $C$DW$239, DW_AT_name("rsvd8_5")
    1718                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd8_5")
    1719                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1720                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1721              $C$DW$240       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    1723                      .dwattr $C$DW$240, DW_AT_name("rsvd8_6")
    1724                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd8_6")
    1725                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    1726                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1727              $C$DW$241       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    1729                      .dwattr $C$DW$241, DW_AT_name("rsvd8_7")
    1730                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_rsvd8_7")
    1731                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1732                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1733              $C$DW$242       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    1735                      .dwattr $C$DW$242, DW_AT_name("rsvd8_8")
    1736                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_rsvd8_8")
    1737                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   35

    1738                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1739              $C$DW$243       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    1741                      .dwattr $C$DW$243, DW_AT_name("SCIRXINTA")
    1742                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_SCIRXINTA")
    1743                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1744                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$244       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
    1747                      .dwattr $C$DW$244, DW_AT_name("SCITXINTA")
    1748                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_SCITXINTA")
    1749                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    1750                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$245       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
    1753                      .dwattr $C$DW$245, DW_AT_name("LIN0INTA")
    1754                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_LIN0INTA")
    1755                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1756                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$246       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$31)
    1759                      .dwattr $C$DW$246, DW_AT_name("LIN1INTA")
    1760                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_LIN1INTA")
    1761                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    1762                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$247       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
    1765                      .dwattr $C$DW$247, DW_AT_name("ECAN0INTA")
    1766                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_ECAN0INTA")
    1767                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1768                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$248       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$31)
    1771                      .dwattr $C$DW$248, DW_AT_name("ECAN1INTA")
    1772                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_ECAN1INTA")
    1773                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    1774                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$249       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$31)
    1777                      .dwattr $C$DW$249, DW_AT_name("rsvd9_7")
    1778                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd9_7")
    1779                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1780                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1781              $C$DW$250       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$31)
    1783                      .dwattr $C$DW$250, DW_AT_name("rsvd9_8")
    1784                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_rsvd9_8")
    1785                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    1786                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$251       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$31)
    1789                      .dwattr $C$DW$251, DW_AT_name("rsvd10_1")
    1790                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd10_1")
    1791                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1792                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:33 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0421610                            PAGE   36

    1793              $C$DW$252       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$31)
    1795                      .dwattr $C$DW$252, DW_AT_name("rsvd10_2")
    1796                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd10_2")
    1797                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    1798                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1799              $C$DW$253       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$31)
    1801                      .dwattr $C$DW$253, DW_AT_name("ADCINT3")
    1802                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_ADCINT3")
    1803                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1804                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1805              $C$DW$254       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$31)
    1807                      .dwattr $C$DW$254, DW_AT_name("ADCINT4")
    1808                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_ADCINT4")
    1809                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
