TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:39 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_PieVect.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SCITXINTA_ISR")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SCITXINTA_ISR")

     819              
     820 00000010 0006          LRETR     ; [CPU_] 
     821                      ; return occurs ; [] 
     822                      .dwattr $C$DW$77, DW_AT_TI_end_file("../source/DSP2803x_PieVect.c")
     823                      .dwattr $C$DW$77, DW_AT_TI_end_line(0xcb)
     824                      .dwattr $C$DW$77, DW_AT_TI_end_column(0x01)
     825                      .dwendentry
     826                      .dwendtag $C$DW$77
     827              
     828              ;**************************************************************
     829              ;* UNDEFINED EXTERNAL REFERENCES                              *
     830              ;**************************************************************
     831                      .global _SCITXINTA_ISR
     832                      .global _LIN0INTA_ISR
     833                      .global _I2CINT2A_ISR
     834                      .global _SCIRXINTA_ISR
     835                      .global _I2CINT1A_ISR
     836                      .global _ADCINT3_ISR
     837                      .global _ADCINT4_ISR
     838                      .global _ECAN0INTA_ISR
     839                      .global _ECAN1INTA_ISR
     840                      .global _ECAP1_INT_ISR
     841                      .global _EQEP1_INT_ISR
     842                      .global _EPWM6_INT_ISR
     843                      .global _EPWM7_INT_ISR
     844                      .global _EPWM5_INT_ISR
     845                      .global _SPITXINTB_ISR
     846                      .global _LIN1INTA_ISR
     847                      .global _SPITXINTA_ISR
     848                      .global _SPIRXINTB_ISR
     849                      .global _CLA1_INT8_ISR
     850                      .global _XINT3_ISR
     851                      .global _CLA1_INT6_ISR
     852                      .global _CLA1_INT7_ISR
     853                      .global _CLA1_INT5_ISR
     854                      .global _rsvd_ISR
     855                      .global _LUF_ISR
     856                      .global _PIE_RESERVED
     857                      .global _ADCINT7_ISR
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   19

     858                      .global _ADCINT8_ISR
     859                      .global _ADCINT5_ISR
     860                      .global _ADCINT6_ISR
     861                      .global _SPIRXINTA_ISR
     862                      .global _CLA1_INT4_ISR
     863                      .global _LVF_ISR
     864                      .global _CLA1_INT2_ISR
     865                      .global _CLA1_INT3_ISR
     866                      .global _CLA1_INT1_ISR
     867                      .global _USER6_ISR
     868                      .global _USER7_ISR
     869                      .global _USER4_ISR
     870                      .global _USER5_ISR
     871                      .global _USER3_ISR
     872                      .global _USER11_ISR
     873                      .global _USER12_ISR
     874                      .global _USER9_ISR
     875                      .global _USER10_ISR
     876                      .global _RTOSINT_ISR
     877                      .global _EMUINT_ISR
     878                      .global _INT14_ISR
     879                      .global _DATALOG_ISR
     880                      .global _INT13_ISR
     881                      .global _USER2_ISR
     882                      .global _USER8_ISR
     883                      .global _ILLEGAL_ISR
     884                      .global _USER1_ISR
     885                      .global _EPWM5_TZINT_ISR
     886                      .global _EPWM6_TZINT_ISR
     887                      .global _EPWM3_TZINT_ISR
     888                      .global _EPWM4_TZINT_ISR
     889                      .global _EPWM2_TZINT_ISR
     890                      .global _EPWM3_INT_ISR
     891                      .global _EPWM4_INT_ISR
     892                      .global _EPWM1_INT_ISR
     893                      .global _EPWM2_INT_ISR
     894                      .global _XINT1_ISR
     895                      .global _XINT2_ISR
     896                      .global _ADCINT1_ISR
     897                      .global _ADCINT2_ISR
     898                      .global _NMI_ISR
     899                      .global _EPWM1_TZINT_ISR
     900                      .global _EPWM7_TZINT_ISR
     901                      .global _TINT0_ISR
     902                      .global _WAKEINT_ISR
     903                      .global _ADCINT9_ISR
     904                      .global _PieCtrlRegs
     905                      .global _PieVectTable
     906              
     907              ;***************************************************************
     908              ;* TYPE INFORMATION                                            *
     909              ;***************************************************************
     910              
     911              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     912                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   20

     913                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     914              $C$DW$81        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$81, DW_AT_name("ACK1")
     917                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_ACK1")
     918                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0f)
     919                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     920                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$82        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$82, DW_AT_name("ACK2")
     926                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ACK2")
     927                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0e)
     928                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     929                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     931              
     932              $C$DW$83        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     934                      .dwattr $C$DW$83, DW_AT_name("ACK3")
     935                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ACK3")
     936                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0d)
     937                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     938                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941              $C$DW$84        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$84, DW_AT_name("ACK4")
     944                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ACK4")
     945                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
     946                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$85        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$85, DW_AT_name("ACK5")
     953                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ACK5")
     954                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0b)
     955                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     956                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     958              
     959              $C$DW$86        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$86, DW_AT_name("ACK6")
     962                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ACK6")
     963                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0a)
     964                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     965                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     967              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   21

     968              $C$DW$87        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$87, DW_AT_name("ACK7")
     971                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ACK7")
     972                      .dwattr $C$DW$87, DW_AT_bit_offset(0x09)
     973                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     974                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977              $C$DW$88        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$88, DW_AT_name("ACK8")
     980                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ACK8")
     981                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
     982                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     983                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$89        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$89, DW_AT_name("ACK9")
     989                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ACK9")
     990                      .dwattr $C$DW$89, DW_AT_bit_offset(0x07)
     991                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$90        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$90, DW_AT_name("ACK10")
     998                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ACK10")
     999                      .dwattr $C$DW$90, DW_AT_bit_offset(0x06)
    1000                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1003              
    1004              $C$DW$91        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$91, DW_AT_name("ACK11")
    1007                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ACK11")
    1008                      .dwattr $C$DW$91, DW_AT_bit_offset(0x05)
    1009                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1010                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$92        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$92, DW_AT_name("ACK12")
    1016                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ACK12")
    1017                      .dwattr $C$DW$92, DW_AT_bit_offset(0x04)
    1018                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1019                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022              $C$DW$93        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   22

    1023                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$93, DW_AT_name("rsvd")
    1025                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd")
    1026                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
    1027                      .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1028                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031                      .dwendtag $C$DW$T$20
    1032              
    1033              
    1034              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1035                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1036                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1037              $C$DW$94        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$94, DW_AT_name("all")
    1040                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    1041                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044              $C$DW$95        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1046                      .dwattr $C$DW$95, DW_AT_name("bit")
    1047                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    1048                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1050              
    1051                      .dwendtag $C$DW$T$21
    1052              
    1053              
    1054              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1055                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1056                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1057              $C$DW$96        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$96, DW_AT_name("ENPIE")
    1060                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ENPIE")
    1061                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0f)
    1062                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$97        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$97, DW_AT_name("PIEVECT")
    1069                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PIEVECT")
    1070                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1071                      .dwattr $C$DW$97, DW_AT_bit_size(0x0f)
    1072                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075                      .dwendtag $C$DW$T$22
    1076              
    1077              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   23

    1078              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1079                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1080                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1081              $C$DW$98        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$98, DW_AT_name("all")
    1084                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    1085                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088              $C$DW$99        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$22)
    1090                      .dwattr $C$DW$99, DW_AT_name("bit")
    1091                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    1092                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095                      .dwendtag $C$DW$T$23
    1096              
    1097              
    1098              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1099                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
    1100                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1101              $C$DW$100       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$100, DW_AT_name("INTx1")
    1104                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx1")
    1105                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f)
    1106                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$101       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$101, DW_AT_name("INTx2")
    1113                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTx2")
    1114                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e)
    1115                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$102       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$102, DW_AT_name("INTx3")
    1122                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTx3")
    1123                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0d)
    1124                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$103       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$103, DW_AT_name("INTx4")
    1131                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx4")
    1132                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   24

    1133                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$104       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$104, DW_AT_name("INTx5")
    1140                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx5")
    1141                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0b)
    1142                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1143                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146              $C$DW$105       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$105, DW_AT_name("INTx6")
    1149                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx6")
    1150                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a)
    1151                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$106       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$106, DW_AT_name("INTx7")
    1158                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx7")
    1159                      .dwattr $C$DW$106, DW_AT_bit_offset(0x09)
    1160                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$107       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$107, DW_AT_name("INTx8")
    1167                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx8")
    1168                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08)
    1169                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$108       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$108, DW_AT_name("rsvd")
    1176                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd")
    1177                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    1178                      .dwattr $C$DW$108, DW_AT_bit_size(0x08)
    1179                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182                      .dwendtag $C$DW$T$24
    1183              
    1184              
    1185              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1186                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
    1187                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   25

    1188              $C$DW$109       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$109, DW_AT_name("all")
    1191                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    1192                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1194              
    1195              $C$DW$110       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$24)
    1197                      .dwattr $C$DW$110, DW_AT_name("bit")
    1198                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1199                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202                      .dwendtag $C$DW$T$25
    1203              
    1204              
    1205              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1206                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
    1207                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1208              $C$DW$111       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$111, DW_AT_name("INTx1")
    1211                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx1")
    1212                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0f)
    1213                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$112       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$112, DW_AT_name("INTx2")
    1220                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx2")
    1221                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0e)
    1222                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1224                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$113       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$113, DW_AT_name("INTx3")
    1229                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INTx3")
    1230                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0d)
    1231                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1232                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$114       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$114, DW_AT_name("INTx4")
    1238                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_INTx4")
    1239                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0c)
    1240                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   26

    1243              
    1244              $C$DW$115       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$115, DW_AT_name("INTx5")
    1247                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx5")
    1248                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0b)
    1249                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1250                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253              $C$DW$116       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$116, DW_AT_name("INTx6")
    1256                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx6")
    1257                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0a)
    1258                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$117       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$117, DW_AT_name("INTx7")
    1265                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx7")
    1266                      .dwattr $C$DW$117, DW_AT_bit_offset(0x09)
    1267                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1268                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$118       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$118, DW_AT_name("INTx8")
    1274                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx8")
    1275                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08)
    1276                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$119       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$119, DW_AT_name("rsvd")
    1283                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd")
    1284                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1285                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    1286                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289                      .dwendtag $C$DW$T$26
    1290              
    1291              
    1292              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1293                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
    1294                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1295              $C$DW$120       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1297                      .dwattr $C$DW$120, DW_AT_name("all")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   27

    1298                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1299                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302              $C$DW$121       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$26)
    1304                      .dwattr $C$DW$121, DW_AT_name("bit")
    1305                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    1306                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1308              
    1309                      .dwendtag $C$DW$T$27
    1310              
    1311              
    1312              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1313                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
    1314                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
    1315              $C$DW$122       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    1317                      .dwattr $C$DW$122, DW_AT_name("PIECTRL")
    1318                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PIECTRL")
    1319                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1321              
    1322              $C$DW$123       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1324                      .dwattr $C$DW$123, DW_AT_name("PIEACK")
    1325                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PIEACK")
    1326                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1327                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$124       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$25)
    1331                      .dwattr $C$DW$124, DW_AT_name("PIEIER1")
    1332                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PIEIER1")
    1333                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1334                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$125       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    1338                      .dwattr $C$DW$125, DW_AT_name("PIEIFR1")
    1339                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PIEIFR1")
    1340                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1341                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343              $C$DW$126       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1345                      .dwattr $C$DW$126, DW_AT_name("PIEIER2")
    1346                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PIEIER2")
    1347                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1348                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$127       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    1352                      .dwattr $C$DW$127, DW_AT_name("PIEIFR2")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   28

    1353                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PIEIFR2")
    1354                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1355                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$128       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$25)
    1359                      .dwattr $C$DW$128, DW_AT_name("PIEIER3")
    1360                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PIEIER3")
    1361                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1362                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$129       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    1366                      .dwattr $C$DW$129, DW_AT_name("PIEIFR3")
    1367                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PIEIFR3")
    1368                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1369                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$130       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$25)
    1373                      .dwattr $C$DW$130, DW_AT_name("PIEIER4")
    1374                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PIEIER4")
    1375                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1376                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$131       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    1380                      .dwattr $C$DW$131, DW_AT_name("PIEIFR4")
    1381                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PIEIFR4")
    1382                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1383                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$132       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$25)
    1387                      .dwattr $C$DW$132, DW_AT_name("PIEIER5")
    1388                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PIEIER5")
    1389                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1390                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$133       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    1394                      .dwattr $C$DW$133, DW_AT_name("PIEIFR5")
    1395                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PIEIFR5")
    1396                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1397                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$134       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$25)
    1401                      .dwattr $C$DW$134, DW_AT_name("PIEIER6")
    1402                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PIEIER6")
    1403                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1404                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$135       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   29

    1408                      .dwattr $C$DW$135, DW_AT_name("PIEIFR6")
    1409                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PIEIFR6")
    1410                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1411                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$136       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$25)
    1415                      .dwattr $C$DW$136, DW_AT_name("PIEIER7")
    1416                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PIEIER7")
    1417                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1418                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$137       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    1422                      .dwattr $C$DW$137, DW_AT_name("PIEIFR7")
    1423                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PIEIFR7")
    1424                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1425                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1426              
    1427              $C$DW$138       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$25)
    1429                      .dwattr $C$DW$138, DW_AT_name("PIEIER8")
    1430                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PIEIER8")
    1431                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1432                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$139       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    1436                      .dwattr $C$DW$139, DW_AT_name("PIEIFR8")
    1437                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PIEIFR8")
    1438                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1439                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$140       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$25)
    1443                      .dwattr $C$DW$140, DW_AT_name("PIEIER9")
    1444                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEIER9")
    1445                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1446                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$141       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    1450                      .dwattr $C$DW$141, DW_AT_name("PIEIFR9")
    1451                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PIEIFR9")
    1452                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1453                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1454              
    1455              $C$DW$142       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$25)
    1457                      .dwattr $C$DW$142, DW_AT_name("PIEIER10")
    1458                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PIEIER10")
    1459                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1460                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$143       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   30

    1463                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    1464                      .dwattr $C$DW$143, DW_AT_name("PIEIFR10")
    1465                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PIEIFR10")
    1466                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1467                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$144       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$25)
    1471                      .dwattr $C$DW$144, DW_AT_name("PIEIER11")
    1472                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEIER11")
    1473                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1474                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$145       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    1478                      .dwattr $C$DW$145, DW_AT_name("PIEIFR11")
    1479                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIEIFR11")
    1480                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1481                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$146       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$25)
    1485                      .dwattr $C$DW$146, DW_AT_name("PIEIER12")
    1486                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIEIER12")
    1487                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1488                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1489              
    1490              $C$DW$147       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    1492                      .dwattr $C$DW$147, DW_AT_name("PIEIFR12")
    1493                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIEIFR12")
    1494                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1495                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497                      .dwendtag $C$DW$T$28
    1498              
    1499              $C$DW$148       .dwtag  DW_TAG_TI_far_type
    1500                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$28)
    1501              
    1502              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1503                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$148)
    1504              
    1505              
    1506              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1507                      .dwattr $C$DW$T$32, DW_AT_name("PIE_VECT_TABLE")
    1508                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x100)
    1509              $C$DW$149       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1511                      .dwattr $C$DW$149, DW_AT_name("PIE1_RESERVED")
    1512                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PIE1_RESERVED")
    1513                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1515              
    1516              $C$DW$150       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   31

    1518                      .dwattr $C$DW$150, DW_AT_name("PIE2_RESERVED")
    1519                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PIE2_RESERVED")
    1520                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1521                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1522              
    1523              $C$DW$151       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    1525                      .dwattr $C$DW$151, DW_AT_name("PIE3_RESERVED")
    1526                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PIE3_RESERVED")
    1527                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1528                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1529              
    1530              $C$DW$152       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1532                      .dwattr $C$DW$152, DW_AT_name("PIE4_RESERVED")
    1533                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PIE4_RESERVED")
    1534                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1535                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1536              
    1537              $C$DW$153       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1539                      .dwattr $C$DW$153, DW_AT_name("PIE5_RESERVED")
    1540                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PIE5_RESERVED")
    1541                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1542                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1543              
    1544              $C$DW$154       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1546                      .dwattr $C$DW$154, DW_AT_name("PIE6_RESERVED")
    1547                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PIE6_RESERVED")
    1548                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1549                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1550              
    1551              $C$DW$155       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
    1553                      .dwattr $C$DW$155, DW_AT_name("PIE7_RESERVED")
    1554                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PIE7_RESERVED")
    1555                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1556                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1557              
    1558              $C$DW$156       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    1560                      .dwattr $C$DW$156, DW_AT_name("PIE8_RESERVED")
    1561                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PIE8_RESERVED")
    1562                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1563                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1564              
    1565              $C$DW$157       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    1567                      .dwattr $C$DW$157, DW_AT_name("PIE9_RESERVED")
    1568                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PIE9_RESERVED")
    1569                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1570                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1571              
    1572              $C$DW$158       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   32

    1573                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1574                      .dwattr $C$DW$158, DW_AT_name("PIE10_RESERVED")
    1575                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PIE10_RESERVED")
    1576                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1577                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1578              
    1579              $C$DW$159       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1581                      .dwattr $C$DW$159, DW_AT_name("PIE11_RESERVED")
    1582                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PIE11_RESERVED")
    1583                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1584                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1585              
    1586              $C$DW$160       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1588                      .dwattr $C$DW$160, DW_AT_name("PIE12_RESERVED")
    1589                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PIE12_RESERVED")
    1590                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1591                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1592              
    1593              $C$DW$161       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1595                      .dwattr $C$DW$161, DW_AT_name("PIE13_RESERVED")
    1596                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PIE13_RESERVED")
    1597                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1598                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$162       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    1602                      .dwattr $C$DW$162, DW_AT_name("TINT1")
    1603                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_TINT1")
    1604                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1605                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1606              
    1607              $C$DW$163       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1609                      .dwattr $C$DW$163, DW_AT_name("TINT2")
    1610                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_TINT2")
    1611                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1612                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$164       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    1616                      .dwattr $C$DW$164, DW_AT_name("DATALOG")
    1617                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_DATALOG")
    1618                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1619                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1620              
    1621              $C$DW$165       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    1623                      .dwattr $C$DW$165, DW_AT_name("RTOSINT")
    1624                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RTOSINT")
    1625                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1626                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1627              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   33

    1628              $C$DW$166       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    1630                      .dwattr $C$DW$166, DW_AT_name("EMUINT")
    1631                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_EMUINT")
    1632                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1633                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$167       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    1637                      .dwattr $C$DW$167, DW_AT_name("NMI")
    1638                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_NMI")
    1639                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1640                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1641              
    1642              $C$DW$168       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1644                      .dwattr $C$DW$168, DW_AT_name("ILLEGAL")
    1645                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ILLEGAL")
    1646                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1647                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1648              
    1649              $C$DW$169       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
    1651                      .dwattr $C$DW$169, DW_AT_name("USER1")
    1652                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_USER1")
    1653                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1654                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1655              
    1656              $C$DW$170       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
    1658                      .dwattr $C$DW$170, DW_AT_name("USER2")
    1659                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_USER2")
    1660                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1661                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1662              
    1663              $C$DW$171       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    1665                      .dwattr $C$DW$171, DW_AT_name("USER3")
    1666                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_USER3")
    1667                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1668                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1669              
    1670              $C$DW$172       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    1672                      .dwattr $C$DW$172, DW_AT_name("USER4")
    1673                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_USER4")
    1674                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1675                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$173       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    1679                      .dwattr $C$DW$173, DW_AT_name("USER5")
    1680                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_USER5")
    1681                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1682                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   34

    1683              
    1684              $C$DW$174       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    1686                      .dwattr $C$DW$174, DW_AT_name("USER6")
    1687                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_USER6")
    1688                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1689                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1690              
    1691              $C$DW$175       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    1693                      .dwattr $C$DW$175, DW_AT_name("USER7")
    1694                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_USER7")
    1695                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1696                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698              $C$DW$176       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    1700                      .dwattr $C$DW$176, DW_AT_name("USER8")
    1701                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_USER8")
    1702                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1703                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$177       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1707                      .dwattr $C$DW$177, DW_AT_name("USER9")
    1708                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_USER9")
    1709                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1710                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$178       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1714                      .dwattr $C$DW$178, DW_AT_name("USER10")
    1715                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_USER10")
    1716                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1717                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1718              
    1719              $C$DW$179       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    1721                      .dwattr $C$DW$179, DW_AT_name("USER11")
    1722                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_USER11")
    1723                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1724                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1725              
    1726              $C$DW$180       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1728                      .dwattr $C$DW$180, DW_AT_name("USER12")
    1729                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_USER12")
    1730                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1731                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$181       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    1735                      .dwattr $C$DW$181, DW_AT_name("ADCINT1")
    1736                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCINT1")
    1737                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   35

    1738                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740              $C$DW$182       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1742                      .dwattr $C$DW$182, DW_AT_name("ADCINT2")
    1743                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCINT2")
    1744                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1745                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1746              
    1747              $C$DW$183       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1749                      .dwattr $C$DW$183, DW_AT_name("rsvd1_3")
    1750                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1_3")
    1751                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1752                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1753              
    1754              $C$DW$184       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1756                      .dwattr $C$DW$184, DW_AT_name("XINT1")
    1757                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_XINT1")
    1758                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1759                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$185       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    1763                      .dwattr $C$DW$185, DW_AT_name("XINT2")
    1764                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_XINT2")
    1765                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1766                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1767              
    1768              $C$DW$186       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1770                      .dwattr $C$DW$186, DW_AT_name("ADCINT9")
    1771                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ADCINT9")
    1772                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1773                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$187       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1777                      .dwattr $C$DW$187, DW_AT_name("TINT0")
    1778                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_TINT0")
    1779                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1780                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1781              
    1782              $C$DW$188       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1784                      .dwattr $C$DW$188, DW_AT_name("WAKEINT")
    1785                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_WAKEINT")
    1786                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1787                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1788              
    1789              $C$DW$189       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1791                      .dwattr $C$DW$189, DW_AT_name("EPWM1_TZINT")
    1792                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_EPWM1_TZINT")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   36

    1793                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1794                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$190       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1798                      .dwattr $C$DW$190, DW_AT_name("EPWM2_TZINT")
    1799                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    1800                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1801                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1802              
    1803              $C$DW$191       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    1805                      .dwattr $C$DW$191, DW_AT_name("EPWM3_TZINT")
    1806                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    1807                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1808                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1809              
    1810              $C$DW$192       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$31)
    1812                      .dwattr $C$DW$192, DW_AT_name("EPWM4_TZINT")
    1813                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    1814                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1815                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1816              
    1817              $C$DW$193       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
    1819                      .dwattr $C$DW$193, DW_AT_name("EPWM5_TZINT")
    1820                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    1821                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1822                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$194       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
    1826                      .dwattr $C$DW$194, DW_AT_name("EPWM6_TZINT")
    1827                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    1828                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1829                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1830              
    1831              $C$DW$195       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
    1833                      .dwattr $C$DW$195, DW_AT_name("EPWM7_TZINT")
    1834                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_EPWM7_TZINT")
    1835                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1836                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$196       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$31)
    1840                      .dwattr $C$DW$196, DW_AT_name("rsvd2_8")
    1841                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd2_8")
    1842                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1843                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$197       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$31)
    1847                      .dwattr $C$DW$197, DW_AT_name("EPWM1_INT")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   37

    1848                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EPWM1_INT")
    1849                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1850                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852              $C$DW$198       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$31)
    1854                      .dwattr $C$DW$198, DW_AT_name("EPWM2_INT")
    1855                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EPWM2_INT")
    1856                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1857                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$199       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$31)
    1861                      .dwattr $C$DW$199, DW_AT_name("EPWM3_INT")
    1862                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EPWM3_INT")
    1863                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1864                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$200       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
    1868                      .dwattr $C$DW$200, DW_AT_name("EPWM4_INT")
    1869                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EPWM4_INT")
    1870                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    1871                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$201       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$31)
    1875                      .dwattr $C$DW$201, DW_AT_name("EPWM5_INT")
    1876                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EPWM5_INT")
    1877                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1878                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$202       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
    1882                      .dwattr $C$DW$202, DW_AT_name("EPWM6_INT")
    1883                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_EPWM6_INT")
    1884                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    1885                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$203       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    1889                      .dwattr $C$DW$203, DW_AT_name("EPWM7_INT")
    1890                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_EPWM7_INT")
    1891                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1892                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$204       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    1896                      .dwattr $C$DW$204, DW_AT_name("rsvd3_8")
    1897                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd3_8")
    1898                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    1899                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$205       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   38

    1903                      .dwattr $C$DW$205, DW_AT_name("ECAP1_INT")
    1904                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ECAP1_INT")
    1905                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1906                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908              $C$DW$206       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    1910                      .dwattr $C$DW$206, DW_AT_name("rsvd4_2")
    1911                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd4_2")
    1912                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1913                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915              $C$DW$207       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
    1917                      .dwattr $C$DW$207, DW_AT_name("rsvd4_3")
    1918                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd4_3")
    1919                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1920                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$208       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$31)
    1924                      .dwattr $C$DW$208, DW_AT_name("rsvd4_4")
    1925                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd4_4")
    1926                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1927                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1928              
    1929              $C$DW$209       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    1931                      .dwattr $C$DW$209, DW_AT_name("rsvd4_5")
    1932                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd4_5")
    1933                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1934                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936              $C$DW$210       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$31)
    1938                      .dwattr $C$DW$210, DW_AT_name("rsvd4_6")
    1939                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd4_6")
    1940                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1941                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1942              
    1943              $C$DW$211       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1945                      .dwattr $C$DW$211, DW_AT_name("rsvd4_7")
    1946                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd4_7")
    1947                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1948                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1949              
    1950              $C$DW$212       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    1952                      .dwattr $C$DW$212, DW_AT_name("rsvd4_8")
    1953                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd4_8")
    1954                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1955                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1956              
    1957              $C$DW$213       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   39

    1958                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
    1959                      .dwattr $C$DW$213, DW_AT_name("EQEP1_INT")
    1960                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_EQEP1_INT")
    1961                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1962                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1963              
    1964              $C$DW$214       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$31)
    1966                      .dwattr $C$DW$214, DW_AT_name("rsvd5_2")
    1967                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd5_2")
    1968                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1969                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$215       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
    1973                      .dwattr $C$DW$215, DW_AT_name("rsvd5_3")
    1974                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd5_3")
    1975                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1976                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1977              
    1978              $C$DW$216       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
    1980                      .dwattr $C$DW$216, DW_AT_name("rsvd5_4")
    1981                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd5_4")
    1982                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    1983                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$217       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$31)
    1987                      .dwattr $C$DW$217, DW_AT_name("rsvd5_5")
    1988                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd5_5")
    1989                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1990                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$218       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    1994                      .dwattr $C$DW$218, DW_AT_name("rsvd5_6")
    1995                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd5_6")
    1996                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1997                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999              $C$DW$219       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$31)
    2001                      .dwattr $C$DW$219, DW_AT_name("rsvd5_7")
    2002                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd5_7")
    2003                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2004                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2005              
    2006              $C$DW$220       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$31)
    2008                      .dwattr $C$DW$220, DW_AT_name("rsvd5_8")
    2009                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd5_8")
    2010                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2011                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2012              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   40

    2013              $C$DW$221       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
    2015                      .dwattr $C$DW$221, DW_AT_name("SPIRXINTA")
    2016                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_SPIRXINTA")
    2017                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2018                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2019              
    2020              $C$DW$222       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    2022                      .dwattr $C$DW$222, DW_AT_name("SPITXINTA")
    2023                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SPITXINTA")
    2024                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2025                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2026              
    2027              $C$DW$223       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
    2029                      .dwattr $C$DW$223, DW_AT_name("SPIRXINTB")
    2030                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_SPIRXINTB")
    2031                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2032                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034              $C$DW$224       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    2036                      .dwattr $C$DW$224, DW_AT_name("SPITXINTB")
    2037                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_SPITXINTB")
    2038                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2039                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2040              
    2041              $C$DW$225       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
    2043                      .dwattr $C$DW$225, DW_AT_name("rsvd6_5")
    2044                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd6_5")
    2045                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2046                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048              $C$DW$226       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$31)
    2050                      .dwattr $C$DW$226, DW_AT_name("rsvd6_6")
    2051                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd6_6")
    2052                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2053                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055              $C$DW$227       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
    2057                      .dwattr $C$DW$227, DW_AT_name("rsvd6_7")
    2058                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd6_7")
    2059                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2060                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$228       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
    2064                      .dwattr $C$DW$228, DW_AT_name("rsvd6_8")
    2065                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_rsvd6_8")
    2066                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2067                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   41

    2068              
    2069              $C$DW$229       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
    2071                      .dwattr $C$DW$229, DW_AT_name("rsvd7_1")
    2072                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_rsvd7_1")
    2073                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2074                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2075              
    2076              $C$DW$230       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
    2078                      .dwattr $C$DW$230, DW_AT_name("rsvd7_2")
    2079                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd7_2")
    2080                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2081                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$231       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$31)
    2085                      .dwattr $C$DW$231, DW_AT_name("rsvd7_3")
    2086                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd7_3")
    2087                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2088                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090              $C$DW$232       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
    2092                      .dwattr $C$DW$232, DW_AT_name("rsvd7_4")
    2093                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd7_4")
    2094                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2095                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2096              
    2097              $C$DW$233       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    2099                      .dwattr $C$DW$233, DW_AT_name("rsvd7_5")
    2100                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_rsvd7_5")
    2101                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2102                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2103              
    2104              $C$DW$234       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$31)
    2106                      .dwattr $C$DW$234, DW_AT_name("rsvd7_6")
    2107                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd7_6")
    2108                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2109                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$235       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$31)
    2113                      .dwattr $C$DW$235, DW_AT_name("rsvd7_7")
    2114                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd7_7")
    2115                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2116                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2117              
    2118              $C$DW$236       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
    2120                      .dwattr $C$DW$236, DW_AT_name("rsvd7_8")
    2121                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd7_8")
    2122                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   42

    2123                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$237       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$31)
    2127                      .dwattr $C$DW$237, DW_AT_name("I2CINT1A")
    2128                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_I2CINT1A")
    2129                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2130                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2131              
    2132              $C$DW$238       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$31)
    2134                      .dwattr $C$DW$238, DW_AT_name("I2CINT2A")
    2135                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_I2CINT2A")
    2136                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2137                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2138              
    2139              $C$DW$239       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    2141                      .dwattr $C$DW$239, DW_AT_name("rsvd8_3")
    2142                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd8_3")
    2143                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2144                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$240       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    2148                      .dwattr $C$DW$240, DW_AT_name("rsvd8_4")
    2149                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd8_4")
    2150                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2151                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2152              
    2153              $C$DW$241       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    2155                      .dwattr $C$DW$241, DW_AT_name("rsvd8_5")
    2156                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_rsvd8_5")
    2157                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2158                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2159              
    2160              $C$DW$242       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    2162                      .dwattr $C$DW$242, DW_AT_name("rsvd8_6")
    2163                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_rsvd8_6")
    2164                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2165                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2166              
    2167              $C$DW$243       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    2169                      .dwattr $C$DW$243, DW_AT_name("rsvd8_7")
    2170                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd8_7")
    2171                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2172                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2173              
    2174              $C$DW$244       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
    2176                      .dwattr $C$DW$244, DW_AT_name("rsvd8_8")
    2177                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd8_8")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{9681A316-285D-4ACE-B352-43CA3379783F} PAGE   43

