TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:35 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_Adc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DSP28x_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DSP28x_usDelay")

     750                      .dwpsn  file "../source/DSP2803x_Adc.c",line 99,column 5,is_stmt,isa 0
     751 00000189 9A0D          MOVB      AL,#13                ; [CPU_] |99| 
     752 0000018a FF69          SPM       #0                    ; [CPU_] 
     753                      .dwpsn  file "../source/DSP2803x_Adc.c",line 97,column 5,is_stmt,isa 0
     754 0000018b 18C5          AND       *+XAR5[0],#0xfff7     ; [CPU_] |97| 
         0000018c FFF7 
     755                      .dwpsn  file "../source/DSP2803x_Adc.c",line 98,column 5,is_stmt,isa 0
     756 0000018d 1AC5          OR        *+XAR5[0],#0x0002     ; [CPU_] |98| 
         0000018e 0002 
     757                      .dwpsn  file "../source/DSP2803x_Adc.c",line 99,column 5,is_stmt,isa 0
     758              $C$DW$22        .dwtag  DW_TAG_TI_branch
     759                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     760                      .dwattr $C$DW$22, DW_AT_name("_AdcChanSelect")
     761                      .dwattr $C$DW$22, DW_AT_TI_call
     762              
     763 0000018f 7640'         LCR       #_AdcChanSelect       ; [CPU_] |99| 
         00000190 0045 
     764                      ; call occurs [#_AdcChanSelect] ; [] |99| 
     765                      .dwpsn  file "../source/DSP2803x_Adc.c",line 100,column 5,is_stmt,isa 0
     766 00000191 D041          MOVB      XAR0,#65              ; [CPU_] |100| 
     767 00000192 761F!         MOVW      DP,#_AdcRegs+65       ; [CPU_U] 
         00000193 0001 
     768 00000194 CC95          AND       AL,*+XAR5[AR0],#0xfe00 ; [CPU_] |100| 
         00000195 FE00 
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   17

     769 00000196 5050          ORB       AL,#0x50              ; [CPU_] |100| 
     770 00000197 9601!         MOV       @_AdcRegs+65,AL       ; [CPU_] |100| 
     771                      .dwpsn  file "../source/DSP2803x_Adc.c",line 101,column 5,is_stmt,isa 0
     772              $C$DW$23        .dwtag  DW_TAG_TI_branch
     773                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     774                      .dwattr $C$DW$23, DW_AT_name("_AdcConversion")
     775                      .dwattr $C$DW$23, DW_AT_TI_call
     776              
     777 00000198 7640'         LCR       #_AdcConversion       ; [CPU_] |101| 
         00000199 009D 
     778                      ; call occurs [#_AdcConversion] ; [] |101| 
     779                      .dwpsn  file "../source/DSP2803x_Adc.c",line 102,column 5,is_stmt,isa 0
     780 0000019a 9B50          MOVB      AH,#80                ; [CPU_] |102| 
     781 0000019b 761F!         MOVW      DP,#_AdcRegs+65       ; [CPU_U] 
         0000019c 0001 
     782 0000019d 9FA9          SUB       AH,AL                 ; [CPU_] |102| 
     783 0000019e 18A8          AND       AH,#0x01ff            ; [CPU_] |102| 
         0000019f 01FF 
     784 000001a0 CC01!         AND       AL,@_AdcRegs+65,#0xfe00 ; [CPU_] |102| 
         000001a1 FE00 
     785 000001a2 CBA9          OR        AH,AL                 ; [CPU_] |102| 
     786 000001a3 9701!         MOV       @_AdcRegs+65,AH       ; [CPU_] |102| 
     787 000001a4 761F!         MOVW      DP,#_AdcRegs          ; [CPU_U] 
         000001a5 0000 
     788                      .dwpsn  file "../source/DSP2803x_Adc.c",line 103,column 5,is_stmt,isa 0
     789 000001a6 1800!         AND       @_AdcRegs,#0xfffd     ; [CPU_] |103| 
         000001a7 FFFD 
     790 000001a8 761A   EDIS
     791 000001a9 FF69          SPM       #0                    ; [CPU_] 
     792              $C$DW$24        .dwtag  DW_TAG_TI_branch
     793                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     794                      .dwattr $C$DW$24, DW_AT_TI_return
     795              
     796 000001aa 0006          LRETR     ; [CPU_] 
     797                      ; return occurs ; [] 
     798                      .dwattr $C$DW$20, DW_AT_TI_end_file("../source/DSP2803x_Adc.c")
     799                      .dwattr $C$DW$20, DW_AT_TI_end_line(0x69)
     800                      .dwattr $C$DW$20, DW_AT_TI_end_column(0x01)
     801                      .dwendentry
     802                      .dwendtag $C$DW$20
     803              
     804              ;**************************************************************
     805              ;* UNDEFINED EXTERNAL REFERENCES                              *
     806              ;**************************************************************
     807                      .global _DSP28x_usDelay
     808                      .global _AdcResult
     809                      .global _SysCtrlRegs
     810                      .global _GpioCtrlRegs
     811                      .global _AdcRegs
     812              
     813              ;***************************************************************
     814              ;* TYPE INFORMATION                                            *
     815              ;***************************************************************
     816              
     817              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   18

     818                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
     819                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     820              $C$DW$25        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$25, DW_AT_name("TEMPCONV")
     823                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_TEMPCONV")
     824                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f)
     825                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     826                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829              $C$DW$26        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$26, DW_AT_name("VREFLOCONV")
     832                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_VREFLOCONV")
     833                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     834                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$27        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$27, DW_AT_name("INTPULSEPOS")
     841                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTPULSEPOS")
     842                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     843                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     846              
     847              $C$DW$28        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$28, DW_AT_name("ADCREFSEL")
     850                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_ADCREFSEL")
     851                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c)
     852                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$29        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$29, DW_AT_name("rsvd1")
     859                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd1")
     860                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b)
     861                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     862                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$30        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$30, DW_AT_name("ADCREFPWD")
     868                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_ADCREFPWD")
     869                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a)
     870                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   19

     873              
     874              $C$DW$31        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$31, DW_AT_name("ADCBGPWD")
     877                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_ADCBGPWD")
     878                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09)
     879                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$32        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$32, DW_AT_name("ADCPWDN")
     886                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_ADCPWDN")
     887                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08)
     888                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     889                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$33        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$33, DW_AT_name("ADCBSYCHN")
     895                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_ADCBSYCHN")
     896                      .dwattr $C$DW$33, DW_AT_bit_offset(0x03)
     897                      .dwattr $C$DW$33, DW_AT_bit_size(0x05)
     898                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     900              
     901              $C$DW$34        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$34, DW_AT_name("ADCBSY")
     904                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_ADCBSY")
     905                      .dwattr $C$DW$34, DW_AT_bit_offset(0x02)
     906                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     907                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910              $C$DW$35        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$35, DW_AT_name("ADCENABLE")
     913                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_ADCENABLE")
     914                      .dwattr $C$DW$35, DW_AT_bit_offset(0x01)
     915                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     916                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     918              
     919              $C$DW$36        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$36, DW_AT_name("RESET")
     922                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_RESET")
     923                      .dwattr $C$DW$36, DW_AT_bit_offset(0x00)
     924                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     925                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     927              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   20

     928                      .dwendtag $C$DW$T$20
     929              
     930              
     931              $C$DW$T$21      .dwtag  DW_TAG_union_type
     932                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
     933                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     934              $C$DW$37        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$37, DW_AT_name("all")
     937                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_all")
     938                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941              $C$DW$38        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     943                      .dwattr $C$DW$38, DW_AT_name("bit")
     944                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_bit")
     945                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948                      .dwendtag $C$DW$T$21
     949              
     950              
     951              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     952                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
     953                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     954              $C$DW$39        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$39, DW_AT_name("CLKDIV2EN")
     957                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_CLKDIV2EN")
     958                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0f)
     959                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$40        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$40, DW_AT_name("ADCNONOVERLAP")
     966                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
     967                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0e)
     968                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     969                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$41        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$41, DW_AT_name("rsvd1")
     975                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd1")
     976                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     977                      .dwattr $C$DW$41, DW_AT_bit_size(0x0e)
     978                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981                      .dwendtag $C$DW$T$22
     982              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   21

     983              
     984              $C$DW$T$23      .dwtag  DW_TAG_union_type
     985                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
     986                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     987              $C$DW$42        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$42, DW_AT_name("all")
     990                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     991                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994              $C$DW$43        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
     996                      .dwattr $C$DW$43, DW_AT_name("bit")
     997                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     998                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001                      .dwendtag $C$DW$T$23
    1002              
    1003              
    1004              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1005                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
    1006                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1007              $C$DW$44        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$44, DW_AT_name("SOC0")
    1010                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_SOC0")
    1011                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e)
    1012                      .dwattr $C$DW$44, DW_AT_bit_size(0x02)
    1013                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$45        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$45, DW_AT_name("SOC1")
    1019                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_SOC1")
    1020                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0c)
    1021                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1024              
    1025              $C$DW$46        .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$46, DW_AT_name("SOC2")
    1028                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_SOC2")
    1029                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0a)
    1030                      .dwattr $C$DW$46, DW_AT_bit_size(0x02)
    1031                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1033              
    1034              $C$DW$47        .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1036                      .dwattr $C$DW$47, DW_AT_name("SOC3")
    1037                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_SOC3")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   22

    1038                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
    1039                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
    1040                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1041                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1042              
    1043              $C$DW$48        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$48, DW_AT_name("SOC4")
    1046                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_SOC4")
    1047                      .dwattr $C$DW$48, DW_AT_bit_offset(0x06)
    1048                      .dwattr $C$DW$48, DW_AT_bit_size(0x02)
    1049                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1051              
    1052              $C$DW$49        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$49, DW_AT_name("SOC5")
    1055                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_SOC5")
    1056                      .dwattr $C$DW$49, DW_AT_bit_offset(0x04)
    1057                      .dwattr $C$DW$49, DW_AT_bit_size(0x02)
    1058                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$50        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$50, DW_AT_name("SOC6")
    1064                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_SOC6")
    1065                      .dwattr $C$DW$50, DW_AT_bit_offset(0x02)
    1066                      .dwattr $C$DW$50, DW_AT_bit_size(0x02)
    1067                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1069              
    1070              $C$DW$51        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$51, DW_AT_name("SOC7")
    1073                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_SOC7")
    1074                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
    1075                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
    1076                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1078              
    1079                      .dwendtag $C$DW$T$24
    1080              
    1081              
    1082              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1083                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
    1084                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1085              $C$DW$52        .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$52, DW_AT_name("all")
    1088                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
    1089                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$53        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   23

    1093                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
    1094                      .dwattr $C$DW$53, DW_AT_name("bit")
    1095                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
    1096                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099                      .dwendtag $C$DW$T$25
    1100              
    1101              
    1102              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1103                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
    1104                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1105              $C$DW$54        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$54, DW_AT_name("SOC8")
    1108                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_SOC8")
    1109                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0e)
    1110                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
    1111                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114              $C$DW$55        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$55, DW_AT_name("SOC9")
    1117                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SOC9")
    1118                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0c)
    1119                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
    1120                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$56        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$56, DW_AT_name("SOC10")
    1126                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SOC10")
    1127                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0a)
    1128                      .dwattr $C$DW$56, DW_AT_bit_size(0x02)
    1129                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1131              
    1132              $C$DW$57        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1134                      .dwattr $C$DW$57, DW_AT_name("SOC11")
    1135                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_SOC11")
    1136                      .dwattr $C$DW$57, DW_AT_bit_offset(0x08)
    1137                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
    1138                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141              $C$DW$58        .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$58, DW_AT_name("SOC12")
    1144                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_SOC12")
    1145                      .dwattr $C$DW$58, DW_AT_bit_offset(0x06)
    1146                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
    1147                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   24

    1148                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1149              
    1150              $C$DW$59        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$59, DW_AT_name("SOC13")
    1153                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_SOC13")
    1154                      .dwattr $C$DW$59, DW_AT_bit_offset(0x04)
    1155                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
    1156                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$60        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$60, DW_AT_name("SOC14")
    1162                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SOC14")
    1163                      .dwattr $C$DW$60, DW_AT_bit_offset(0x02)
    1164                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
    1165                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1167              
    1168              $C$DW$61        .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$61, DW_AT_name("SOC15")
    1171                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_SOC15")
    1172                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
    1173                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
    1174                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1176              
    1177                      .dwendtag $C$DW$T$26
    1178              
    1179              
    1180              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1181                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
    1182                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1183              $C$DW$62        .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$62, DW_AT_name("all")
    1186                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
    1187                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$63        .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$26)
    1192                      .dwattr $C$DW$63, DW_AT_name("bit")
    1193                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
    1194                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1196              
    1197                      .dwendtag $C$DW$T$27
    1198              
    1199              
    1200              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1201                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
    1202                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   25

    1203              $C$DW$64        .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$64, DW_AT_name("ADCINT1")
    1206                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_ADCINT1")
    1207                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0f)
    1208                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1209                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1211              
    1212              $C$DW$65        .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$65, DW_AT_name("ADCINT2")
    1215                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_ADCINT2")
    1216                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0e)
    1217                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1218                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$66        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$66, DW_AT_name("ADCINT3")
    1224                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_ADCINT3")
    1225                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0d)
    1226                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1229              
    1230              $C$DW$67        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$67, DW_AT_name("ADCINT4")
    1233                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_ADCINT4")
    1234                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0c)
    1235                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1236                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$68        .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$68, DW_AT_name("ADCINT5")
    1242                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_ADCINT5")
    1243                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0b)
    1244                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$69        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$69, DW_AT_name("ADCINT6")
    1251                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_ADCINT6")
    1252                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0a)
    1253                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$70        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   26

    1258                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$70, DW_AT_name("ADCINT7")
    1260                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ADCINT7")
    1261                      .dwattr $C$DW$70, DW_AT_bit_offset(0x09)
    1262                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$71        .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$71, DW_AT_name("ADCINT8")
    1269                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ADCINT8")
    1270                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
    1271                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$72        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$72, DW_AT_name("ADCINT9")
    1278                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_ADCINT9")
    1279                      .dwattr $C$DW$72, DW_AT_bit_offset(0x07)
    1280                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1281                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$73        .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
    1287                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
    1288                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00)
    1289                      .dwattr $C$DW$73, DW_AT_bit_size(0x07)
    1290                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293                      .dwendtag $C$DW$T$28
    1294              
    1295              
    1296              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1297                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
    1298                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1299              $C$DW$74        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$74, DW_AT_name("all")
    1302                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
    1303                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$75        .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$28)
    1308                      .dwattr $C$DW$75, DW_AT_name("bit")
    1309                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
    1310                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1312              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   27

    1313                      .dwendtag $C$DW$T$29
    1314              
    1315              
    1316              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1317                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
    1318                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1319              $C$DW$76        .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$30)
    1321                      .dwattr $C$DW$76, DW_AT_name("OFFTRIM")
    1322                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_OFFTRIM")
    1323                      .dwattr $C$DW$76, DW_AT_bit_offset(0x07)
    1324                      .dwattr $C$DW$76, DW_AT_bit_size(0x09)
    1325                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328              $C$DW$77        .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$77, DW_AT_name("rsvd1")
    1331                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd1")
    1332                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1333                      .dwattr $C$DW$77, DW_AT_bit_size(0x07)
    1334                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1336              
    1337                      .dwendtag $C$DW$T$31
    1338              
    1339              
    1340              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1341                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
    1342                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1343              $C$DW$78        .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$78, DW_AT_name("all")
    1346                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_all")
    1347                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$79        .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$31)
    1352                      .dwattr $C$DW$79, DW_AT_name("bit")
    1353                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_bit")
    1354                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357                      .dwendtag $C$DW$T$32
    1358              
    1359              
    1360              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1361                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
    1362                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1363              $C$DW$80        .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$80, DW_AT_name("BG_FINE_TRIM")
    1366                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
    1367                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   28

    1368                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
    1369                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1371              
    1372              $C$DW$81        .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1374                      .dwattr $C$DW$81, DW_AT_name("BG_COARSE_TRIM")
    1375                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
    1376                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07)
    1377                      .dwattr $C$DW$81, DW_AT_bit_size(0x05)
    1378                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381              $C$DW$82        .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1383                      .dwattr $C$DW$82, DW_AT_name("EXTREF_FINE_TRIM")
    1384                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
    1385                      .dwattr $C$DW$82, DW_AT_bit_offset(0x02)
    1386                      .dwattr $C$DW$82, DW_AT_bit_size(0x05)
    1387                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1389              
    1390              $C$DW$83        .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
    1393                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
    1394                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1395                      .dwattr $C$DW$83, DW_AT_bit_size(0x02)
    1396                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399                      .dwendtag $C$DW$T$33
    1400              
    1401              
    1402              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1403                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
    1404                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1405              $C$DW$84        .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1407                      .dwattr $C$DW$84, DW_AT_name("all")
    1408                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1409                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$85        .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$33)
    1414                      .dwattr $C$DW$85, DW_AT_name("bit")
    1415                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1416                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419                      .dwendtag $C$DW$T$34
    1420              
    1421              
    1422              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   29

    1423                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
    1424                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1425              $C$DW$86        .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$86, DW_AT_name("SIMULEN0")
    1428                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SIMULEN0")
    1429                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0f)
    1430                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1431                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$87        .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$87, DW_AT_name("SIMULEN2")
    1437                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_SIMULEN2")
    1438                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e)
    1439                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1440                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443              $C$DW$88        .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$88, DW_AT_name("SIMULEN4")
    1446                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_SIMULEN4")
    1447                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0d)
    1448                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1451              
    1452              $C$DW$89        .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$89, DW_AT_name("SIMULEN6")
    1455                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_SIMULEN6")
    1456                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
    1457                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1458                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$90        .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$90, DW_AT_name("SIMULEN8")
    1464                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SIMULEN8")
    1465                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0b)
    1466                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1467                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1469              
    1470              $C$DW$91        .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$91, DW_AT_name("SIMULEN10")
    1473                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SIMULEN10")
    1474                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0a)
    1475                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1476                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   30

    1478              
    1479              $C$DW$92        .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$92, DW_AT_name("SIMULEN12")
    1482                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SIMULEN12")
    1483                      .dwattr $C$DW$92, DW_AT_bit_offset(0x09)
    1484                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1485                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1487              
    1488              $C$DW$93        .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$93, DW_AT_name("SIMULEN14")
    1491                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SIMULEN14")
    1492                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
    1493                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$94        .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    1500                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    1501                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1502                      .dwattr $C$DW$94, DW_AT_bit_size(0x08)
    1503                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506                      .dwendtag $C$DW$T$35
    1507              
    1508              
    1509              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1510                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
    1511                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1512              $C$DW$95        .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$95, DW_AT_name("all")
    1515                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1516                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1518              
    1519              $C$DW$96        .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$35)
    1521                      .dwattr $C$DW$96, DW_AT_name("bit")
    1522                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1523                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1525              
    1526                      .dwendtag $C$DW$T$36
    1527              
    1528              
    1529              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1530                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
    1531                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1532              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   31

    1533                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$97, DW_AT_name("SOC0")
    1535                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SOC0")
    1536                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f)
    1537                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1538                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1540              
    1541              $C$DW$98        .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$98, DW_AT_name("SOC1")
    1544                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SOC1")
    1545                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e)
    1546                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1547                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1549              
    1550              $C$DW$99        .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$99, DW_AT_name("SOC2")
    1553                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SOC2")
    1554                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d)
    1555                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1556                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$100       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$100, DW_AT_name("SOC3")
    1562                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_SOC3")
    1563                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0c)
    1564                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1565                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1566                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1567              
    1568              $C$DW$101       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1570                      .dwattr $C$DW$101, DW_AT_name("SOC4")
    1571                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_SOC4")
    1572                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b)
    1573                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1574                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577              $C$DW$102       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1579                      .dwattr $C$DW$102, DW_AT_name("SOC5")
    1580                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_SOC5")
    1581                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a)
    1582                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1583                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1585              
    1586              $C$DW$103       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   32

    1588                      .dwattr $C$DW$103, DW_AT_name("SOC6")
    1589                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_SOC6")
    1590                      .dwattr $C$DW$103, DW_AT_bit_offset(0x09)
    1591                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$104       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1597                      .dwattr $C$DW$104, DW_AT_name("SOC7")
    1598                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_SOC7")
    1599                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    1600                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1601                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$105       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$105, DW_AT_name("SOC8")
    1607                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_SOC8")
    1608                      .dwattr $C$DW$105, DW_AT_bit_offset(0x07)
    1609                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1610                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1612              
    1613              $C$DW$106       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1615                      .dwattr $C$DW$106, DW_AT_name("SOC9")
    1616                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_SOC9")
    1617                      .dwattr $C$DW$106, DW_AT_bit_offset(0x06)
    1618                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1619                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$107       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$107, DW_AT_name("SOC10")
    1625                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_SOC10")
    1626                      .dwattr $C$DW$107, DW_AT_bit_offset(0x05)
    1627                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1628                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1630              
    1631              $C$DW$108       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1633                      .dwattr $C$DW$108, DW_AT_name("SOC11")
    1634                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SOC11")
    1635                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04)
    1636                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1637                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$109       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1642                      .dwattr $C$DW$109, DW_AT_name("SOC12")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   33

    1643                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_SOC12")
    1644                      .dwattr $C$DW$109, DW_AT_bit_offset(0x03)
    1645                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1646                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1647                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1648              
    1649              $C$DW$110       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$110, DW_AT_name("SOC13")
    1652                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SOC13")
    1653                      .dwattr $C$DW$110, DW_AT_bit_offset(0x02)
    1654                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1655                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$111       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$111, DW_AT_name("SOC14")
    1661                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_SOC14")
    1662                      .dwattr $C$DW$111, DW_AT_bit_offset(0x01)
    1663                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1664                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$112       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$112, DW_AT_name("SOC15")
    1670                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SOC15")
    1671                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1672                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1673                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676                      .dwendtag $C$DW$T$37
    1677              
    1678              
    1679              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1680                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
    1681                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1682              $C$DW$113       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1684                      .dwattr $C$DW$113, DW_AT_name("all")
    1685                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1686                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$114       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$37)
    1691                      .dwattr $C$DW$114, DW_AT_name("bit")
    1692                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1693                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696                      .dwendtag $C$DW$T$38
    1697              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   34

    1698              
    1699              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1700                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
    1701                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1702              $C$DW$115       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$115, DW_AT_name("ACQPS")
    1705                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ACQPS")
    1706                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
    1707                      .dwattr $C$DW$115, DW_AT_bit_size(0x06)
    1708                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$116       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1713                      .dwattr $C$DW$116, DW_AT_name("CHSEL")
    1714                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CHSEL")
    1715                      .dwattr $C$DW$116, DW_AT_bit_offset(0x06)
    1716                      .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    1717                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1718                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1719              
    1720              $C$DW$117       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1722                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    1723                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    1724                      .dwattr $C$DW$117, DW_AT_bit_offset(0x05)
    1725                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1726                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1728              
    1729              $C$DW$118       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1731                      .dwattr $C$DW$118, DW_AT_name("TRIGSEL")
    1732                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_TRIGSEL")
    1733                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1734                      .dwattr $C$DW$118, DW_AT_bit_size(0x05)
    1735                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1737              
    1738                      .dwendtag $C$DW$T$39
    1739              
    1740              
    1741              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1742                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    1743                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1744              $C$DW$119       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$119, DW_AT_name("all")
    1747                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1748                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$120       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   35

    1753                      .dwattr $C$DW$120, DW_AT_name("bit")
    1754                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1755                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758                      .dwendtag $C$DW$T$40
    1759              
    1760              
    1761              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1762                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1763                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x50)
    1764              $C$DW$121       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1766                      .dwattr $C$DW$121, DW_AT_name("ADCCTL1")
    1767                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ADCCTL1")
    1768                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1770              
    1771              $C$DW$122       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    1773                      .dwattr $C$DW$122, DW_AT_name("ADCCTL2")
    1774                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ADCCTL2")
    1775                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1776                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778              $C$DW$123       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$41)
    1780                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    1781                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    1782                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1783                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1784              
    1785              $C$DW$124       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    1787                      .dwattr $C$DW$124, DW_AT_name("ADCINTFLG")
    1788                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINTFLG")
    1789                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1790                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1791              
    1792              $C$DW$125       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
    1794                      .dwattr $C$DW$125, DW_AT_name("ADCINTFLGCLR")
    1795                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1796                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1797                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1798              
    1799              $C$DW$126       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1801                      .dwattr $C$DW$126, DW_AT_name("ADCINTOVF")
    1802                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINTOVF")
    1803                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1804                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$127       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   36

    1808                      .dwattr $C$DW$127, DW_AT_name("ADCINTOVFCLR")
    1809                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1810                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1811                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1812              
    1813              $C$DW$128       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$76)
    1815                      .dwattr $C$DW$128, DW_AT_name("INTSEL1N2")
    1816                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTSEL1N2")
    1817                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1818                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1819              
    1820              $C$DW$129       .dwtag  DW_TAG_member
    1821                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$78)
    1822                      .dwattr $C$DW$129, DW_AT_name("INTSEL3N4")
    1823                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTSEL3N4")
    1824                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1825                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1826              
    1827              $C$DW$130       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$80)
    1829                      .dwattr $C$DW$130, DW_AT_name("INTSEL5N6")
    1830                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTSEL5N6")
    1831                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1832                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1833              
    1834              $C$DW$131       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$82)
    1836                      .dwattr $C$DW$131, DW_AT_name("INTSEL7N8")
    1837                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_INTSEL7N8")
    1838                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1839                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$132       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$84)
    1843                      .dwattr $C$DW$132, DW_AT_name("INTSEL9N10")
    1844                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_INTSEL9N10")
    1845                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1846                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1847              
    1848              $C$DW$133       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$42)
    1850                      .dwattr $C$DW$133, DW_AT_name("rsvd2")
    1851                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd2")
    1852                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1853                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1854              
    1855              $C$DW$134       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$100)
    1857                      .dwattr $C$DW$134, DW_AT_name("SOCPRICTL")
    1858                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_SOCPRICTL")
    1859                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1860                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1861              
    1862              $C$DW$135       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   37

    1863                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1864                      .dwattr $C$DW$135, DW_AT_name("rsvd3")
    1865                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd3")
    1866                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1867                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869              $C$DW$136       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$36)
    1871                      .dwattr $C$DW$136, DW_AT_name("ADCSAMPLEMODE")
    1872                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1873                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1874                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1875              
    1876              $C$DW$137       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1878                      .dwattr $C$DW$137, DW_AT_name("rsvd4")
    1879                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd4")
    1880                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1881                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1882              
    1883              $C$DW$138       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$25)
    1885                      .dwattr $C$DW$138, DW_AT_name("ADCINTSOCSEL1")
    1886                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1887                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1888                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1889              
    1890              $C$DW$139       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    1892                      .dwattr $C$DW$139, DW_AT_name("ADCINTSOCSEL2")
    1893                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1894                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1895                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1896              
    1897              $C$DW$140       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$41)
    1899                      .dwattr $C$DW$140, DW_AT_name("rsvd5")
    1900                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd5")
    1901                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1902                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$141       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$38)
    1906                      .dwattr $C$DW$141, DW_AT_name("ADCSOCFLG1")
    1907                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1908                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1909                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1910              
    1911              $C$DW$142       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1913                      .dwattr $C$DW$142, DW_AT_name("rsvd6")
    1914                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd6")
    1915                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1916                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1917              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   38

    1918              $C$DW$143       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$38)
    1920                      .dwattr $C$DW$143, DW_AT_name("ADCSOCFRC1")
    1921                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1922                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1923                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1924              
    1925              $C$DW$144       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1927                      .dwattr $C$DW$144, DW_AT_name("rsvd7")
    1928                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd7")
    1929                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1930                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932              $C$DW$145       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$38)
    1934                      .dwattr $C$DW$145, DW_AT_name("ADCSOCOVF1")
    1935                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1936                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1937                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1938              
    1939              $C$DW$146       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$146, DW_AT_name("rsvd8")
    1942                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd8")
    1943                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1944                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$147       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$38)
    1948                      .dwattr $C$DW$147, DW_AT_name("ADCSOCOVFCLR1")
    1949                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1950                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1951                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1952              
    1953              $C$DW$148       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$148, DW_AT_name("rsvd9")
    1956                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd9")
    1957                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1958                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1959              
    1960              $C$DW$149       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$40)
    1962                      .dwattr $C$DW$149, DW_AT_name("ADCSOC0CTL")
    1963                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    1964                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1965                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$150       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$40)
    1969                      .dwattr $C$DW$150, DW_AT_name("ADCSOC1CTL")
    1970                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    1971                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1972                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   39

    1973              
    1974              $C$DW$151       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$40)
    1976                      .dwattr $C$DW$151, DW_AT_name("ADCSOC2CTL")
    1977                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    1978                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1979                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1980              
    1981              $C$DW$152       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$40)
    1983                      .dwattr $C$DW$152, DW_AT_name("ADCSOC3CTL")
    1984                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    1985                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1986                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1987              
    1988              $C$DW$153       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$40)
    1990                      .dwattr $C$DW$153, DW_AT_name("ADCSOC4CTL")
    1991                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    1992                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1993                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1994              
    1995              $C$DW$154       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$40)
    1997                      .dwattr $C$DW$154, DW_AT_name("ADCSOC5CTL")
    1998                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    1999                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2000                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2001              
    2002              $C$DW$155       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$40)
    2004                      .dwattr $C$DW$155, DW_AT_name("ADCSOC6CTL")
    2005                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    2006                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2007                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2008              
    2009              $C$DW$156       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$40)
    2011                      .dwattr $C$DW$156, DW_AT_name("ADCSOC7CTL")
    2012                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    2013                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2014                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2015              
    2016              $C$DW$157       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$40)
    2018                      .dwattr $C$DW$157, DW_AT_name("ADCSOC8CTL")
    2019                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    2020                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2021                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2022              
    2023              $C$DW$158       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$40)
    2025                      .dwattr $C$DW$158, DW_AT_name("ADCSOC9CTL")
    2026                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    2027                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   40

    2028                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$159       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$40)
    2032                      .dwattr $C$DW$159, DW_AT_name("ADCSOC10CTL")
    2033                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCSOC10CTL")
    2034                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2035                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2036              
    2037              $C$DW$160       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    2039                      .dwattr $C$DW$160, DW_AT_name("ADCSOC11CTL")
    2040                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    2041                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2042                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2043              
    2044              $C$DW$161       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$40)
    2046                      .dwattr $C$DW$161, DW_AT_name("ADCSOC12CTL")
    2047                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    2048                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2049                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2050              
    2051              $C$DW$162       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    2053                      .dwattr $C$DW$162, DW_AT_name("ADCSOC13CTL")
    2054                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    2055                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2056                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2057              
    2058              $C$DW$163       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    2060                      .dwattr $C$DW$163, DW_AT_name("ADCSOC14CTL")
    2061                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    2062                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2063                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2064              
    2065              $C$DW$164       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$40)
    2067                      .dwattr $C$DW$164, DW_AT_name("ADCSOC15CTL")
    2068                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ADCSOC15CTL")
    2069                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    2070                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2071              
    2072              $C$DW$165       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$43)
    2074                      .dwattr $C$DW$165, DW_AT_name("rsvd10")
    2075                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd10")
    2076                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2077                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2078              
    2079              $C$DW$166       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$34)
    2081                      .dwattr $C$DW$166, DW_AT_name("ADCREFTRIM")
    2082                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ADCREFTRIM")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{0EAFF7FF-69F7-4FEC-9783-F934B77E23E9} PAGE   41

    2083                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2084                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2085              
    2086              $C$DW$167       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    2088                      .dwattr $C$DW$167, DW_AT_name("ADCOFFTRIM")
    2089                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2090                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2091                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2092              
    2093              $C$DW$168       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$44)
    2095                      .dwattr $C$DW$168, DW_AT_name("rsvd11")
    2096                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd11")
    2097                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2098                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2099              
    2100                      .dwendtag $C$DW$T$45
    2101              
    2102              $C$DW$169       .dwtag  DW_TAG_TI_far_type
    2103                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$45)
    2104              
    2105              $C$DW$T$117     .dwtag  DW_TAG_volatile_type
