TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:37 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_GlobalVariableDefs.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13                      .global _EmuKey
      14 00000000       _EmuKey:        .usect  "EmuKeyVar",1,1,0
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("EmuKey")

     360                      .dwattr $C$DW$39, DW_AT_location[DW_OP_addr _ECanaLAMRegs]
     361                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$473)
     362                      .dwattr $C$DW$39, DW_AT_external
     363              
     364                      .global _ECanaMOTSRegs
     365 00000000       _ECanaMOTSRegs: .usect  "ECanaMOTSRegsFile",64,1,1
     366              $C$DW$40        .dwtag  DW_TAG_variable
     367                      .dwattr $C$DW$40, DW_AT_name("ECanaMOTSRegs")
     368                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ECanaMOTSRegs")
     369                      .dwattr $C$DW$40, DW_AT_location[DW_OP_addr _ECanaMOTSRegs]
     370                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$476)
     371                      .dwattr $C$DW$40, DW_AT_external
     372              
     373                      .global _EQep1Regs
     374 00000000       _EQep1Regs:     .usect  "EQep1RegsFile",64,1,1
     375              $C$DW$41        .dwtag  DW_TAG_variable
     376                      .dwattr $C$DW$41, DW_AT_name("EQep1Regs")
     377                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_EQep1Regs")
     378                      .dwattr $C$DW$41, DW_AT_location[DW_OP_addr _EQep1Regs]
     379                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$467)
     380                      .dwattr $C$DW$41, DW_AT_external
     381              
     382                      .global _GpioCtrlRegs
     383 00000000       _GpioCtrlRegs:  .usect  "GpioCtrlRegsFile",64,1,1
     384              $C$DW$42        .dwtag  DW_TAG_variable
     385                      .dwattr $C$DW$42, DW_AT_name("GpioCtrlRegs")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE    8

     386                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GpioCtrlRegs")
     387                      .dwattr $C$DW$42, DW_AT_location[DW_OP_addr _GpioCtrlRegs]
     388                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$469)
     389                      .dwattr $C$DW$42, DW_AT_external
     390              
     391                      .global _LinaRegs
     392 00000000       _LinaRegs:      .usect  "LinaRegsFile",74,1,1
     393              $C$DW$43        .dwtag  DW_TAG_variable
     394                      .dwattr $C$DW$43, DW_AT_name("LinaRegs")
     395                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_LinaRegs")
     396                      .dwattr $C$DW$43, DW_AT_location[DW_OP_addr _LinaRegs]
     397                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$474)
     398                      .dwattr $C$DW$43, DW_AT_external
     399              
     400                      .global _AdcRegs
     401 00000000       _AdcRegs:       .usect  "AdcRegsFile",80,1,0
     402              $C$DW$44        .dwtag  DW_TAG_variable
     403                      .dwattr $C$DW$44, DW_AT_name("AdcRegs")
     404                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_AdcRegs")
     405                      .dwattr $C$DW$44, DW_AT_location[DW_OP_addr _AdcRegs]
     406                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$455)
     407                      .dwattr $C$DW$44, DW_AT_external
     408              
     409                      .global _PieVectTable
     410 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     411              $C$DW$45        .dwtag  DW_TAG_variable
     412                      .dwattr $C$DW$45, DW_AT_name("PieVectTable")
     413                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_PieVectTable")
     414                      .dwattr $C$DW$45, DW_AT_location[DW_OP_addr _PieVectTable]
     415                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$335)
     416                      .dwattr $C$DW$45, DW_AT_external
     417              
     418                      .global _ECanaMboxes
     419 00000000       _ECanaMboxes:   .usect  "ECanaMboxesFile",256,1,1
     420              $C$DW$46        .dwtag  DW_TAG_variable
     421                      .dwattr $C$DW$46, DW_AT_name("ECanaMboxes")
     422                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_ECanaMboxes")
     423                      .dwattr $C$DW$46, DW_AT_location[DW_OP_addr _ECanaMboxes]
     424                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$463)
     425                      .dwattr $C$DW$46, DW_AT_external
     426              
     427              ;       C:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\opt2000.exe C:\\Users\\Admin\\AppData\\Local\\
     428              ;       C:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\ac2000.exe -@C:\\Users\\Admin\\AppData\\Local\
     429              
     430              ;***************************************************************
     431              ;* TYPE INFORMATION                                            *
     432              ;***************************************************************
     433              
     434              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     435                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
     436                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     437              $C$DW$47        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     439                      .dwattr $C$DW$47, DW_AT_name("TEMPCONV")
     440                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_TEMPCONV")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE    9

     441                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0f)
     442                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     443                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     445              
     446              $C$DW$48        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     448                      .dwattr $C$DW$48, DW_AT_name("VREFLOCONV")
     449                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_VREFLOCONV")
     450                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0e)
     451                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     452                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     453                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     454              
     455              $C$DW$49        .dwtag  DW_TAG_member
     456                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     457                      .dwattr $C$DW$49, DW_AT_name("INTPULSEPOS")
     458                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_INTPULSEPOS")
     459                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0d)
     460                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     461                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     463              
     464              $C$DW$50        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     466                      .dwattr $C$DW$50, DW_AT_name("ADCREFSEL")
     467                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_ADCREFSEL")
     468                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0c)
     469                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     470                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     471                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     472              
     473              $C$DW$51        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     476                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     477                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0b)
     478                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     479                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     480                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     481              
     482              $C$DW$52        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     484                      .dwattr $C$DW$52, DW_AT_name("ADCREFPWD")
     485                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ADCREFPWD")
     486                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0a)
     487                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     488                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     489                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     490              
     491              $C$DW$53        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     493                      .dwattr $C$DW$53, DW_AT_name("ADCBGPWD")
     494                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_ADCBGPWD")
     495                      .dwattr $C$DW$53, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   10

     496                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     497                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     498                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     499              
     500              $C$DW$54        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     502                      .dwattr $C$DW$54, DW_AT_name("ADCPWDN")
     503                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ADCPWDN")
     504                      .dwattr $C$DW$54, DW_AT_bit_offset(0x08)
     505                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     506                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     508              
     509              $C$DW$55        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$55, DW_AT_name("ADCBSYCHN")
     512                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ADCBSYCHN")
     513                      .dwattr $C$DW$55, DW_AT_bit_offset(0x03)
     514                      .dwattr $C$DW$55, DW_AT_bit_size(0x05)
     515                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     516                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     517              
     518              $C$DW$56        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$56, DW_AT_name("ADCBSY")
     521                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ADCBSY")
     522                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02)
     523                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     524                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     526              
     527              $C$DW$57        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     529                      .dwattr $C$DW$57, DW_AT_name("ADCENABLE")
     530                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ADCENABLE")
     531                      .dwattr $C$DW$57, DW_AT_bit_offset(0x01)
     532                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     533                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     534                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     535              
     536              $C$DW$58        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     538                      .dwattr $C$DW$58, DW_AT_name("RESET")
     539                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_RESET")
     540                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
     541                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     542                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     544              
     545                      .dwendtag $C$DW$T$20
     546              
     547              
     548              $C$DW$T$21      .dwtag  DW_TAG_union_type
     549                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
     550                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   11

     551              $C$DW$59        .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     553                      .dwattr $C$DW$59, DW_AT_name("all")
     554                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     555                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558              $C$DW$60        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     560                      .dwattr $C$DW$60, DW_AT_name("bit")
     561                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     562                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565                      .dwendtag $C$DW$T$21
     566              
     567              
     568              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     569                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
     570                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     571              $C$DW$61        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     573                      .dwattr $C$DW$61, DW_AT_name("CLKDIV2EN")
     574                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CLKDIV2EN")
     575                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f)
     576                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     577                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     579              
     580              $C$DW$62        .dwtag  DW_TAG_member
     581                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     582                      .dwattr $C$DW$62, DW_AT_name("ADCNONOVERLAP")
     583                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
     584                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e)
     585                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     586                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     588              
     589              $C$DW$63        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$63, DW_AT_name("rsvd1")
     592                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd1")
     593                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
     594                      .dwattr $C$DW$63, DW_AT_bit_size(0x0e)
     595                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     597              
     598                      .dwendtag $C$DW$T$22
     599              
     600              
     601              $C$DW$T$23      .dwtag  DW_TAG_union_type
     602                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
     603                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     604              $C$DW$64        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   12

     606                      .dwattr $C$DW$64, DW_AT_name("all")
     607                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
     608                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     610              
     611              $C$DW$65        .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
     613                      .dwattr $C$DW$65, DW_AT_name("bit")
     614                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
     615                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618                      .dwendtag $C$DW$T$23
     619              
     620              
     621              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     622                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
     623                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     624              $C$DW$66        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$66, DW_AT_name("SOC0")
     627                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SOC0")
     628                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0e)
     629                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     630                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     631                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     632              
     633              $C$DW$67        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$67, DW_AT_name("SOC1")
     636                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_SOC1")
     637                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0c)
     638                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
     639                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     640                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     641              
     642              $C$DW$68        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     644                      .dwattr $C$DW$68, DW_AT_name("SOC2")
     645                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_SOC2")
     646                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a)
     647                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     648                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     649                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     650              
     651              $C$DW$69        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     653                      .dwattr $C$DW$69, DW_AT_name("SOC3")
     654                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_SOC3")
     655                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08)
     656                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
     657                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     659              
     660              $C$DW$70        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   13

     661                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     662                      .dwattr $C$DW$70, DW_AT_name("SOC4")
     663                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_SOC4")
     664                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06)
     665                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     666                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669              $C$DW$71        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     671                      .dwattr $C$DW$71, DW_AT_name("SOC5")
     672                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_SOC5")
     673                      .dwattr $C$DW$71, DW_AT_bit_offset(0x04)
     674                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     675                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     677              
     678              $C$DW$72        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     680                      .dwattr $C$DW$72, DW_AT_name("SOC6")
     681                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_SOC6")
     682                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02)
     683                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
     684                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     685                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     686              
     687              $C$DW$73        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     689                      .dwattr $C$DW$73, DW_AT_name("SOC7")
     690                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_SOC7")
     691                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00)
     692                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
     693                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     694                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     695              
     696                      .dwendtag $C$DW$T$24
     697              
     698              
     699              $C$DW$T$25      .dwtag  DW_TAG_union_type
     700                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
     701                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     702              $C$DW$74        .dwtag  DW_TAG_member
     703                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     704                      .dwattr $C$DW$74, DW_AT_name("all")
     705                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
     706                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     707                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     708              
     709              $C$DW$75        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$24)
     711                      .dwattr $C$DW$75, DW_AT_name("bit")
     712                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
     713                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     715              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   14

     716                      .dwendtag $C$DW$T$25
     717              
     718              
     719              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     720                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
     721                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     722              $C$DW$76        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     724                      .dwattr $C$DW$76, DW_AT_name("SOC8")
     725                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SOC8")
     726                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0e)
     727                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
     728                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     730              
     731              $C$DW$77        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     733                      .dwattr $C$DW$77, DW_AT_name("SOC9")
     734                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_SOC9")
     735                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
     736                      .dwattr $C$DW$77, DW_AT_bit_size(0x02)
     737                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     739              
     740              $C$DW$78        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$78, DW_AT_name("SOC10")
     743                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_SOC10")
     744                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a)
     745                      .dwattr $C$DW$78, DW_AT_bit_size(0x02)
     746                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     748              
     749              $C$DW$79        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     751                      .dwattr $C$DW$79, DW_AT_name("SOC11")
     752                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SOC11")
     753                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
     754                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
     755                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     757              
     758              $C$DW$80        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$80, DW_AT_name("SOC12")
     761                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SOC12")
     762                      .dwattr $C$DW$80, DW_AT_bit_offset(0x06)
     763                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
     764                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     766              
     767              $C$DW$81        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$81, DW_AT_name("SOC13")
     770                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SOC13")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   15

     771                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
     772                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
     773                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     775              
     776              $C$DW$82        .dwtag  DW_TAG_member
     777                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     778                      .dwattr $C$DW$82, DW_AT_name("SOC14")
     779                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SOC14")
     780                      .dwattr $C$DW$82, DW_AT_bit_offset(0x02)
     781                      .dwattr $C$DW$82, DW_AT_bit_size(0x02)
     782                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     784              
     785              $C$DW$83        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$83, DW_AT_name("SOC15")
     788                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SOC15")
     789                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
     790                      .dwattr $C$DW$83, DW_AT_bit_size(0x02)
     791                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794                      .dwendtag $C$DW$T$26
     795              
     796              
     797              $C$DW$T$27      .dwtag  DW_TAG_union_type
     798                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
     799                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     800              $C$DW$84        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$84, DW_AT_name("all")
     803                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
     804                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     806              
     807              $C$DW$85        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$26)
     809                      .dwattr $C$DW$85, DW_AT_name("bit")
     810                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
     811                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     813              
     814                      .dwendtag $C$DW$T$27
     815              
     816              
     817              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     818                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
     819                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     820              $C$DW$86        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$86, DW_AT_name("ADCINT1")
     823                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ADCINT1")
     824                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0f)
     825                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   16

     826                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829              $C$DW$87        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$87, DW_AT_name("ADCINT2")
     832                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ADCINT2")
     833                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e)
     834                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$88        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$88, DW_AT_name("ADCINT3")
     841                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ADCINT3")
     842                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0d)
     843                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     846              
     847              $C$DW$89        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$89, DW_AT_name("ADCINT4")
     850                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ADCINT4")
     851                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
     852                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$90        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$90, DW_AT_name("ADCINT5")
     859                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ADCINT5")
     860                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0b)
     861                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     862                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$91        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$91, DW_AT_name("ADCINT6")
     868                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ADCINT6")
     869                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0a)
     870                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874              $C$DW$92        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$92, DW_AT_name("ADCINT7")
     877                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ADCINT7")
     878                      .dwattr $C$DW$92, DW_AT_bit_offset(0x09)
     879                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   17

     881                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$93        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$93, DW_AT_name("ADCINT8")
     886                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ADCINT8")
     887                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
     888                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
     889                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$94        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$94, DW_AT_name("ADCINT9")
     895                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_ADCINT9")
     896                      .dwattr $C$DW$94, DW_AT_bit_offset(0x07)
     897                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
     898                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     900              
     901              $C$DW$95        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
     904                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
     905                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
     906                      .dwattr $C$DW$95, DW_AT_bit_size(0x07)
     907                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910                      .dwendtag $C$DW$T$28
     911              
     912              
     913              $C$DW$T$29      .dwtag  DW_TAG_union_type
     914                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
     915                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     916              $C$DW$96        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$96, DW_AT_name("all")
     919                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
     920                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$97        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
     925                      .dwattr $C$DW$97, DW_AT_name("bit")
     926                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
     927                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930                      .dwendtag $C$DW$T$29
     931              
     932              
     933              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     934                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
     935                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   18

     936              $C$DW$98        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$30)
     938                      .dwattr $C$DW$98, DW_AT_name("OFFTRIM")
     939                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_OFFTRIM")
     940                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07)
     941                      .dwattr $C$DW$98, DW_AT_bit_size(0x09)
     942                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     944              
     945              $C$DW$99        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
     948                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
     949                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
     950                      .dwattr $C$DW$99, DW_AT_bit_size(0x07)
     951                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954                      .dwendtag $C$DW$T$31
     955              
     956              
     957              $C$DW$T$32      .dwtag  DW_TAG_union_type
     958                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
     959                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     960              $C$DW$100       .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     962                      .dwattr $C$DW$100, DW_AT_name("all")
     963                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_all")
     964                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     966              
     967              $C$DW$101       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$31)
     969                      .dwattr $C$DW$101, DW_AT_name("bit")
     970                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bit")
     971                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974                      .dwendtag $C$DW$T$32
     975              
     976              
     977              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     978                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
     979                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     980              $C$DW$102       .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$102, DW_AT_name("BG_FINE_TRIM")
     983                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
     984                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0c)
     985                      .dwattr $C$DW$102, DW_AT_bit_size(0x04)
     986                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     988              
     989              $C$DW$103       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   19

     991                      .dwattr $C$DW$103, DW_AT_name("BG_COARSE_TRIM")
     992                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
     993                      .dwattr $C$DW$103, DW_AT_bit_offset(0x07)
     994                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
     995                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     997              
     998              $C$DW$104       .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1000                      .dwattr $C$DW$104, DW_AT_name("EXTREF_FINE_TRIM")
    1001                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
    1002                      .dwattr $C$DW$104, DW_AT_bit_offset(0x02)
    1003                      .dwattr $C$DW$104, DW_AT_bit_size(0x05)
    1004                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1006              
    1007              $C$DW$105       .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    1010                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    1011                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1012                      .dwattr $C$DW$105, DW_AT_bit_size(0x02)
    1013                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016                      .dwendtag $C$DW$T$33
    1017              
    1018              
    1019              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1020                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
    1021                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1022              $C$DW$106       .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$106, DW_AT_name("all")
    1025                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1026                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$107       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$33)
    1031                      .dwattr $C$DW$107, DW_AT_name("bit")
    1032                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1033                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1035              
    1036                      .dwendtag $C$DW$T$34
    1037              
    1038              
    1039              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1040                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
    1041                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1042              $C$DW$108       .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$108, DW_AT_name("SIMULEN0")
    1045                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SIMULEN0")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   20

    1046                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f)
    1047                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1050              
    1051              $C$DW$109       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$109, DW_AT_name("SIMULEN2")
    1054                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_SIMULEN2")
    1055                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e)
    1056                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1057                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1059              
    1060              $C$DW$110       .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$110, DW_AT_name("SIMULEN4")
    1063                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SIMULEN4")
    1064                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d)
    1065                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1066                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$111       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$111, DW_AT_name("SIMULEN6")
    1072                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_SIMULEN6")
    1073                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1074                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078              $C$DW$112       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$112, DW_AT_name("SIMULEN8")
    1081                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SIMULEN8")
    1082                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b)
    1083                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$113       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$113, DW_AT_name("SIMULEN10")
    1090                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SIMULEN10")
    1091                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    1092                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1093                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096              $C$DW$114       .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$114, DW_AT_name("SIMULEN12")
    1099                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SIMULEN12")
    1100                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   21

    1101                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1102                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1104              
    1105              $C$DW$115       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$115, DW_AT_name("SIMULEN14")
    1108                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SIMULEN14")
    1109                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08)
    1110                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1111                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114              $C$DW$116       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1117                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1118                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1119                      .dwattr $C$DW$116, DW_AT_bit_size(0x08)
    1120                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123                      .dwendtag $C$DW$T$35
    1124              
    1125              
    1126              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1127                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
    1128                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1129              $C$DW$117       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$117, DW_AT_name("all")
    1132                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1133                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$118       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$35)
    1138                      .dwattr $C$DW$118, DW_AT_name("bit")
    1139                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1140                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1142              
    1143                      .dwendtag $C$DW$T$36
    1144              
    1145              
    1146              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1147                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
    1148                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1149              $C$DW$119       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$119, DW_AT_name("SOC0")
    1152                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SOC0")
    1153                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f)
    1154                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1155                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   22

    1156                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$120       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$120, DW_AT_name("SOC1")
    1161                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SOC1")
    1162                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e)
    1163                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1164                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1166              
    1167              $C$DW$121       .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$121, DW_AT_name("SOC2")
    1170                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SOC2")
    1171                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0d)
    1172                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1173                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1175              
    1176              $C$DW$122       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$122, DW_AT_name("SOC3")
    1179                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SOC3")
    1180                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c)
    1181                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$123       .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$123, DW_AT_name("SOC4")
    1188                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_SOC4")
    1189                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0b)
    1190                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1191                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194              $C$DW$124       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$124, DW_AT_name("SOC5")
    1197                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SOC5")
    1198                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a)
    1199                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1200                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1202              
    1203              $C$DW$125       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$125, DW_AT_name("SOC6")
    1206                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SOC6")
    1207                      .dwattr $C$DW$125, DW_AT_bit_offset(0x09)
    1208                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1209                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   23

    1211              
    1212              $C$DW$126       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$126, DW_AT_name("SOC7")
    1215                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_SOC7")
    1216                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08)
    1217                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1218                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$127       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$127, DW_AT_name("SOC8")
    1224                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_SOC8")
    1225                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07)
    1226                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1229              
    1230              $C$DW$128       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$128, DW_AT_name("SOC9")
    1233                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SOC9")
    1234                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06)
    1235                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1236                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$129       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$129, DW_AT_name("SOC10")
    1242                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_SOC10")
    1243                      .dwattr $C$DW$129, DW_AT_bit_offset(0x05)
    1244                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$130       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$130, DW_AT_name("SOC11")
    1251                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_SOC11")
    1252                      .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1253                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$131       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$131, DW_AT_name("SOC12")
    1260                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SOC12")
    1261                      .dwattr $C$DW$131, DW_AT_bit_offset(0x03)
    1262                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1265              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   24

    1266              $C$DW$132       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$132, DW_AT_name("SOC13")
    1269                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SOC13")
    1270                      .dwattr $C$DW$132, DW_AT_bit_offset(0x02)
    1271                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$133       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$133, DW_AT_name("SOC14")
    1278                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SOC14")
    1279                      .dwattr $C$DW$133, DW_AT_bit_offset(0x01)
    1280                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1281                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$134       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$134, DW_AT_name("SOC15")
    1287                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_SOC15")
    1288                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    1289                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293                      .dwendtag $C$DW$T$37
    1294              
    1295              
    1296              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1297                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
    1298                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1299              $C$DW$135       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$135, DW_AT_name("all")
    1302                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    1303                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$136       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$37)
    1308                      .dwattr $C$DW$136, DW_AT_name("bit")
    1309                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    1310                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313                      .dwendtag $C$DW$T$38
    1314              
    1315              
    1316              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1317                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
    1318                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1319              $C$DW$137       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   25

    1321                      .dwattr $C$DW$137, DW_AT_name("ACQPS")
    1322                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ACQPS")
    1323                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a)
    1324                      .dwattr $C$DW$137, DW_AT_bit_size(0x06)
    1325                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328              $C$DW$138       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$138, DW_AT_name("CHSEL")
    1331                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CHSEL")
    1332                      .dwattr $C$DW$138, DW_AT_bit_offset(0x06)
    1333                      .dwattr $C$DW$138, DW_AT_bit_size(0x04)
    1334                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1336              
    1337              $C$DW$139       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1339                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1340                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1341                      .dwattr $C$DW$139, DW_AT_bit_offset(0x05)
    1342                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1343                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$140       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1348                      .dwattr $C$DW$140, DW_AT_name("TRIGSEL")
    1349                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_TRIGSEL")
    1350                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    1351                      .dwattr $C$DW$140, DW_AT_bit_size(0x05)
    1352                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355                      .dwendtag $C$DW$T$39
    1356              
    1357              
    1358              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1359                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    1360                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1361              $C$DW$141       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$141, DW_AT_name("all")
    1364                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    1365                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$142       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$39)
    1370                      .dwattr $C$DW$142, DW_AT_name("bit")
    1371                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    1372                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375                      .dwendtag $C$DW$T$40
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   26

    1376              
    1377              
    1378              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1379                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1380                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x50)
    1381              $C$DW$143       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1383                      .dwattr $C$DW$143, DW_AT_name("ADCCTL1")
    1384                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCCTL1")
    1385                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388              $C$DW$144       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$23)
    1390                      .dwattr $C$DW$144, DW_AT_name("ADCCTL2")
    1391                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCCTL2")
    1392                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1393                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$145       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$41)
    1397                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    1398                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    1399                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1400                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$146       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$29)
    1404                      .dwattr $C$DW$146, DW_AT_name("ADCINTFLG")
    1405                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCINTFLG")
    1406                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1407                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1408              
    1409              $C$DW$147       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$29)
    1411                      .dwattr $C$DW$147, DW_AT_name("ADCINTFLGCLR")
    1412                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1413                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1414                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1415              
    1416              $C$DW$148       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1418                      .dwattr $C$DW$148, DW_AT_name("ADCINTOVF")
    1419                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINTOVF")
    1420                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1421                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$149       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
    1425                      .dwattr $C$DW$149, DW_AT_name("ADCINTOVFCLR")
    1426                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1427                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1428                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$150       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   27

    1431                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$249)
    1432                      .dwattr $C$DW$150, DW_AT_name("INTSEL1N2")
    1433                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_INTSEL1N2")
    1434                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1435                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1436              
    1437              $C$DW$151       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$251)
    1439                      .dwattr $C$DW$151, DW_AT_name("INTSEL3N4")
    1440                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_INTSEL3N4")
    1441                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1442                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$152       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$253)
    1446                      .dwattr $C$DW$152, DW_AT_name("INTSEL5N6")
    1447                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INTSEL5N6")
    1448                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1449                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$153       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$255)
    1453                      .dwattr $C$DW$153, DW_AT_name("INTSEL7N8")
    1454                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_INTSEL7N8")
    1455                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1456                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458              $C$DW$154       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$257)
    1460                      .dwattr $C$DW$154, DW_AT_name("INTSEL9N10")
    1461                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INTSEL9N10")
    1462                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1463                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$155       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$42)
    1467                      .dwattr $C$DW$155, DW_AT_name("rsvd2")
    1468                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd2")
    1469                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1470                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1471              
    1472              $C$DW$156       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$402)
    1474                      .dwattr $C$DW$156, DW_AT_name("SOCPRICTL")
    1475                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_SOCPRICTL")
    1476                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1477                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1478              
    1479              $C$DW$157       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$157, DW_AT_name("rsvd3")
    1482                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd3")
    1483                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1484                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1485              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   28

    1486              $C$DW$158       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$36)
    1488                      .dwattr $C$DW$158, DW_AT_name("ADCSAMPLEMODE")
    1489                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1490                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1491                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$159       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$159, DW_AT_name("rsvd4")
    1496                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd4")
    1497                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1498                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1499              
    1500              $C$DW$160       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$25)
    1502                      .dwattr $C$DW$160, DW_AT_name("ADCINTSOCSEL1")
    1503                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1504                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1505                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1506              
    1507              $C$DW$161       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    1509                      .dwattr $C$DW$161, DW_AT_name("ADCINTSOCSEL2")
    1510                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1511                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1512                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1513              
    1514              $C$DW$162       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$41)
    1516                      .dwattr $C$DW$162, DW_AT_name("rsvd5")
    1517                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd5")
    1518                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1519                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1520              
    1521              $C$DW$163       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$38)
    1523                      .dwattr $C$DW$163, DW_AT_name("ADCSOCFLG1")
    1524                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1525                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1526                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1527              
    1528              $C$DW$164       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$164, DW_AT_name("rsvd6")
    1531                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd6")
    1532                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1533                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1534              
    1535              $C$DW$165       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$38)
    1537                      .dwattr $C$DW$165, DW_AT_name("ADCSOCFRC1")
    1538                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1539                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1540                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   29

    1541              
    1542              $C$DW$166       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$166, DW_AT_name("rsvd7")
    1545                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd7")
    1546                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1547                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$167       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$38)
    1551                      .dwattr $C$DW$167, DW_AT_name("ADCSOCOVF1")
    1552                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1553                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1554                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556              $C$DW$168       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1558                      .dwattr $C$DW$168, DW_AT_name("rsvd8")
    1559                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd8")
    1560                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1561                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1562              
    1563              $C$DW$169       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$38)
    1565                      .dwattr $C$DW$169, DW_AT_name("ADCSOCOVFCLR1")
    1566                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1567                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1568                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$170       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1572                      .dwattr $C$DW$170, DW_AT_name("rsvd9")
    1573                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd9")
    1574                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1575                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1576              
    1577              $C$DW$171       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1579                      .dwattr $C$DW$171, DW_AT_name("ADCSOC0CTL")
    1580                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    1581                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1582                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584              $C$DW$172       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    1586                      .dwattr $C$DW$172, DW_AT_name("ADCSOC1CTL")
    1587                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    1588                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1589                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$173       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$40)
    1593                      .dwattr $C$DW$173, DW_AT_name("ADCSOC2CTL")
    1594                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    1595                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   30

    1596                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1597              
    1598              $C$DW$174       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    1600                      .dwattr $C$DW$174, DW_AT_name("ADCSOC3CTL")
    1601                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    1602                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1603                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1604              
    1605              $C$DW$175       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
    1607                      .dwattr $C$DW$175, DW_AT_name("ADCSOC4CTL")
    1608                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    1609                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1610                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1611              
    1612              $C$DW$176       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$40)
    1614                      .dwattr $C$DW$176, DW_AT_name("ADCSOC5CTL")
    1615                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    1616                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1617                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619              $C$DW$177       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$40)
    1621                      .dwattr $C$DW$177, DW_AT_name("ADCSOC6CTL")
    1622                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    1623                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1624                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$178       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$40)
    1628                      .dwattr $C$DW$178, DW_AT_name("ADCSOC7CTL")
    1629                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    1630                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1631                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$179       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    1635                      .dwattr $C$DW$179, DW_AT_name("ADCSOC8CTL")
    1636                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    1637                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1638                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$180       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$40)
    1642                      .dwattr $C$DW$180, DW_AT_name("ADCSOC9CTL")
    1643                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    1644                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1645                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647              $C$DW$181       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    1649                      .dwattr $C$DW$181, DW_AT_name("ADCSOC10CTL")
    1650                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCSOC10CTL")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   31

    1651                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1652                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$182       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1656                      .dwattr $C$DW$182, DW_AT_name("ADCSOC11CTL")
    1657                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    1658                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1659                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661              $C$DW$183       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1663                      .dwattr $C$DW$183, DW_AT_name("ADCSOC12CTL")
    1664                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    1665                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1666                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$184       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1670                      .dwattr $C$DW$184, DW_AT_name("ADCSOC13CTL")
    1671                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    1672                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1673                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1674              
    1675              $C$DW$185       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$40)
    1677                      .dwattr $C$DW$185, DW_AT_name("ADCSOC14CTL")
    1678                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    1679                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1680                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1681              
    1682              $C$DW$186       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    1684                      .dwattr $C$DW$186, DW_AT_name("ADCSOC15CTL")
    1685                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ADCSOC15CTL")
    1686                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    1687                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$187       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$43)
    1691                      .dwattr $C$DW$187, DW_AT_name("rsvd10")
    1692                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd10")
    1693                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1694                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$188       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$34)
    1698                      .dwattr $C$DW$188, DW_AT_name("ADCREFTRIM")
    1699                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ADCREFTRIM")
    1700                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1701                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$189       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    1705                      .dwattr $C$DW$189, DW_AT_name("ADCOFFTRIM")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{72A93008-D982-4792-93E9-091088856337} PAGE   32

    1706                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1707                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1708                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710              $C$DW$190       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$44)
    1712                      .dwattr $C$DW$190, DW_AT_name("rsvd11")
    1713                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd11")
    1714                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1715                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717                      .dwendtag $C$DW$T$45
    1718              
    1719              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    1720                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$45)
    1721              
