TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:36 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_CpuTimers.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13                      .global _CpuTimer1
      14 00000000       _CpuTimer1:     .usect  ".ebss",8,1,1
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("CpuTimer1")

     260                      .dwattr $C$DW$16, DW_AT_low_pc(0x00)
     261                      .dwattr $C$DW$16, DW_AT_name("FS$$MPY")
     262                      .dwattr $C$DW$16, DW_AT_TI_call
     263              
     264 00000044 7640!         LCR       #FS$$MPY              ; [CPU_] |85| 
         00000045 0000 
     265                      ; call occurs [#FS$$MPY] ; [] |85| 
     266              $C$DW$17        .dwtag  DW_TAG_TI_branch
     267                      .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     268                      .dwattr $C$DW$17, DW_AT_name("FS$$TOL")
     269                      .dwattr $C$DW$17, DW_AT_TI_call
     270              
     271 00000046 7640!         LCR       #FS$$TOL              ; [CPU_] |85| 
         00000047 0000 
     272                      ; call occurs [#FS$$TOL] ; [] |85| 
     273 00000048 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |85| 
     274 00000049 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |85| 
     275                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 88,column 2,is_stmt,isa 0
     276 0000004a 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |88| 
     277 0000004b 2BF4          MOV       *+XAR4[6],#0          ; [CPU_] |88| 
     278                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 89,column 2,is_stmt,isa 0
     279 0000004c 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |89| 
     280 0000004d 2BFC          MOV       *+XAR4[7],#0          ; [CPU_] |89| 
     281                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 92,column 2,is_stmt,isa 0
     282 0000004e 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |92| 
     283 0000004f 1AE4          OR        *+XAR4[4],#0x0010     ; [CPU_] |92| 
         00000050 0010 
     284                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 93,column 2,is_stmt,isa 0
     285 00000051 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |93| 
     286 00000052 1AE4          OR        *+XAR4[4],#0x0020     ; [CPU_] |93| 
         00000053 0020 
     287                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 94,column 2,is_stmt,isa 0
     288 00000054 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |94| 
     289 00000055 18E4          AND       *+XAR4[4],#0xfbff     ; [CPU_] |94| 
         00000056 FBFF 
     290                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 95,column 2,is_stmt,isa 0
     291 00000057 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |95| 
     292 00000058 18E4          AND       *+XAR4[4],#0xf7ff     ; [CPU_] |95| 
         00000059 F7FF 
     293                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 96,column 2,is_stmt,isa 0
     294 0000005a 8AC1          MOVL      XAR4,*+XAR1[0]        ; [CPU_] |96| 
     295                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 99,column 2,is_stmt,isa 0
     296 0000005b 0200          MOVB      ACC,#0                ; [CPU_] |99| 
     297                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 96,column 2,is_stmt,isa 0
     298 0000005c 1AE4          OR        *+XAR4[4],#0x4000     ; [CPU_] |96| 
         0000005d 4000 
     299 0000005e FE82          SUBB      SP,#2                 ; [CPU_U] 
     300                      .dwcfi  cfa_offset, -4
     301                      .dwpsn  file "../source/DSP2803x_CpuTimers.c",line 99,column 2,is_stmt,isa 0
     302 0000005f 1ED1          MOVL      *+XAR1[2],ACC         ; [CPU_] |99| 
     303 00000060 8BBE          MOVL      XAR1,*--SP            ; [CPU_] 
     304                      .dwcfi  cfa_offset, -2
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE    7

     305                      .dwcfi  restore_reg, 7
     306              $C$DW$18        .dwtag  DW_TAG_TI_branch
     307                      .dwattr $C$DW$18, DW_AT_low_pc(0x00)
     308                      .dwattr $C$DW$18, DW_AT_TI_return
     309              
     310 00000061 0006          LRETR     ; [CPU_] 
     311                      ; return occurs ; [] 
     312                      .dwattr $C$DW$9, DW_AT_TI_end_file("../source/DSP2803x_CpuTimers.c")
     313                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x64)
     314                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     315                      .dwendentry
     316                      .dwendtag $C$DW$9
     317              
     318              ;**************************************************************
     319              ;* UNDEFINED EXTERNAL REFERENCES                              *
     320              ;**************************************************************
     321                      .global _CpuTimer1Regs
     322                      .global _CpuTimer2Regs
     323                      .global _CpuTimer0Regs
     324                      .global FS$$MPY
     325                      .global FS$$TOL
     326              
     327              ;***************************************************************
     328              ;* TYPE INFORMATION                                            *
     329              ;***************************************************************
     330              
     331              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     332                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     333                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     334              $C$DW$19        .dwtag  DW_TAG_member
     335                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$29)
     336                      .dwattr $C$DW$19, DW_AT_name("TIM")
     337                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_TIM")
     338                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     339                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     340              
     341              $C$DW$20        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$25)
     343                      .dwattr $C$DW$20, DW_AT_name("PRD")
     344                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_PRD")
     345                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     346                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     347              
     348              $C$DW$21        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$28)
     350                      .dwattr $C$DW$21, DW_AT_name("TCR")
     351                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_TCR")
     352                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     353                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$22        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$22, DW_AT_name("rsvd1")
     358                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd1")
     359                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE    8

     360                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$23        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$34)
     364                      .dwattr $C$DW$23, DW_AT_name("TPR")
     365                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_TPR")
     366                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     367                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369              $C$DW$24        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$32)
     371                      .dwattr $C$DW$24, DW_AT_name("TPRH")
     372                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_TPRH")
     373                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     374                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     375              
     376                      .dwendtag $C$DW$T$20
     377              
     378              $C$DW$25        .dwtag  DW_TAG_TI_far_type
     379                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     380              
     381              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     382                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$25)
     383              
     384              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     385                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     386                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     387              
     388              
     389              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     390                      .dwattr $C$DW$T$24, DW_AT_name("CPUTIMER_VARS")
     391                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     392              $C$DW$26        .dwtag  DW_TAG_member
     393                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     394                      .dwattr $C$DW$26, DW_AT_name("RegsAddr")
     395                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_RegsAddr")
     396                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     397                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     398              
     399              $C$DW$27        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$23)
     401                      .dwattr $C$DW$27, DW_AT_name("InterruptCount")
     402                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_InterruptCount")
     403                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     404                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     405              
     406              $C$DW$28        .dwtag  DW_TAG_member
     407                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$16)
     408                      .dwattr $C$DW$28, DW_AT_name("CPUFreqInMHz")
     409                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_CPUFreqInMHz")
     410                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     411                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     412              
     413              $C$DW$29        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$16)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE    9

     415                      .dwattr $C$DW$29, DW_AT_name("PeriodInUSec")
     416                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_PeriodInUSec")
     417                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     418                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     419              
     420                      .dwendtag $C$DW$T$24
     421              
     422              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     423                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
     424                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     425              
     426              $C$DW$30        .dwtag  DW_TAG_TI_far_type
     427                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$35)
     428              
     429              $C$DW$T$36      .dwtag  DW_TAG_const_type
     430                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$30)
     431              
     432              
     433              $C$DW$T$25      .dwtag  DW_TAG_union_type
     434                      .dwattr $C$DW$T$25, DW_AT_name("PRD_GROUP")
     435                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     436              $C$DW$31        .dwtag  DW_TAG_member
     437                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     438                      .dwattr $C$DW$31, DW_AT_name("all")
     439                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_all")
     440                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     441                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     442              
     443              $C$DW$32        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$26)
     445                      .dwattr $C$DW$32, DW_AT_name("half")
     446                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_half")
     447                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     448                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     449              
     450                      .dwendtag $C$DW$T$25
     451              
     452              
     453              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     454                      .dwattr $C$DW$T$26, DW_AT_name("PRD_REG")
     455                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     456              $C$DW$33        .dwtag  DW_TAG_member
     457                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     458                      .dwattr $C$DW$33, DW_AT_name("LSW")
     459                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_LSW")
     460                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     461                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     462              
     463              $C$DW$34        .dwtag  DW_TAG_member
     464                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     465                      .dwattr $C$DW$34, DW_AT_name("MSW")
     466                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_MSW")
     467                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     468                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     469              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE   10

     470                      .dwendtag $C$DW$T$26
     471              
     472              
     473              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     474                      .dwattr $C$DW$T$27, DW_AT_name("TCR_BITS")
     475                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     476              $C$DW$35        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$35, DW_AT_name("rsvd1")
     479                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd1")
     480                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0c)
     481                      .dwattr $C$DW$35, DW_AT_bit_size(0x04)
     482                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     484              
     485              $C$DW$36        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$36, DW_AT_name("TSS")
     488                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_TSS")
     489                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0b)
     490                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     491                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494              $C$DW$37        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$37, DW_AT_name("TRB")
     497                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_TRB")
     498                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0a)
     499                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     500                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     501                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     502              
     503              $C$DW$38        .dwtag  DW_TAG_member
     504                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     505                      .dwattr $C$DW$38, DW_AT_name("rsvd2")
     506                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd2")
     507                      .dwattr $C$DW$38, DW_AT_bit_offset(0x06)
     508                      .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     509                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     511              
     512              $C$DW$39        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     514                      .dwattr $C$DW$39, DW_AT_name("SOFT")
     515                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_SOFT")
     516                      .dwattr $C$DW$39, DW_AT_bit_offset(0x05)
     517                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     518                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     520              
     521              $C$DW$40        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     523                      .dwattr $C$DW$40, DW_AT_name("FREE")
     524                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_FREE")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE   11

     525                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04)
     526                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     527                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$41        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$41, DW_AT_name("rsvd3")
     533                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd3")
     534                      .dwattr $C$DW$41, DW_AT_bit_offset(0x02)
     535                      .dwattr $C$DW$41, DW_AT_bit_size(0x02)
     536                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     538              
     539              $C$DW$42        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$42, DW_AT_name("TIE")
     542                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_TIE")
     543                      .dwattr $C$DW$42, DW_AT_bit_offset(0x01)
     544                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     545                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     546                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     547              
     548              $C$DW$43        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     550                      .dwattr $C$DW$43, DW_AT_name("TIF")
     551                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_TIF")
     552                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00)
     553                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     554                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     555                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     556              
     557                      .dwendtag $C$DW$T$27
     558              
     559              
     560              $C$DW$T$28      .dwtag  DW_TAG_union_type
     561                      .dwattr $C$DW$T$28, DW_AT_name("TCR_REG")
     562                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     563              $C$DW$44        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$44, DW_AT_name("all")
     566                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     567                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     569              
     570              $C$DW$45        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$27)
     572                      .dwattr $C$DW$45, DW_AT_name("bit")
     573                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bit")
     574                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     576              
     577                      .dwendtag $C$DW$T$28
     578              
     579              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE   12

     580              $C$DW$T$29      .dwtag  DW_TAG_union_type
     581                      .dwattr $C$DW$T$29, DW_AT_name("TIM_GROUP")
     582                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     583              $C$DW$46        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     585                      .dwattr $C$DW$46, DW_AT_name("all")
     586                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_all")
     587                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     589              
     590              $C$DW$47        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$30)
     592                      .dwattr $C$DW$47, DW_AT_name("half")
     593                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_half")
     594                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     596              
     597                      .dwendtag $C$DW$T$29
     598              
     599              
     600              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     601                      .dwattr $C$DW$T$30, DW_AT_name("TIM_REG")
     602                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     603              $C$DW$48        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$48, DW_AT_name("LSW")
     606                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_LSW")
     607                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$49        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$49, DW_AT_name("MSW")
     613                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_MSW")
     614                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     615                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617                      .dwendtag $C$DW$T$30
     618              
     619              
     620              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     621                      .dwattr $C$DW$T$31, DW_AT_name("TPRH_BITS")
     622                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     623              $C$DW$50        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$50, DW_AT_name("TDDRH")
     626                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_TDDRH")
     627                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08)
     628                      .dwattr $C$DW$50, DW_AT_bit_size(0x08)
     629                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632              $C$DW$51        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$51, DW_AT_name("PSCH")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE   13

     635                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PSCH")
     636                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     637                      .dwattr $C$DW$51, DW_AT_bit_size(0x08)
     638                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641                      .dwendtag $C$DW$T$31
     642              
     643              
     644              $C$DW$T$32      .dwtag  DW_TAG_union_type
     645                      .dwattr $C$DW$T$32, DW_AT_name("TPRH_REG")
     646                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     647              $C$DW$52        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$52, DW_AT_name("all")
     650                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     651                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$53        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$31)
     656                      .dwattr $C$DW$53, DW_AT_name("bit")
     657                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     658                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661                      .dwendtag $C$DW$T$32
     662              
     663              
     664              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     665                      .dwattr $C$DW$T$33, DW_AT_name("TPR_BITS")
     666                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     667              $C$DW$54        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$54, DW_AT_name("TDDR")
     670                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_TDDR")
     671                      .dwattr $C$DW$54, DW_AT_bit_offset(0x08)
     672                      .dwattr $C$DW$54, DW_AT_bit_size(0x08)
     673                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$55        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$55, DW_AT_name("PSC")
     679                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PSC")
     680                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     681                      .dwattr $C$DW$55, DW_AT_bit_size(0x08)
     682                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685                      .dwendtag $C$DW$T$33
     686              
     687              
     688              $C$DW$T$34      .dwtag  DW_TAG_union_type
     689                      .dwattr $C$DW$T$34, DW_AT_name("TPR_REG")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE   14

     690                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     691              $C$DW$56        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$56, DW_AT_name("all")
     694                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     695                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     697              
     698              $C$DW$57        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$33)
     700                      .dwattr $C$DW$57, DW_AT_name("bit")
     701                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     702                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     704              
     705                      .dwendtag $C$DW$T$34
     706              
     707              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     708                      .dwattr $C$DW$T$2, DW_AT_name("void")
     709              
     710              $C$DW$T$4       .dwtag  DW_TAG_base_type
     711                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     712                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     713                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     714              
     715              $C$DW$T$5       .dwtag  DW_TAG_base_type
     716                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     717                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     718                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     719              
     720              $C$DW$T$6       .dwtag  DW_TAG_base_type
     721                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     722                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     723                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     724              
     725              $C$DW$T$7       .dwtag  DW_TAG_base_type
     726                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     727                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     728                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     729              
     730              $C$DW$T$8       .dwtag  DW_TAG_base_type
     731                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     732                      .dwattr $C$DW$T$8, DW_AT_name("short")
     733                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     734              
     735              $C$DW$T$9       .dwtag  DW_TAG_base_type
     736                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     737                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     738                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     739              
     740              $C$DW$T$10      .dwtag  DW_TAG_base_type
     741                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     742                      .dwattr $C$DW$T$10, DW_AT_name("int")
     743                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     744              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{8E64095B-8A89-4A81-AFBA-52C4F203F2B1} PAGE   15

     745              $C$DW$T$11      .dwtag  DW_TAG_base_type
     746                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     747                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     748                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     749              
     750              $C$DW$T$19      .dwtag  DW_TAG_typedef
     751                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
     752                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     753                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     754              
     755              $C$DW$T$12      .dwtag  DW_TAG_base_type
     756                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     757                      .dwattr $C$DW$T$12, DW_AT_name("long")
     758                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     759              
     760              $C$DW$T$13      .dwtag  DW_TAG_base_type
     761                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     762                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
