TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:40 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_SysCtrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DSP28x_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DSP28x_usDelay")

     902                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 313,column 5,is_stmt,isa 0
     903 0000011d 28EC          MOV       *+XAR4[5],#65535      ; [CPU_] |313| 
         0000011e FFFF 
     904                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 314,column 5,is_stmt,isa 0
     905 0000011f 28F4          MOV       *+XAR4[6],#65535      ; [CPU_] |314| 
         00000120 FFFF 
     906                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 315,column 5,is_stmt,isa 0
     907 00000121 28FC          MOV       *+XAR4[7],#65535      ; [CPU_] |315| 
         00000122 FFFF 
     908 00000123 761A   EDIS
     909 00000124 761F!         MOVW      DP,#_CsmPwl           ; [CPU_U] 
         00000125 0000 
     910                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 333,column 10,is_stmt,isa 0
     911 00000126 D00F          MOVB      XAR0,#15              ; [CPU_] |333| 
     912 00000127 FF69          SPM       #0                    ; [CPU_] 
     913                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 321,column 5,is_stmt,isa 0
     914 00000128 9200!         MOV       AL,@_CsmPwl           ; [CPU_] |321| 
     915 00000129 9641          MOV       *-SP[1],AL            ; [CPU_] |321| 
     916                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 322,column 5,is_stmt,isa 0
     917 0000012a 9201!         MOV       AL,@_CsmPwl+1         ; [CPU_] |322| 
     918 0000012b 9641          MOV       *-SP[1],AL            ; [CPU_] |322| 
     919                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 323,column 5,is_stmt,isa 0
     920 0000012c 9202!         MOV       AL,@_CsmPwl+2         ; [CPU_] |323| 
     921 0000012d 9641          MOV       *-SP[1],AL            ; [CPU_] |323| 
     922                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 324,column 5,is_stmt,isa 0
     923 0000012e 9203!         MOV       AL,@_CsmPwl+3         ; [CPU_] |324| 
     924 0000012f 9641          MOV       *-SP[1],AL            ; [CPU_] |324| 
     925                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 325,column 5,is_stmt,isa 0
     926 00000130 9204!         MOV       AL,@_CsmPwl+4         ; [CPU_] |325| 
     927 00000131 9641          MOV       *-SP[1],AL            ; [CPU_] |325| 
     928                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 326,column 5,is_stmt,isa 0
     929 00000132 9205!         MOV       AL,@_CsmPwl+5         ; [CPU_] |326| 
     930 00000133 9641          MOV       *-SP[1],AL            ; [CPU_] |326| 
     931                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 327,column 5,is_stmt,isa 0
     932 00000134 9206!         MOV       AL,@_CsmPwl+6         ; [CPU_] |327| 
     933 00000135 9641          MOV       *-SP[1],AL            ; [CPU_] |327| 
     934                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 328,column 5,is_stmt,isa 0
     935 00000136 9207!         MOV       AL,@_CsmPwl+7         ; [CPU_] |328| 
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   20

     936 00000137 9641          MOV       *-SP[1],AL            ; [CPU_] |328| 
     937                      .dwpsn  file "../source/DSP2803x_SysCtrl.c",line 333,column 10,is_stmt,isa 0
     938 00000138 9294          MOV       AL,*+XAR4[AR0]        ; [CPU_] |333| 
     939 00000139 F001          XORB      AL,#0x01              ; [CPU_] |333| 
     940 0000013a 9001          ANDB      AL,#0x01              ; [CPU_] |333| 
     941 0000013b FE82          SUBB      SP,#2                 ; [CPU_U] 
     942                      .dwcfi  cfa_offset, -2
     943              $C$DW$41        .dwtag  DW_TAG_TI_branch
     944                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     945                      .dwattr $C$DW$41, DW_AT_TI_return
     946              
     947 0000013c 0006          LRETR     ; [CPU_] 
     948                      ; return occurs ; [] 
     949                      .dwattr $C$DW$39, DW_AT_TI_end_file("../source/DSP2803x_SysCtrl.c")
     950                      .dwattr $C$DW$39, DW_AT_TI_end_line(0x14f)
     951                      .dwattr $C$DW$39, DW_AT_TI_end_column(0x01)
     952                      .dwendentry
     953                      .dwendtag $C$DW$39
     954              
     955              ;**************************************************************
     956              ;* UNDEFINED EXTERNAL REFERENCES                              *
     957              ;**************************************************************
     958                      .global _DSP28x_usDelay
     959                      .global _CsmPwl
     960                      .global _FlashRegs
     961                      .global _CsmRegs
     962                      .global _SysCtrlRegs
     963                      .global _GpioCtrlRegs
     964              
     965              ;***************************************************************
     966              ;* TYPE INFORMATION                                            *
     967              ;***************************************************************
     968              
     969              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     970                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     971                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     972              $C$DW$42        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     975                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     976                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0f)
     977                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     978                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981              $C$DW$43        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$43, DW_AT_name("rsvd2")
     984                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd2")
     985                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0e)
     986                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990              $C$DW$44        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   21

     991                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$44, DW_AT_name("AIO2")
     993                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_AIO2")
     994                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0d)
     995                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     996                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     998              
     999              $C$DW$45        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$45, DW_AT_name("rsvd3")
    1002                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd3")
    1003                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0c)
    1004                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
    1005                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$46        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$46, DW_AT_name("AIO4")
    1011                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_AIO4")
    1012                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0b)
    1013                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$47        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$47, DW_AT_name("rsvd4")
    1020                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd4")
    1021                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0a)
    1022                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$48        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$48, DW_AT_name("AIO6")
    1029                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_AIO6")
    1030                      .dwattr $C$DW$48, DW_AT_bit_offset(0x09)
    1031                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1032                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$49        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$49, DW_AT_name("rsvd5")
    1038                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd5")
    1039                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
    1040                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044              $C$DW$50        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   22

    1046                      .dwattr $C$DW$50, DW_AT_name("rsvd6")
    1047                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd6")
    1048                      .dwattr $C$DW$50, DW_AT_bit_offset(0x07)
    1049                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$51        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$51, DW_AT_name("rsvd7")
    1056                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd7")
    1057                      .dwattr $C$DW$51, DW_AT_bit_offset(0x06)
    1058                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$52        .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$52, DW_AT_name("AIO10")
    1065                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_AIO10")
    1066                      .dwattr $C$DW$52, DW_AT_bit_offset(0x05)
    1067                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1068                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1070              
    1071              $C$DW$53        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$53, DW_AT_name("rsvd8")
    1074                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd8")
    1075                      .dwattr $C$DW$53, DW_AT_bit_offset(0x04)
    1076                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$54        .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$54, DW_AT_name("AIO12")
    1083                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_AIO12")
    1084                      .dwattr $C$DW$54, DW_AT_bit_offset(0x03)
    1085                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
    1086                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$55        .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$55, DW_AT_name("rsvd9")
    1092                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd9")
    1093                      .dwattr $C$DW$55, DW_AT_bit_offset(0x02)
    1094                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
    1095                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1097              
    1098              $C$DW$56        .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$56, DW_AT_name("AIO14")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   23

    1101                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_AIO14")
    1102                      .dwattr $C$DW$56, DW_AT_bit_offset(0x01)
    1103                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107              $C$DW$57        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1109                      .dwattr $C$DW$57, DW_AT_name("rsvd10")
    1110                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd10")
    1111                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
    1112                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1113                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116                      .dwendtag $C$DW$T$20
    1117              
    1118              
    1119              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1120                      .dwattr $C$DW$T$21, DW_AT_name("AIODAT_REG")
    1121                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1122              $C$DW$58        .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1124                      .dwattr $C$DW$58, DW_AT_name("all")
    1125                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
    1126                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129              $C$DW$59        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
    1131                      .dwattr $C$DW$59, DW_AT_name("bit")
    1132                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
    1133                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136                      .dwendtag $C$DW$T$21
    1137              
    1138              
    1139              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1140                      .dwattr $C$DW$T$22, DW_AT_name("AIO_BITS")
    1141                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1142              $C$DW$60        .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$60, DW_AT_name("rsvd1")
    1145                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd1")
    1146                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e)
    1147                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
    1148                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$61        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$61, DW_AT_name("rsvd2")
    1154                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd2")
    1155                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   24

    1156                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
    1157                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$62        .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$62, DW_AT_name("AIO2")
    1163                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_AIO2")
    1164                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0a)
    1165                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
    1166                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169              $C$DW$63        .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$63, DW_AT_name("rsvd3")
    1172                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd3")
    1173                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
    1174                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
    1175                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$64        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$64, DW_AT_name("AIO4")
    1181                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_AIO4")
    1182                      .dwattr $C$DW$64, DW_AT_bit_offset(0x06)
    1183                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
    1184                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187              $C$DW$65        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$65, DW_AT_name("rsvd4")
    1190                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd4")
    1191                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04)
    1192                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1193                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1195              
    1196              $C$DW$66        .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$66, DW_AT_name("AIO6")
    1199                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_AIO6")
    1200                      .dwattr $C$DW$66, DW_AT_bit_offset(0x02)
    1201                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
    1202                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205              $C$DW$67        .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$67, DW_AT_name("rsvd5")
    1208                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd5")
    1209                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
    1210                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   25

    1211                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$68        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$68, DW_AT_name("rsvd6")
    1217                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd6")
    1218                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e)
    1219                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
    1220                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1221                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1222              
    1223              $C$DW$69        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$69, DW_AT_name("rsvd7")
    1226                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd7")
    1227                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c)
    1228                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
    1229                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1230                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1231              
    1232              $C$DW$70        .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$70, DW_AT_name("AIO10")
    1235                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_AIO10")
    1236                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0a)
    1237                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
    1238                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1239                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$71        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$71, DW_AT_name("rsvd8")
    1244                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd8")
    1245                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
    1246                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
    1247                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1248                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1249              
    1250              $C$DW$72        .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$72, DW_AT_name("AIO12")
    1253                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_AIO12")
    1254                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06)
    1255                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
    1256                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1257                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1258              
    1259              $C$DW$73        .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$73, DW_AT_name("rsvd9")
    1262                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd9")
    1263                      .dwattr $C$DW$73, DW_AT_bit_offset(0x04)
    1264                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
    1265                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   26

    1266                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1267              
    1268              $C$DW$74        .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$74, DW_AT_name("AIO14")
    1271                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_AIO14")
    1272                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02)
    1273                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
    1274                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1275                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1276              
    1277              $C$DW$75        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$75, DW_AT_name("rsvd10")
    1280                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd10")
    1281                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00)
    1282                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
    1283                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1284                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1285              
    1286                      .dwendtag $C$DW$T$22
    1287              
    1288              
    1289              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1290                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
    1291                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1292              $C$DW$76        .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
    1294                      .dwattr $C$DW$76, DW_AT_name("all")
    1295                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
    1296                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$77        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1301                      .dwattr $C$DW$77, DW_AT_name("bit")
    1302                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
    1303                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306                      .dwendtag $C$DW$T$24
    1307              
    1308              
    1309              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1310                      .dwattr $C$DW$T$25, DW_AT_name("CLKCTL_BITS")
    1311                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1312              $C$DW$78        .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$78, DW_AT_name("OSCCLKSRCSEL")
    1315                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1316                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0f)
    1317                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1320              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   27

    1321              $C$DW$79        .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$79, DW_AT_name("OSCCLKSRC2SEL")
    1324                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
    1325                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0e)
    1326                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1327                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$80        .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$80, DW_AT_name("WDCLKSRCSEL")
    1333                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
    1334                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0d)
    1335                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$81        .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$81, DW_AT_name("TMR2CLKSRCSEL")
    1342                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
    1343                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0b)
    1344                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
    1345                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$82        .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$82, DW_AT_name("TMR2CLKPRESCALE")
    1351                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
    1352                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08)
    1353                      .dwattr $C$DW$82, DW_AT_bit_size(0x03)
    1354                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$83        .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$83, DW_AT_name("INTOSC1OFF")
    1360                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_INTOSC1OFF")
    1361                      .dwattr $C$DW$83, DW_AT_bit_offset(0x07)
    1362                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1363                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366              $C$DW$84        .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$84, DW_AT_name("INTOSC1HALTI")
    1369                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_INTOSC1HALTI")
    1370                      .dwattr $C$DW$84, DW_AT_bit_offset(0x06)
    1371                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$85        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   28

    1376                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$85, DW_AT_name("INTOSC2OFF")
    1378                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1379                      .dwattr $C$DW$85, DW_AT_bit_offset(0x05)
    1380                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$86        .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$86, DW_AT_name("INTOSC2HALTI")
    1387                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INTOSC2HALTI")
    1388                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04)
    1389                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1392              
    1393              $C$DW$87        .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$87, DW_AT_name("WDHALTI")
    1396                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_WDHALTI")
    1397                      .dwattr $C$DW$87, DW_AT_bit_offset(0x03)
    1398                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$88        .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$88, DW_AT_name("XCLKINOFF")
    1405                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_XCLKINOFF")
    1406                      .dwattr $C$DW$88, DW_AT_bit_offset(0x02)
    1407                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$89        .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$89, DW_AT_name("XTALOSCOFF")
    1414                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_XTALOSCOFF")
    1415                      .dwattr $C$DW$89, DW_AT_bit_offset(0x01)
    1416                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$90        .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$90, DW_AT_name("NMIRESETSEL")
    1423                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_NMIRESETSEL")
    1424                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00)
    1425                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429                      .dwendtag $C$DW$T$25
    1430              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   29

    1431              
    1432              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1433                      .dwattr $C$DW$T$26, DW_AT_name("CLKCTL_REG")
    1434                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1435              $C$DW$91        .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$91, DW_AT_name("all")
    1438                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
    1439                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$92        .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1444                      .dwattr $C$DW$92, DW_AT_name("bit")
    1445                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
    1446                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449                      .dwendtag $C$DW$T$26
    1450              
    1451              
    1452              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1453                      .dwattr $C$DW$T$27, DW_AT_name("CSMSCR_BITS")
    1454                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1455              $C$DW$93        .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$93, DW_AT_name("SECURE")
    1458                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SECURE")
    1459                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0f)
    1460                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1461                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1463              
    1464              $C$DW$94        .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    1467                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    1468                      .dwattr $C$DW$94, DW_AT_bit_offset(0x01)
    1469                      .dwattr $C$DW$94, DW_AT_bit_size(0x0e)
    1470                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1472              
    1473              $C$DW$95        .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$95, DW_AT_name("FORCESEC")
    1476                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_FORCESEC")
    1477                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
    1478                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1479                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482                      .dwendtag $C$DW$T$27
    1483              
    1484              
    1485              $C$DW$T$28      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   30

    1486                      .dwattr $C$DW$T$28, DW_AT_name("CSMSCR_REG")
    1487                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1488              $C$DW$96        .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$96, DW_AT_name("all")
    1491                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1492                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1493                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1494              
    1495              $C$DW$97        .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$27)
    1497                      .dwattr $C$DW$97, DW_AT_name("bit")
    1498                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1499                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502                      .dwendtag $C$DW$T$28
    1503              
    1504              
    1505              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1506                      .dwattr $C$DW$T$29, DW_AT_name("CSM_PWL")
    1507                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    1508              $C$DW$98        .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1510                      .dwattr $C$DW$98, DW_AT_name("PSWD0")
    1511                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PSWD0")
    1512                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$99        .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$99, DW_AT_name("PSWD1")
    1518                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PSWD1")
    1519                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1520                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1521              
    1522              $C$DW$100       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1524                      .dwattr $C$DW$100, DW_AT_name("PSWD2")
    1525                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PSWD2")
    1526                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1527                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$101       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$101, DW_AT_name("PSWD3")
    1532                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PSWD3")
    1533                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1534                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536              $C$DW$102       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$102, DW_AT_name("PSWD4")
    1539                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PSWD4")
    1540                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   31

    1541                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1542              
    1543              $C$DW$103       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$103, DW_AT_name("PSWD5")
    1546                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PSWD5")
    1547                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1548                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1549              
    1550              $C$DW$104       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$104, DW_AT_name("PSWD6")
    1553                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PSWD6")
    1554                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1555                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557              $C$DW$105       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$105, DW_AT_name("PSWD7")
    1560                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PSWD7")
    1561                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1562                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564                      .dwendtag $C$DW$T$29
    1565              
    1566              $C$DW$106       .dwtag  DW_TAG_TI_far_type
    1567                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1568              
    1569              $C$DW$T$91      .dwtag  DW_TAG_volatile_type
    1570                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$106)
    1571              
    1572              
    1573              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1574                      .dwattr $C$DW$T$30, DW_AT_name("CSM_REGS")
    1575                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    1576              $C$DW$107       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$107, DW_AT_name("KEY0")
    1579                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_KEY0")
    1580                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$108       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$108, DW_AT_name("KEY1")
    1586                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_KEY1")
    1587                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1588                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$109       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$109, DW_AT_name("KEY2")
    1593                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_KEY2")
    1594                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1595                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   32

    1596              
    1597              $C$DW$110       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$110, DW_AT_name("KEY3")
    1600                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_KEY3")
    1601                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1602                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$111       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$111, DW_AT_name("KEY4")
    1607                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_KEY4")
    1608                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1609                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1610              
    1611              $C$DW$112       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$112, DW_AT_name("KEY5")
    1614                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_KEY5")
    1615                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1616                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$113       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$113, DW_AT_name("KEY6")
    1621                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_KEY6")
    1622                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1623                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1624              
    1625              $C$DW$114       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$114, DW_AT_name("KEY7")
    1628                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_KEY7")
    1629                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1630                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$115       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$115, DW_AT_name("rsvd1")
    1635                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd1")
    1636                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1637                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1638              
    1639              $C$DW$116       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1641                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1642                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    1643                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1644                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$117       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1648                      .dwattr $C$DW$117, DW_AT_name("rsvd3")
    1649                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd3")
    1650                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   33

    1651                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$118       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$118, DW_AT_name("rsvd4")
    1656                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd4")
    1657                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1658                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$119       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$119, DW_AT_name("rsvd5")
    1663                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd5")
    1664                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1665                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$120       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$120, DW_AT_name("rsvd6")
    1670                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd6")
    1671                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1672                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$121       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$121, DW_AT_name("rsvd7")
    1677                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd7")
    1678                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1679                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$122       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$28)
    1683                      .dwattr $C$DW$122, DW_AT_name("CSMSCR")
    1684                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CSMSCR")
    1685                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1686                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688                      .dwendtag $C$DW$T$30
    1689              
    1690              $C$DW$123       .dwtag  DW_TAG_TI_far_type
    1691                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$30)
    1692              
    1693              $C$DW$T$92      .dwtag  DW_TAG_volatile_type
    1694                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$123)
    1695              
    1696              
    1697              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1698                      .dwattr $C$DW$T$31, DW_AT_name("FACTIVEWAIT_BITS")
    1699                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1700              $C$DW$124       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$124, DW_AT_name("ACTIVEWAIT")
    1703                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ACTIVEWAIT")
    1704                      .dwattr $C$DW$124, DW_AT_bit_offset(0x07)
    1705                      .dwattr $C$DW$124, DW_AT_bit_size(0x09)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   34

    1706                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$125       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$125, DW_AT_name("rsvd")
    1712                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd")
    1713                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1714                      .dwattr $C$DW$125, DW_AT_bit_size(0x07)
    1715                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718                      .dwendtag $C$DW$T$31
    1719              
    1720              
    1721              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1722                      .dwattr $C$DW$T$32, DW_AT_name("FACTIVEWAIT_REG")
    1723                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1724              $C$DW$126       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$126, DW_AT_name("all")
    1727                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1728                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$127       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$31)
    1733                      .dwattr $C$DW$127, DW_AT_name("bit")
    1734                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1735                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1737              
    1738                      .dwendtag $C$DW$T$32
    1739              
    1740              
    1741              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1742                      .dwattr $C$DW$T$33, DW_AT_name("FBANKWAIT_BITS")
    1743                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1744              $C$DW$128       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$128, DW_AT_name("RANDWAIT")
    1747                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RANDWAIT")
    1748                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1749                      .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    1750                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$129       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1755                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    1756                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    1757                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08)
    1758                      .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    1759                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   35

    1761              
    1762              $C$DW$130       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1764                      .dwattr $C$DW$130, DW_AT_name("PAGEWAIT")
    1765                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PAGEWAIT")
    1766                      .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1767                      .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1768                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1770              
    1771              $C$DW$131       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1773                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1774                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1775                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1776                      .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    1777                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780                      .dwendtag $C$DW$T$33
    1781              
    1782              
    1783              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1784                      .dwattr $C$DW$T$34, DW_AT_name("FBANKWAIT_REG")
    1785                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1786              $C$DW$132       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$132, DW_AT_name("all")
    1789                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    1790                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$133       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
    1795                      .dwattr $C$DW$133, DW_AT_name("bit")
    1796                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    1797                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800                      .dwendtag $C$DW$T$34
    1801              
    1802              
    1803              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1804                      .dwattr $C$DW$T$35, DW_AT_name("FLASH_REGS")
    1805                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    1806              $C$DW$134       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$37)
    1808                      .dwattr $C$DW$134, DW_AT_name("FOPT")
    1809                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_FOPT")
    1810                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1812              
    1813              $C$DW$135       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1815                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   36

    1816                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1817                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1818                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1819              
    1820              $C$DW$136       .dwtag  DW_TAG_member
    1821                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$41)
    1822                      .dwattr $C$DW$136, DW_AT_name("FPWR")
    1823                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_FPWR")
    1824                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1825                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1826              
    1827              $C$DW$137       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$43)
    1829                      .dwattr $C$DW$137, DW_AT_name("FSTATUS")
    1830                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_FSTATUS")
    1831                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1832                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1833              
    1834              $C$DW$138       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$45)
    1836                      .dwattr $C$DW$138, DW_AT_name("FSTDBYWAIT")
    1837                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1838                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1839                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$139       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$32)
    1843                      .dwattr $C$DW$139, DW_AT_name("FACTIVEWAIT")
    1844                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1845                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1846                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1847              
    1848              $C$DW$140       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$34)
    1850                      .dwattr $C$DW$140, DW_AT_name("FBANKWAIT")
    1851                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_FBANKWAIT")
    1852                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1853                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1854              
    1855              $C$DW$141       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$39)
    1857                      .dwattr $C$DW$141, DW_AT_name("FOTPWAIT")
    1858                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_FOTPWAIT")
    1859                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1860                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1861              
    1862                      .dwendtag $C$DW$T$35
    1863              
    1864              $C$DW$142       .dwtag  DW_TAG_TI_far_type
    1865                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$35)
    1866              
    1867              $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    1868                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$142)
    1869              
    1870              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   37

    1871              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1872                      .dwattr $C$DW$T$36, DW_AT_name("FOPT_BITS")
    1873                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1874              $C$DW$143       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$143, DW_AT_name("ENPIPE")
    1877                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ENPIPE")
    1878                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f)
    1879                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1880                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1882              
    1883              $C$DW$144       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1885                      .dwattr $C$DW$144, DW_AT_name("rsvd")
    1886                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd")
    1887                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    1888                      .dwattr $C$DW$144, DW_AT_bit_size(0x0f)
    1889                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892                      .dwendtag $C$DW$T$36
    1893              
    1894              
    1895              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1896                      .dwattr $C$DW$T$37, DW_AT_name("FOPT_REG")
    1897                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1898              $C$DW$145       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1900                      .dwattr $C$DW$145, DW_AT_name("all")
    1901                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    1902                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1904              
    1905              $C$DW$146       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$36)
    1907                      .dwattr $C$DW$146, DW_AT_name("bit")
    1908                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    1909                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912                      .dwendtag $C$DW$T$37
    1913              
    1914              
    1915              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1916                      .dwattr $C$DW$T$38, DW_AT_name("FOTPWAIT_BITS")
    1917                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1918              $C$DW$147       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$147, DW_AT_name("OTPWAIT")
    1921                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_OTPWAIT")
    1922                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b)
    1923                      .dwattr $C$DW$147, DW_AT_bit_size(0x05)
    1924                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   38

    1926              
    1927              $C$DW$148       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$148, DW_AT_name("rsvd")
    1930                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd")
    1931                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00)
    1932                      .dwattr $C$DW$148, DW_AT_bit_size(0x0b)
    1933                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936                      .dwendtag $C$DW$T$38
    1937              
    1938              
    1939              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1940                      .dwattr $C$DW$T$39, DW_AT_name("FOTPWAIT_REG")
    1941                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1942              $C$DW$149       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1944                      .dwattr $C$DW$149, DW_AT_name("all")
    1945                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1946                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$150       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$38)
    1951                      .dwattr $C$DW$150, DW_AT_name("bit")
    1952                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1953                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956                      .dwendtag $C$DW$T$39
    1957              
    1958              
    1959              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1960                      .dwattr $C$DW$T$40, DW_AT_name("FPWR_BITS")
    1961                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1962              $C$DW$151       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$151, DW_AT_name("PWR")
    1965                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PWR")
    1966                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e)
    1967                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    1968                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$152       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$152, DW_AT_name("rsvd")
    1974                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd")
    1975                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    1976                      .dwattr $C$DW$152, DW_AT_bit_size(0x0e)
    1977                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1979              
    1980                      .dwendtag $C$DW$T$40
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   39

    1981              
    1982              
    1983              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1984                      .dwattr $C$DW$T$41, DW_AT_name("FPWR_REG")
    1985                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1986              $C$DW$153       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1988                      .dwattr $C$DW$153, DW_AT_name("all")
    1989                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    1990                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993              $C$DW$154       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$40)
    1995                      .dwattr $C$DW$154, DW_AT_name("bit")
    1996                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    1997                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1999              
    2000                      .dwendtag $C$DW$T$41
    2001              
    2002              
    2003              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2004                      .dwattr $C$DW$T$42, DW_AT_name("FSTATUS_BITS")
    2005                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2006              $C$DW$155       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$155, DW_AT_name("PWRS")
    2009                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PWRS")
    2010                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e)
    2011                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2012                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2014              
    2015              $C$DW$156       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2017                      .dwattr $C$DW$156, DW_AT_name("STDBYWAITS")
    2018                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_STDBYWAITS")
    2019                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d)
    2020                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2021                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2023              
    2024              $C$DW$157       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2026                      .dwattr $C$DW$157, DW_AT_name("ACTIVEWAITS")
    2027                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACTIVEWAITS")
    2028                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c)
    2029                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2030                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$158       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$158, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   40

    2036                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd1")
    2037                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08)
    2038                      .dwattr $C$DW$158, DW_AT_bit_size(0x04)
    2039                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2041              
    2042              $C$DW$159       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$159, DW_AT_name("V3STAT")
    2045                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_V3STAT")
    2046                      .dwattr $C$DW$159, DW_AT_bit_offset(0x07)
    2047                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2048                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2049                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2050              
    2051              $C$DW$160       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2053                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
    2054                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    2055                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    2056                      .dwattr $C$DW$160, DW_AT_bit_size(0x07)
    2057                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2059              
    2060                      .dwendtag $C$DW$T$42
    2061              
    2062              
    2063              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2064                      .dwattr $C$DW$T$43, DW_AT_name("FSTATUS_REG")
    2065                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2066              $C$DW$161       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$161, DW_AT_name("all")
    2069                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    2070                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2071                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2072              
    2073              $C$DW$162       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$42)
    2075                      .dwattr $C$DW$162, DW_AT_name("bit")
    2076                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    2077                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2079              
    2080                      .dwendtag $C$DW$T$43
    2081              
    2082              
    2083              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2084                      .dwattr $C$DW$T$44, DW_AT_name("FSTDBYWAIT_BITS")
    2085                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2086              $C$DW$163       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2088                      .dwattr $C$DW$163, DW_AT_name("STDBYWAIT")
    2089                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_STDBYWAIT")
    2090                      .dwattr $C$DW$163, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   41

    2091                      .dwattr $C$DW$163, DW_AT_bit_size(0x09)
    2092                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2094              
    2095              $C$DW$164       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2097                      .dwattr $C$DW$164, DW_AT_name("rsvd")
    2098                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd")
    2099                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    2100                      .dwattr $C$DW$164, DW_AT_bit_size(0x07)
    2101                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2103              
    2104                      .dwendtag $C$DW$T$44
    2105              
    2106              
    2107              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2108                      .dwattr $C$DW$T$45, DW_AT_name("FSTDBYWAIT_REG")
    2109                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2110              $C$DW$165       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$165, DW_AT_name("all")
    2113                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    2114                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2116              
    2117              $C$DW$166       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$44)
    2119                      .dwattr $C$DW$166, DW_AT_name("bit")
    2120                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    2121                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2123              
    2124                      .dwendtag $C$DW$T$45
    2125              
    2126              
    2127              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2128                      .dwattr $C$DW$T$46, DW_AT_name("GPA1_BITS")
    2129                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2130              $C$DW$167       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2132                      .dwattr $C$DW$167, DW_AT_name("GPIO0")
    2133                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO0")
    2134                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e)
    2135                      .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    2136                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2138              
    2139              $C$DW$168       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2141                      .dwattr $C$DW$168, DW_AT_name("GPIO1")
    2142                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO1")
    2143                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0c)
    2144                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2145                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   42

    2146                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2147              
    2148              $C$DW$169       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$169, DW_AT_name("GPIO2")
    2151                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO2")
    2152                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0a)
    2153                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    2154                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2156              
    2157              $C$DW$170       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$170, DW_AT_name("GPIO3")
    2160                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO3")
    2161                      .dwattr $C$DW$170, DW_AT_bit_offset(0x08)
    2162                      .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    2163                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166              $C$DW$171       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$171, DW_AT_name("GPIO4")
    2169                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO4")
    2170                      .dwattr $C$DW$171, DW_AT_bit_offset(0x06)
    2171                      .dwattr $C$DW$171, DW_AT_bit_size(0x02)
    2172                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2174              
    2175              $C$DW$172       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2177                      .dwattr $C$DW$172, DW_AT_name("GPIO5")
    2178                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO5")
    2179                      .dwattr $C$DW$172, DW_AT_bit_offset(0x04)
    2180                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    2181                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2183              
    2184              $C$DW$173       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2186                      .dwattr $C$DW$173, DW_AT_name("GPIO6")
    2187                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO6")
    2188                      .dwattr $C$DW$173, DW_AT_bit_offset(0x02)
    2189                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2190                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193              $C$DW$174       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2195                      .dwattr $C$DW$174, DW_AT_name("GPIO7")
    2196                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO7")
    2197                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2198                      .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2199                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   43

    2201              
    2202              $C$DW$175       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2204                      .dwattr $C$DW$175, DW_AT_name("GPIO8")
    2205                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO8")
    2206                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0e)
    2207                      .dwattr $C$DW$175, DW_AT_bit_size(0x02)
    2208                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2209                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2210              
    2211              $C$DW$176       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2213                      .dwattr $C$DW$176, DW_AT_name("GPIO9")
    2214                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO9")
    2215                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0c)
    2216                      .dwattr $C$DW$176, DW_AT_bit_size(0x02)
    2217                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2218                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2219              
    2220              $C$DW$177       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$177, DW_AT_name("GPIO10")
    2223                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO10")
    2224                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0a)
    2225                      .dwattr $C$DW$177, DW_AT_bit_size(0x02)
    2226                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2227                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229              $C$DW$178       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$178, DW_AT_name("GPIO11")
    2232                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO11")
    2233                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08)
    2234                      .dwattr $C$DW$178, DW_AT_bit_size(0x02)
    2235                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2236                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2237              
    2238              $C$DW$179       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2240                      .dwattr $C$DW$179, DW_AT_name("GPIO12")
    2241                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO12")
    2242                      .dwattr $C$DW$179, DW_AT_bit_offset(0x06)
    2243                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2244                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2245                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2246              
    2247              $C$DW$180       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2249                      .dwattr $C$DW$180, DW_AT_name("GPIO13")
    2250                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO13")
    2251                      .dwattr $C$DW$180, DW_AT_bit_offset(0x04)
    2252                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2253                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2254                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2255              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{31C1AC2A-9DF2-49FD-82E3-4EC1724EAAB9} PAGE   44

    2256              $C$DW$181       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$181, DW_AT_name("GPIO14")
    2259                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO14")
    2260                      .dwattr $C$DW$181, DW_AT_bit_offset(0x02)
    2261                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2262                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2263                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265              $C$DW$182       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$182, DW_AT_name("GPIO15")
    2268                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO15")
    2269                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2270                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
