TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.12 *
       3              ;* Date/Time created: Thu Nov 16 10:01:32 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=on --mem_model
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/DSP2803x_SWPrioritizedDefaultIsr.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.12 Copyright (c) 1996-2017 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\TI_CCS_Workspace\EPWMSync\KT1205_MGI_V8.5_REVC_MASTER_GPRS_17111
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("PieCtrlRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$31)

    4377                      .dwattr $C$DW$122, DW_AT_TI_begin_line(0x110)
    4378                      .dwattr $C$DW$122, DW_AT_TI_begin_column(0x12)
    4379                      .dwattr $C$DW$122, DW_AT_TI_interrupt
    4380                      .dwattr $C$DW$122, DW_AT_TI_max_frame_size(-4)
    4381                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 273,column 1,is_stmt,address _ADCINT
    4382              
    4383                      .dwfde $C$DW$CIE, _ADCINT1_ISR
    4384              
    4385              ;***************************************************************
    4386              ;* FNAME: _ADCINT1_ISR                  FR SIZE:   2           *
    4387              ;*                                                             *
    4388              ;* FUNCTION ENVIRONMENT                                        *
    4389              ;*                                                             *
    4390              ;* FUNCTION PROPERTIES                                         *
    4391              ;*                            0 Parameter,  1 Auto,  0 SOE     *
    4392              ;***************************************************************
    4393              
    4394              _ADCINT1_ISR:
    4395              $C$DW$123       .dwtag  DW_TAG_variable, DW_AT_name("TempPIEIER")
    4396                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_TempPIEIER")
    4397                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$33)
    4398                      .dwattr $C$DW$123, DW_AT_location[DW_OP_breg20 -1]
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   85

    4399                      .dwcfi  cfa_offset, -2
    4400                      .dwcfi  save_reg_to_mem, 26, 0
    4401 000004ab 761B          ASP       ; [CPU_] 
    4402 000004ac FE02          ADDB      SP,#2                 ; [CPU_U] 
    4403                      .dwcfi  cfa_offset, -4
    4404 000004ad 2942          CLRC      PAGE0,OVM             ; [CPU_] 
    4405 000004ae 5616          CLRC      AMODE                 ; [CPU_] 
    4406 000004af 761F!         MOVW      DP,#_PieCtrlRegs+2    ; [CPU_U] 
         000004b0 0000 
    4407                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 275,column 29,is_stmt,isa 0
    4408 000004b1 9202!         MOV       AL,@_PieCtrlRegs+2    ; [CPU_] |275| 
    4409 000004b2 9641          MOV       *-SP[1],AL            ; [CPU_] |275| 
    4410                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 276,column 2,is_stmt,isa 0
    4411 000004b3 7623          OR        IER,#0x0001           ; [CPU_] |276| 
         000004b4 0001 
    4412                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 277,column 2,is_stmt,isa 0
    4413 000004b5 7626          AND       IER,#0x0003           ; [CPU_] |277| 
         000004b6 0003 
    4414                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 278,column 2,is_stmt,isa 0
    4415 000004b7 1802!         AND       @_PieCtrlRegs+2,#0x00fa ; [CPU_] |278| 
         000004b8 00FA 
    4416                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 279,column 2,is_stmt,isa 0
    4417 000004b9 2801!         MOV       @_PieCtrlRegs+1,#65535 ; [CPU_] |279| 
         000004ba FFFF 
    4418 000004bb 2910   clrc INTM
    4419 000004bc 3B10   setc INTM
    4420                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 286,column 2,is_stmt,isa 0
    4421 000004bd 9241          MOV       AL,*-SP[1]            ; [CPU_] |286| 
    4422 000004be 9602!         MOV       @_PieCtrlRegs+2,AL    ; [CPU_] |286| 
    4423 000004bf 7625        ESTOP0
    4424 000004c0       $C$L72:    
    4425                      .dwpsn  file "../source/DSP2803x_SWPrioritizedDefaultIsr.c",line 291,column 5,is_stmt,isa 0
    4426 000004c0 6F00          B         $C$L72,UNC            ; [CPU_] |291| 
    4427                      ; branch occurs ; [] |291| 
    4428                      .dwattr $C$DW$122, DW_AT_TI_end_file("../source/DSP2803x_SWPrioritizedDefaultIsr.c")
    4429                      .dwattr $C$DW$122, DW_AT_TI_end_line(0x125)
    4430                      .dwattr $C$DW$122, DW_AT_TI_end_column(0x01)
    4431                      .dwendentry
    4432                      .dwendtag $C$DW$122
    4433              
    4434              ;**************************************************************
    4435              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4436              ;**************************************************************
    4437                      .global _PieCtrlRegs
    4438              
    4439              ;***************************************************************
    4440              ;* TYPE INFORMATION                                            *
    4441              ;***************************************************************
    4442              
    4443              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4444                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    4445                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    4446              $C$DW$124       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    4448                      .dwattr $C$DW$124, DW_AT_name("ACK1")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   86

    4449                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ACK1")
    4450                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4451                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4452                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    4453              $C$DW$125       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    4455                      .dwattr $C$DW$125, DW_AT_name("ACK2")
    4456                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ACK2")
    4457                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4458                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4459                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    4460              $C$DW$126       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    4462                      .dwattr $C$DW$126, DW_AT_name("ACK3")
    4463                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ACK3")
    4464                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4465                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4466                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$127       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    4469                      .dwattr $C$DW$127, DW_AT_name("ACK4")
    4470                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ACK4")
    4471                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4472                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4473                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    4474              $C$DW$128       .dwtag  DW_TAG_member
    4475                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    4476                      .dwattr $C$DW$128, DW_AT_name("ACK5")
    4477                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ACK5")
    4478                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4479                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4480                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    4481              $C$DW$129       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    4483                      .dwattr $C$DW$129, DW_AT_name("ACK6")
    4484                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ACK6")
    4485                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4486                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4487                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$130       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    4490                      .dwattr $C$DW$130, DW_AT_name("ACK7")
    4491                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ACK7")
    4492                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4493                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4494                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    4495              $C$DW$131       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    4497                      .dwattr $C$DW$131, DW_AT_name("ACK8")
    4498                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ACK8")
    4499                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4500                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4501                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    4502              $C$DW$132       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   87

    4504                      .dwattr $C$DW$132, DW_AT_name("ACK9")
    4505                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ACK9")
    4506                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4507                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4508                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    4509              $C$DW$133       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    4511                      .dwattr $C$DW$133, DW_AT_name("ACK10")
    4512                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ACK10")
    4513                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4514                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4515                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    4516              $C$DW$134       .dwtag  DW_TAG_member
    4517                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    4518                      .dwattr $C$DW$134, DW_AT_name("ACK11")
    4519                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ACK11")
    4520                      .dwattr $C$DW$134, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4521                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4522                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$135       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    4525                      .dwattr $C$DW$135, DW_AT_name("ACK12")
    4526                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ACK12")
    4527                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4528                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4529                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$136       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    4532                      .dwattr $C$DW$136, DW_AT_name("rsvd")
    4533                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd")
    4534                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    4535                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4536                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    4537                      .dwendtag $C$DW$T$20
    4538              
    4539              
    4540              $C$DW$T$21      .dwtag  DW_TAG_union_type
    4541                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    4542                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    4543              $C$DW$137       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    4545                      .dwattr $C$DW$137, DW_AT_name("all")
    4546                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    4547                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4548                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$138       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    4551                      .dwattr $C$DW$138, DW_AT_name("bit")
    4552                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    4553                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4554                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    4555                      .dwendtag $C$DW$T$21
    4556              
    4557              
    4558              $C$DW$T$22      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   88

    4559                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    4560                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    4561              $C$DW$139       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    4563                      .dwattr $C$DW$139, DW_AT_name("ENPIE")
    4564                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ENPIE")
    4565                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4566                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4567                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    4568              $C$DW$140       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    4570                      .dwattr $C$DW$140, DW_AT_name("PIEVECT")
    4571                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEVECT")
    4572                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4573                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4574                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    4575                      .dwendtag $C$DW$T$22
    4576              
    4577              
    4578              $C$DW$T$23      .dwtag  DW_TAG_union_type
    4579                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    4580                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4581              $C$DW$141       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    4583                      .dwattr $C$DW$141, DW_AT_name("all")
    4584                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    4585                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4586                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    4587              $C$DW$142       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    4589                      .dwattr $C$DW$142, DW_AT_name("bit")
    4590                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    4591                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4592                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    4593                      .dwendtag $C$DW$T$23
    4594              
    4595              
    4596              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4597                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
    4598                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4599              $C$DW$143       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    4601                      .dwattr $C$DW$143, DW_AT_name("INTx1")
    4602                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_INTx1")
    4603                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4604                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4605                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    4606              $C$DW$144       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    4608                      .dwattr $C$DW$144, DW_AT_name("INTx2")
    4609                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_INTx2")
    4610                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4611                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4612                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$145       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   89

    4614                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    4615                      .dwattr $C$DW$145, DW_AT_name("INTx3")
    4616                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_INTx3")
    4617                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4618                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4619                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    4620              $C$DW$146       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    4622                      .dwattr $C$DW$146, DW_AT_name("INTx4")
    4623                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_INTx4")
    4624                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4625                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4626                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    4627              $C$DW$147       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    4629                      .dwattr $C$DW$147, DW_AT_name("INTx5")
    4630                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_INTx5")
    4631                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4632                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4633                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    4634              $C$DW$148       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    4636                      .dwattr $C$DW$148, DW_AT_name("INTx6")
    4637                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_INTx6")
    4638                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4639                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4640                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    4641              $C$DW$149       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    4643                      .dwattr $C$DW$149, DW_AT_name("INTx7")
    4644                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_INTx7")
    4645                      .dwattr $C$DW$149, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4646                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4647                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    4648              $C$DW$150       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    4650                      .dwattr $C$DW$150, DW_AT_name("INTx8")
    4651                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_INTx8")
    4652                      .dwattr $C$DW$150, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4653                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4654                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    4655              $C$DW$151       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    4657                      .dwattr $C$DW$151, DW_AT_name("rsvd")
    4658                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd")
    4659                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4660                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4661                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4662                      .dwendtag $C$DW$T$24
    4663              
    4664              
    4665              $C$DW$T$25      .dwtag  DW_TAG_union_type
    4666                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
    4667                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4668              $C$DW$152       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   90

    4669                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    4670                      .dwattr $C$DW$152, DW_AT_name("all")
    4671                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    4672                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4673                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4674              $C$DW$153       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$24)
    4676                      .dwattr $C$DW$153, DW_AT_name("bit")
    4677                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    4678                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4679                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4680                      .dwendtag $C$DW$T$25
    4681              
    4682              
    4683              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4684                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
    4685                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4686              $C$DW$154       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    4688                      .dwattr $C$DW$154, DW_AT_name("INTx1")
    4689                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INTx1")
    4690                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4691                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4692                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$155       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    4695                      .dwattr $C$DW$155, DW_AT_name("INTx2")
    4696                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_INTx2")
    4697                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4698                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4699                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4700              $C$DW$156       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    4702                      .dwattr $C$DW$156, DW_AT_name("INTx3")
    4703                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_INTx3")
    4704                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4705                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4706                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$157       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    4709                      .dwattr $C$DW$157, DW_AT_name("INTx4")
    4710                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_INTx4")
    4711                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4712                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4713                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4714              $C$DW$158       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    4716                      .dwattr $C$DW$158, DW_AT_name("INTx5")
    4717                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_INTx5")
    4718                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4719                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4720                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4721              $C$DW$159       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    4723                      .dwattr $C$DW$159, DW_AT_name("INTx6")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   91

    4724                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_INTx6")
    4725                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4726                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4727                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4728              $C$DW$160       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    4730                      .dwattr $C$DW$160, DW_AT_name("INTx7")
    4731                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_INTx7")
    4732                      .dwattr $C$DW$160, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4733                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4734                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4735              $C$DW$161       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    4737                      .dwattr $C$DW$161, DW_AT_name("INTx8")
    4738                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_INTx8")
    4739                      .dwattr $C$DW$161, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4740                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4741                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4742              $C$DW$162       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    4744                      .dwattr $C$DW$162, DW_AT_name("rsvd")
    4745                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd")
    4746                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4747                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4748                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4749                      .dwendtag $C$DW$T$26
    4750              
    4751              
    4752              $C$DW$T$27      .dwtag  DW_TAG_union_type
    4753                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
    4754                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4755              $C$DW$163       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    4757                      .dwattr $C$DW$163, DW_AT_name("all")
    4758                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    4759                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4760                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4761              $C$DW$164       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$26)
    4763                      .dwattr $C$DW$164, DW_AT_name("bit")
    4764                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    4765                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4766                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4767                      .dwendtag $C$DW$T$27
    4768              
    4769              
    4770              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4771                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
    4772                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
    4773              $C$DW$165       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    4775                      .dwattr $C$DW$165, DW_AT_name("PIECTRL")
    4776                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PIECTRL")
    4777                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   92

    4779              $C$DW$166       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    4781                      .dwattr $C$DW$166, DW_AT_name("PIEACK")
    4782                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PIEACK")
    4783                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4784                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4785              $C$DW$167       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$25)
    4787                      .dwattr $C$DW$167, DW_AT_name("PIEIER1")
    4788                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PIEIER1")
    4789                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4790                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4791              $C$DW$168       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    4793                      .dwattr $C$DW$168, DW_AT_name("PIEIFR1")
    4794                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PIEIFR1")
    4795                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4796                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4797              $C$DW$169       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$25)
    4799                      .dwattr $C$DW$169, DW_AT_name("PIEIER2")
    4800                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PIEIER2")
    4801                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4802                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4803              $C$DW$170       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    4805                      .dwattr $C$DW$170, DW_AT_name("PIEIFR2")
    4806                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PIEIFR2")
    4807                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4808                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4809              $C$DW$171       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$25)
    4811                      .dwattr $C$DW$171, DW_AT_name("PIEIER3")
    4812                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PIEIER3")
    4813                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4814                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4815              $C$DW$172       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    4817                      .dwattr $C$DW$172, DW_AT_name("PIEIFR3")
    4818                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PIEIFR3")
    4819                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4820                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4821              $C$DW$173       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$25)
    4823                      .dwattr $C$DW$173, DW_AT_name("PIEIER4")
    4824                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PIEIER4")
    4825                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4826                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4827              $C$DW$174       .dwtag  DW_TAG_member
    4828                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    4829                      .dwattr $C$DW$174, DW_AT_name("PIEIFR4")
    4830                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PIEIFR4")
    4831                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4832                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4833              $C$DW$175       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   93

    4834                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
    4835                      .dwattr $C$DW$175, DW_AT_name("PIEIER5")
    4836                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PIEIER5")
    4837                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4838                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$176       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    4841                      .dwattr $C$DW$176, DW_AT_name("PIEIFR5")
    4842                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PIEIFR5")
    4843                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4844                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$177       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$25)
    4847                      .dwattr $C$DW$177, DW_AT_name("PIEIER6")
    4848                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PIEIER6")
    4849                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4850                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$178       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    4853                      .dwattr $C$DW$178, DW_AT_name("PIEIFR6")
    4854                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PIEIFR6")
    4855                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4856                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$179       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$25)
    4859                      .dwattr $C$DW$179, DW_AT_name("PIEIER7")
    4860                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PIEIER7")
    4861                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4862                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    4863              $C$DW$180       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    4865                      .dwattr $C$DW$180, DW_AT_name("PIEIFR7")
    4866                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PIEIFR7")
    4867                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4868                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$181       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$25)
    4871                      .dwattr $C$DW$181, DW_AT_name("PIEIER8")
    4872                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PIEIER8")
    4873                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4874                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$182       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$27)
    4877                      .dwattr $C$DW$182, DW_AT_name("PIEIFR8")
    4878                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PIEIFR8")
    4879                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4880                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$183       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$25)
    4883                      .dwattr $C$DW$183, DW_AT_name("PIEIER9")
    4884                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PIEIER9")
    4885                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4886                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4887              $C$DW$184       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   94

    4889                      .dwattr $C$DW$184, DW_AT_name("PIEIFR9")
    4890                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PIEIFR9")
    4891                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4892                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4893              $C$DW$185       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$25)
    4895                      .dwattr $C$DW$185, DW_AT_name("PIEIER10")
    4896                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PIEIER10")
    4897                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4898                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4899              $C$DW$186       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    4901                      .dwattr $C$DW$186, DW_AT_name("PIEIFR10")
    4902                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PIEIFR10")
    4903                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4904                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4905              $C$DW$187       .dwtag  DW_TAG_member
    4906                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$25)
    4907                      .dwattr $C$DW$187, DW_AT_name("PIEIER11")
    4908                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PIEIER11")
    4909                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4910                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4911              $C$DW$188       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    4913                      .dwattr $C$DW$188, DW_AT_name("PIEIFR11")
    4914                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PIEIFR11")
    4915                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4916                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4917              $C$DW$189       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$25)
    4919                      .dwattr $C$DW$189, DW_AT_name("PIEIER12")
    4920                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PIEIER12")
    4921                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4922                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4923              $C$DW$190       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    4925                      .dwattr $C$DW$190, DW_AT_name("PIEIFR12")
    4926                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PIEIFR12")
    4927                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4928                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4929                      .dwendtag $C$DW$T$28
    4930              
    4931              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    4932                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$28)
    4933              $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    4934                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$191)
    4935              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4936                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4937              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4938                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4939                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4940                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4941              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4942                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4943                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
TMS320C2000 Assembler PC v6.4.12 Thu Nov 16 10:01:32 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0610810                            PAGE   95

    4944                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4945              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4946                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4947                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4948                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4949              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4950                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4951                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4952                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4953              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4954                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4955                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4956                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4957              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4958                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4959                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4960                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4961              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4962                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4963                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4964                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4965              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4966                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4967                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4968                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4969              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    4970                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    4971                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4972              $C$DW$192       .dwtag  DW_TAG_TI_far_type
    4973                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    4974              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    4975                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$192)
    4976              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4977                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4978                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4979                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4980              $C$DW$T$13      .dwtag  DW_TAG_base_type
