TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:41 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/RS485_GPRS_Sync.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

         0000014d 0065 
         0000014e 0074 
         0000014f 0065 
         00000150 002C 
         00000151 004B 
         00000152 0054 
         00000153 0031 
         00000154 0037 
         00000155 002C 
         00000156 0000 
         00000157 0000 
    9107                      .align  2
    9108 00000158 0041  $C$FSL17:       .string "AT+HTTPDATA=192,2000",13,10,0,0
         00000159 0054 
         0000015a 002B 
         0000015b 0048 
         0000015c 0054 
         0000015d 0054 
         0000015e 0050 
         0000015f 0044 
         00000160 0041 
         00000161 0054 
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  194

         00000162 0041 
         00000163 003D 
         00000164 0031 
         00000165 0039 
         00000166 0032 
         00000167 002C 
         00000168 0032 
         00000169 0030 
         0000016a 0030 
         0000016b 0030 
         0000016c 000D 
         0000016d 000A 
         0000016e 0000 
         0000016f 0000 
    9109                      .align  2
    9110 00000170 0041  $C$FSL18:       .string "AT+HTTPACTION=1",13,10,0,0
         00000171 0054 
         00000172 002B 
         00000173 0048 
         00000174 0054 
         00000175 0054 
         00000176 0050 
         00000177 0041 
         00000178 0043 
         00000179 0054 
         0000017a 0049 
         0000017b 004F 
         0000017c 004E 
         0000017d 003D 
         0000017e 0031 
         0000017f 000D 
         00000180 000A 
         00000181 0000 
         00000182 0000 
    9111                      .align  2
    9112 00000184 0041  $C$FSL19:       .string "AT+HTTPREAD",13,10,0,0
         00000185 0054 
         00000186 002B 
         00000187 0048 
         00000188 0054 
         00000189 0054 
         0000018a 0050 
         0000018b 0052 
         0000018c 0045 
         0000018d 0041 
         0000018e 0044 
         0000018f 000D 
         00000190 000A 
         00000191 0000 
         00000192 0000 
    9113                      .align  2
    9114 00000194 0041  $C$FSL20:       .string "AT+HTTPTERM",13,10,0,0
         00000195 0054 
         00000196 002B 
         00000197 0048 
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  195

         00000198 0054 
         00000199 0054 
         0000019a 0050 
         0000019b 0054 
         0000019c 0045 
         0000019d 0052 
         0000019e 004D 
         0000019f 000D 
         000001a0 000A 
         000001a1 0000 
         000001a2 0000 
    9115                      .align  2
    9116 000001a4 000D  $C$FSL21:       .string 13,10,0,0
         000001a5 000A 
         000001a6 0000 
         000001a7 0000 
    9117                      .align  2
    9118 000001a8 0041  $C$FSL22:       .string "AT+CFUN=1,1",13,10,0,0
         000001a9 0054 
         000001aa 002B 
         000001ab 0043 
         000001ac 0046 
         000001ad 0055 
         000001ae 004E 
         000001af 003D 
         000001b0 0031 
         000001b1 002C 
         000001b2 0031 
         000001b3 000D 
         000001b4 000A 
         000001b5 0000 
         000001b6 0000 
    9119              ;**************************************************************
    9120              ;* UNDEFINED EXTERNAL REFERENCES                              *
    9121              ;**************************************************************
    9122                      .global _peakGridVoltage
    9123                      .global _peakInverterOutputCurrent
    9124                      .global _pvPanelVoltage
    9125                      .global _flybackCurrent1
    9126                      .global _storeFaultState
    9127                      .global _peakInverterOutputVoltage
    9128                      .global _systemState
    9129                      .global _gridFlag
    9130                      .global _measuredTemperature
    9131                      .global _my_Irms_q15_result
    9132                      .global _SciaRegs
    9133                      .global _PieCtrlRegs
    9134                      .global _GpioDataRegs
    9135                      .global ULL$$CMP
    9136                      .global _prolog_c28x_1
    9137                      .global _prolog_c28x_2
    9138                      .global _prolog_c28x_3
    9139                      .global _abstract_func1_c28x
    9140                      .global _abstract_func2_c28x
    9141                      .global _epilog_c28x_1
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  196

    9142                      .global _epilog_c28x_2
    9143              
    9144              ;***************************************************************
    9145              ;* TYPE INFORMATION                                            *
    9146              ;***************************************************************
    9147              
    9148              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9149                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
    9150                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    9151              $C$DW$382       .dwtag  DW_TAG_member
    9152                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    9153                      .dwattr $C$DW$382, DW_AT_name("rsvd1")
    9154                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd1")
    9155                      .dwattr $C$DW$382, DW_AT_bit_offset(0x0f)
    9156                      .dwattr $C$DW$382, DW_AT_bit_size(0x01)
    9157                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9158                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    9159              
    9160              $C$DW$383       .dwtag  DW_TAG_member
    9161                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    9162                      .dwattr $C$DW$383, DW_AT_name("rsvd2")
    9163                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd2")
    9164                      .dwattr $C$DW$383, DW_AT_bit_offset(0x0e)
    9165                      .dwattr $C$DW$383, DW_AT_bit_size(0x01)
    9166                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9167                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    9168              
    9169              $C$DW$384       .dwtag  DW_TAG_member
    9170                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    9171                      .dwattr $C$DW$384, DW_AT_name("AIO2")
    9172                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_AIO2")
    9173                      .dwattr $C$DW$384, DW_AT_bit_offset(0x0d)
    9174                      .dwattr $C$DW$384, DW_AT_bit_size(0x01)
    9175                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9176                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    9177              
    9178              $C$DW$385       .dwtag  DW_TAG_member
    9179                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    9180                      .dwattr $C$DW$385, DW_AT_name("rsvd3")
    9181                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd3")
    9182                      .dwattr $C$DW$385, DW_AT_bit_offset(0x0c)
    9183                      .dwattr $C$DW$385, DW_AT_bit_size(0x01)
    9184                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9185                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    9186              
    9187              $C$DW$386       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    9189                      .dwattr $C$DW$386, DW_AT_name("AIO4")
    9190                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_AIO4")
    9191                      .dwattr $C$DW$386, DW_AT_bit_offset(0x0b)
    9192                      .dwattr $C$DW$386, DW_AT_bit_size(0x01)
    9193                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9194                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    9195              
    9196              $C$DW$387       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  197

    9197                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    9198                      .dwattr $C$DW$387, DW_AT_name("rsvd4")
    9199                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd4")
    9200                      .dwattr $C$DW$387, DW_AT_bit_offset(0x0a)
    9201                      .dwattr $C$DW$387, DW_AT_bit_size(0x01)
    9202                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9203                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    9204              
    9205              $C$DW$388       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    9207                      .dwattr $C$DW$388, DW_AT_name("AIO6")
    9208                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_AIO6")
    9209                      .dwattr $C$DW$388, DW_AT_bit_offset(0x09)
    9210                      .dwattr $C$DW$388, DW_AT_bit_size(0x01)
    9211                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9212                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    9213              
    9214              $C$DW$389       .dwtag  DW_TAG_member
    9215                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    9216                      .dwattr $C$DW$389, DW_AT_name("rsvd5")
    9217                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd5")
    9218                      .dwattr $C$DW$389, DW_AT_bit_offset(0x08)
    9219                      .dwattr $C$DW$389, DW_AT_bit_size(0x01)
    9220                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9221                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    9222              
    9223              $C$DW$390       .dwtag  DW_TAG_member
    9224                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    9225                      .dwattr $C$DW$390, DW_AT_name("rsvd6")
    9226                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_rsvd6")
    9227                      .dwattr $C$DW$390, DW_AT_bit_offset(0x07)
    9228                      .dwattr $C$DW$390, DW_AT_bit_size(0x01)
    9229                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9230                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    9231              
    9232              $C$DW$391       .dwtag  DW_TAG_member
    9233                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    9234                      .dwattr $C$DW$391, DW_AT_name("rsvd7")
    9235                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd7")
    9236                      .dwattr $C$DW$391, DW_AT_bit_offset(0x06)
    9237                      .dwattr $C$DW$391, DW_AT_bit_size(0x01)
    9238                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9239                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    9240              
    9241              $C$DW$392       .dwtag  DW_TAG_member
    9242                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    9243                      .dwattr $C$DW$392, DW_AT_name("AIO10")
    9244                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_AIO10")
    9245                      .dwattr $C$DW$392, DW_AT_bit_offset(0x05)
    9246                      .dwattr $C$DW$392, DW_AT_bit_size(0x01)
    9247                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9248                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    9249              
    9250              $C$DW$393       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  198

    9252                      .dwattr $C$DW$393, DW_AT_name("rsvd8")
    9253                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rsvd8")
    9254                      .dwattr $C$DW$393, DW_AT_bit_offset(0x04)
    9255                      .dwattr $C$DW$393, DW_AT_bit_size(0x01)
    9256                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9257                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    9258              
    9259              $C$DW$394       .dwtag  DW_TAG_member
    9260                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    9261                      .dwattr $C$DW$394, DW_AT_name("AIO12")
    9262                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_AIO12")
    9263                      .dwattr $C$DW$394, DW_AT_bit_offset(0x03)
    9264                      .dwattr $C$DW$394, DW_AT_bit_size(0x01)
    9265                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9266                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    9267              
    9268              $C$DW$395       .dwtag  DW_TAG_member
    9269                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    9270                      .dwattr $C$DW$395, DW_AT_name("rsvd9")
    9271                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rsvd9")
    9272                      .dwattr $C$DW$395, DW_AT_bit_offset(0x02)
    9273                      .dwattr $C$DW$395, DW_AT_bit_size(0x01)
    9274                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9275                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    9276              
    9277              $C$DW$396       .dwtag  DW_TAG_member
    9278                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    9279                      .dwattr $C$DW$396, DW_AT_name("AIO14")
    9280                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_AIO14")
    9281                      .dwattr $C$DW$396, DW_AT_bit_offset(0x01)
    9282                      .dwattr $C$DW$396, DW_AT_bit_size(0x01)
    9283                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9284                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    9285              
    9286              $C$DW$397       .dwtag  DW_TAG_member
    9287                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    9288                      .dwattr $C$DW$397, DW_AT_name("rsvd10")
    9289                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd10")
    9290                      .dwattr $C$DW$397, DW_AT_bit_offset(0x00)
    9291                      .dwattr $C$DW$397, DW_AT_bit_size(0x01)
    9292                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9293                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    9294              
    9295                      .dwendtag $C$DW$T$20
    9296              
    9297              
    9298              $C$DW$T$21      .dwtag  DW_TAG_union_type
    9299                      .dwattr $C$DW$T$21, DW_AT_name("AIODAT_REG")
    9300                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    9301              $C$DW$398       .dwtag  DW_TAG_member
    9302                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    9303                      .dwattr $C$DW$398, DW_AT_name("all")
    9304                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_all")
    9305                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9306                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  199

    9307              
    9308              $C$DW$399       .dwtag  DW_TAG_member
    9309                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    9310                      .dwattr $C$DW$399, DW_AT_name("bit")
    9311                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_bit")
    9312                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9313                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    9314              
    9315                      .dwendtag $C$DW$T$21
    9316              
    9317              
    9318              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    9319                      .dwattr $C$DW$T$22, DW_AT_name("GPADAT_BITS")
    9320                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    9321              $C$DW$400       .dwtag  DW_TAG_member
    9322                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    9323                      .dwattr $C$DW$400, DW_AT_name("GPIO0")
    9324                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPIO0")
    9325                      .dwattr $C$DW$400, DW_AT_bit_offset(0x0f)
    9326                      .dwattr $C$DW$400, DW_AT_bit_size(0x01)
    9327                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9328                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    9329              
    9330              $C$DW$401       .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    9332                      .dwattr $C$DW$401, DW_AT_name("GPIO1")
    9333                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPIO1")
    9334                      .dwattr $C$DW$401, DW_AT_bit_offset(0x0e)
    9335                      .dwattr $C$DW$401, DW_AT_bit_size(0x01)
    9336                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9337                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    9338              
    9339              $C$DW$402       .dwtag  DW_TAG_member
    9340                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    9341                      .dwattr $C$DW$402, DW_AT_name("GPIO2")
    9342                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_GPIO2")
    9343                      .dwattr $C$DW$402, DW_AT_bit_offset(0x0d)
    9344                      .dwattr $C$DW$402, DW_AT_bit_size(0x01)
    9345                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9346                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    9347              
    9348              $C$DW$403       .dwtag  DW_TAG_member
    9349                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    9350                      .dwattr $C$DW$403, DW_AT_name("GPIO3")
    9351                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPIO3")
    9352                      .dwattr $C$DW$403, DW_AT_bit_offset(0x0c)
    9353                      .dwattr $C$DW$403, DW_AT_bit_size(0x01)
    9354                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9355                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    9356              
    9357              $C$DW$404       .dwtag  DW_TAG_member
    9358                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    9359                      .dwattr $C$DW$404, DW_AT_name("GPIO4")
    9360                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPIO4")
    9361                      .dwattr $C$DW$404, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  200

    9362                      .dwattr $C$DW$404, DW_AT_bit_size(0x01)
    9363                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9364                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    9365              
    9366              $C$DW$405       .dwtag  DW_TAG_member
    9367                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    9368                      .dwattr $C$DW$405, DW_AT_name("GPIO5")
    9369                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPIO5")
    9370                      .dwattr $C$DW$405, DW_AT_bit_offset(0x0a)
    9371                      .dwattr $C$DW$405, DW_AT_bit_size(0x01)
    9372                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9373                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    9374              
    9375              $C$DW$406       .dwtag  DW_TAG_member
    9376                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    9377                      .dwattr $C$DW$406, DW_AT_name("GPIO6")
    9378                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GPIO6")
    9379                      .dwattr $C$DW$406, DW_AT_bit_offset(0x09)
    9380                      .dwattr $C$DW$406, DW_AT_bit_size(0x01)
    9381                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9382                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    9383              
    9384              $C$DW$407       .dwtag  DW_TAG_member
    9385                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    9386                      .dwattr $C$DW$407, DW_AT_name("GPIO7")
    9387                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPIO7")
    9388                      .dwattr $C$DW$407, DW_AT_bit_offset(0x08)
    9389                      .dwattr $C$DW$407, DW_AT_bit_size(0x01)
    9390                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9391                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    9392              
    9393              $C$DW$408       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    9395                      .dwattr $C$DW$408, DW_AT_name("GPIO8")
    9396                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GPIO8")
    9397                      .dwattr $C$DW$408, DW_AT_bit_offset(0x07)
    9398                      .dwattr $C$DW$408, DW_AT_bit_size(0x01)
    9399                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9400                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    9401              
    9402              $C$DW$409       .dwtag  DW_TAG_member
    9403                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    9404                      .dwattr $C$DW$409, DW_AT_name("GPIO9")
    9405                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GPIO9")
    9406                      .dwattr $C$DW$409, DW_AT_bit_offset(0x06)
    9407                      .dwattr $C$DW$409, DW_AT_bit_size(0x01)
    9408                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9409                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    9410              
    9411              $C$DW$410       .dwtag  DW_TAG_member
    9412                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    9413                      .dwattr $C$DW$410, DW_AT_name("GPIO10")
    9414                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GPIO10")
    9415                      .dwattr $C$DW$410, DW_AT_bit_offset(0x05)
    9416                      .dwattr $C$DW$410, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  201

    9417                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9418                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    9419              
    9420              $C$DW$411       .dwtag  DW_TAG_member
    9421                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    9422                      .dwattr $C$DW$411, DW_AT_name("GPIO11")
    9423                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_GPIO11")
    9424                      .dwattr $C$DW$411, DW_AT_bit_offset(0x04)
    9425                      .dwattr $C$DW$411, DW_AT_bit_size(0x01)
    9426                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9427                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    9428              
    9429              $C$DW$412       .dwtag  DW_TAG_member
    9430                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    9431                      .dwattr $C$DW$412, DW_AT_name("GPIO12")
    9432                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_GPIO12")
    9433                      .dwattr $C$DW$412, DW_AT_bit_offset(0x03)
    9434                      .dwattr $C$DW$412, DW_AT_bit_size(0x01)
    9435                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9436                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    9437              
    9438              $C$DW$413       .dwtag  DW_TAG_member
    9439                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    9440                      .dwattr $C$DW$413, DW_AT_name("GPIO13")
    9441                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_GPIO13")
    9442                      .dwattr $C$DW$413, DW_AT_bit_offset(0x02)
    9443                      .dwattr $C$DW$413, DW_AT_bit_size(0x01)
    9444                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9445                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    9446              
    9447              $C$DW$414       .dwtag  DW_TAG_member
    9448                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    9449                      .dwattr $C$DW$414, DW_AT_name("GPIO14")
    9450                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GPIO14")
    9451                      .dwattr $C$DW$414, DW_AT_bit_offset(0x01)
    9452                      .dwattr $C$DW$414, DW_AT_bit_size(0x01)
    9453                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9454                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    9455              
    9456              $C$DW$415       .dwtag  DW_TAG_member
    9457                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    9458                      .dwattr $C$DW$415, DW_AT_name("GPIO15")
    9459                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPIO15")
    9460                      .dwattr $C$DW$415, DW_AT_bit_offset(0x00)
    9461                      .dwattr $C$DW$415, DW_AT_bit_size(0x01)
    9462                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9463                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    9464              
    9465              $C$DW$416       .dwtag  DW_TAG_member
    9466                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$19)
    9467                      .dwattr $C$DW$416, DW_AT_name("GPIO16")
    9468                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPIO16")
    9469                      .dwattr $C$DW$416, DW_AT_bit_offset(0x0f)
    9470                      .dwattr $C$DW$416, DW_AT_bit_size(0x01)
    9471                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  202

    9472                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    9473              
    9474              $C$DW$417       .dwtag  DW_TAG_member
    9475                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
    9476                      .dwattr $C$DW$417, DW_AT_name("GPIO17")
    9477                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPIO17")
    9478                      .dwattr $C$DW$417, DW_AT_bit_offset(0x0e)
    9479                      .dwattr $C$DW$417, DW_AT_bit_size(0x01)
    9480                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9481                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    9482              
    9483              $C$DW$418       .dwtag  DW_TAG_member
    9484                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
    9485                      .dwattr $C$DW$418, DW_AT_name("GPIO18")
    9486                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPIO18")
    9487                      .dwattr $C$DW$418, DW_AT_bit_offset(0x0d)
    9488                      .dwattr $C$DW$418, DW_AT_bit_size(0x01)
    9489                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9490                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    9491              
    9492              $C$DW$419       .dwtag  DW_TAG_member
    9493                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    9494                      .dwattr $C$DW$419, DW_AT_name("GPIO19")
    9495                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPIO19")
    9496                      .dwattr $C$DW$419, DW_AT_bit_offset(0x0c)
    9497                      .dwattr $C$DW$419, DW_AT_bit_size(0x01)
    9498                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9499                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    9500              
    9501              $C$DW$420       .dwtag  DW_TAG_member
    9502                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    9503                      .dwattr $C$DW$420, DW_AT_name("GPIO20")
    9504                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPIO20")
    9505                      .dwattr $C$DW$420, DW_AT_bit_offset(0x0b)
    9506                      .dwattr $C$DW$420, DW_AT_bit_size(0x01)
    9507                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9508                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    9509              
    9510              $C$DW$421       .dwtag  DW_TAG_member
    9511                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
    9512                      .dwattr $C$DW$421, DW_AT_name("GPIO21")
    9513                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPIO21")
    9514                      .dwattr $C$DW$421, DW_AT_bit_offset(0x0a)
    9515                      .dwattr $C$DW$421, DW_AT_bit_size(0x01)
    9516                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9517                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    9518              
    9519              $C$DW$422       .dwtag  DW_TAG_member
    9520                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$19)
    9521                      .dwattr $C$DW$422, DW_AT_name("GPIO22")
    9522                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPIO22")
    9523                      .dwattr $C$DW$422, DW_AT_bit_offset(0x09)
    9524                      .dwattr $C$DW$422, DW_AT_bit_size(0x01)
    9525                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9526                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  203

    9527              
    9528              $C$DW$423       .dwtag  DW_TAG_member
    9529                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$19)
    9530                      .dwattr $C$DW$423, DW_AT_name("GPIO23")
    9531                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GPIO23")
    9532                      .dwattr $C$DW$423, DW_AT_bit_offset(0x08)
    9533                      .dwattr $C$DW$423, DW_AT_bit_size(0x01)
    9534                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9535                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    9536              
    9537              $C$DW$424       .dwtag  DW_TAG_member
    9538                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    9539                      .dwattr $C$DW$424, DW_AT_name("GPIO24")
    9540                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_GPIO24")
    9541                      .dwattr $C$DW$424, DW_AT_bit_offset(0x07)
    9542                      .dwattr $C$DW$424, DW_AT_bit_size(0x01)
    9543                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9544                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    9545              
    9546              $C$DW$425       .dwtag  DW_TAG_member
    9547                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    9548                      .dwattr $C$DW$425, DW_AT_name("GPIO25")
    9549                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_GPIO25")
    9550                      .dwattr $C$DW$425, DW_AT_bit_offset(0x06)
    9551                      .dwattr $C$DW$425, DW_AT_bit_size(0x01)
    9552                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9553                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    9554              
    9555              $C$DW$426       .dwtag  DW_TAG_member
    9556                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    9557                      .dwattr $C$DW$426, DW_AT_name("GPIO26")
    9558                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_GPIO26")
    9559                      .dwattr $C$DW$426, DW_AT_bit_offset(0x05)
    9560                      .dwattr $C$DW$426, DW_AT_bit_size(0x01)
    9561                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9562                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    9563              
    9564              $C$DW$427       .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    9566                      .dwattr $C$DW$427, DW_AT_name("GPIO27")
    9567                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_GPIO27")
    9568                      .dwattr $C$DW$427, DW_AT_bit_offset(0x04)
    9569                      .dwattr $C$DW$427, DW_AT_bit_size(0x01)
    9570                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9571                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    9572              
    9573              $C$DW$428       .dwtag  DW_TAG_member
    9574                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    9575                      .dwattr $C$DW$428, DW_AT_name("GPIO28")
    9576                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPIO28")
    9577                      .dwattr $C$DW$428, DW_AT_bit_offset(0x03)
    9578                      .dwattr $C$DW$428, DW_AT_bit_size(0x01)
    9579                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9580                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    9581              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  204

    9582              $C$DW$429       .dwtag  DW_TAG_member
    9583                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    9584                      .dwattr $C$DW$429, DW_AT_name("GPIO29")
    9585                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_GPIO29")
    9586                      .dwattr $C$DW$429, DW_AT_bit_offset(0x02)
    9587                      .dwattr $C$DW$429, DW_AT_bit_size(0x01)
    9588                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9589                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    9590              
    9591              $C$DW$430       .dwtag  DW_TAG_member
    9592                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    9593                      .dwattr $C$DW$430, DW_AT_name("GPIO30")
    9594                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPIO30")
    9595                      .dwattr $C$DW$430, DW_AT_bit_offset(0x01)
    9596                      .dwattr $C$DW$430, DW_AT_bit_size(0x01)
    9597                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9598                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    9599              
    9600              $C$DW$431       .dwtag  DW_TAG_member
    9601                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    9602                      .dwattr $C$DW$431, DW_AT_name("GPIO31")
    9603                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_GPIO31")
    9604                      .dwattr $C$DW$431, DW_AT_bit_offset(0x00)
    9605                      .dwattr $C$DW$431, DW_AT_bit_size(0x01)
    9606                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9607                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    9608              
    9609                      .dwendtag $C$DW$T$22
    9610              
    9611              
    9612              $C$DW$T$24      .dwtag  DW_TAG_union_type
    9613                      .dwattr $C$DW$T$24, DW_AT_name("GPADAT_REG")
    9614                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    9615              $C$DW$432       .dwtag  DW_TAG_member
    9616                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
    9617                      .dwattr $C$DW$432, DW_AT_name("all")
    9618                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_all")
    9619                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9620                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    9621              
    9622              $C$DW$433       .dwtag  DW_TAG_member
    9623                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$22)
    9624                      .dwattr $C$DW$433, DW_AT_name("bit")
    9625                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_bit")
    9626                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9627                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    9628              
    9629                      .dwendtag $C$DW$T$24
    9630              
    9631              
    9632              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    9633                      .dwattr $C$DW$T$25, DW_AT_name("GPBDAT_BITS")
    9634                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    9635              $C$DW$434       .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  205

    9637                      .dwattr $C$DW$434, DW_AT_name("GPIO32")
    9638                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GPIO32")
    9639                      .dwattr $C$DW$434, DW_AT_bit_offset(0x0f)
    9640                      .dwattr $C$DW$434, DW_AT_bit_size(0x01)
    9641                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9642                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    9643              
    9644              $C$DW$435       .dwtag  DW_TAG_member
    9645                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
    9646                      .dwattr $C$DW$435, DW_AT_name("GPIO33")
    9647                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GPIO33")
    9648                      .dwattr $C$DW$435, DW_AT_bit_offset(0x0e)
    9649                      .dwattr $C$DW$435, DW_AT_bit_size(0x01)
    9650                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9651                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    9652              
    9653              $C$DW$436       .dwtag  DW_TAG_member
    9654                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    9655                      .dwattr $C$DW$436, DW_AT_name("GPIO34")
    9656                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GPIO34")
    9657                      .dwattr $C$DW$436, DW_AT_bit_offset(0x0d)
    9658                      .dwattr $C$DW$436, DW_AT_bit_size(0x01)
    9659                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9660                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    9661              
    9662              $C$DW$437       .dwtag  DW_TAG_member
    9663                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$19)
    9664                      .dwattr $C$DW$437, DW_AT_name("GPIO35")
    9665                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPIO35")
    9666                      .dwattr $C$DW$437, DW_AT_bit_offset(0x0c)
    9667                      .dwattr $C$DW$437, DW_AT_bit_size(0x01)
    9668                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9669                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    9670              
    9671              $C$DW$438       .dwtag  DW_TAG_member
    9672                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$19)
    9673                      .dwattr $C$DW$438, DW_AT_name("GPIO36")
    9674                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPIO36")
    9675                      .dwattr $C$DW$438, DW_AT_bit_offset(0x0b)
    9676                      .dwattr $C$DW$438, DW_AT_bit_size(0x01)
    9677                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9678                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    9679              
    9680              $C$DW$439       .dwtag  DW_TAG_member
    9681                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$19)
    9682                      .dwattr $C$DW$439, DW_AT_name("GPIO37")
    9683                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPIO37")
    9684                      .dwattr $C$DW$439, DW_AT_bit_offset(0x0a)
    9685                      .dwattr $C$DW$439, DW_AT_bit_size(0x01)
    9686                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9687                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    9688              
    9689              $C$DW$440       .dwtag  DW_TAG_member
    9690                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    9691                      .dwattr $C$DW$440, DW_AT_name("GPIO38")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  206

    9692                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_GPIO38")
    9693                      .dwattr $C$DW$440, DW_AT_bit_offset(0x09)
    9694                      .dwattr $C$DW$440, DW_AT_bit_size(0x01)
    9695                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9696                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    9697              
    9698              $C$DW$441       .dwtag  DW_TAG_member
    9699                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    9700                      .dwattr $C$DW$441, DW_AT_name("GPIO39")
    9701                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPIO39")
    9702                      .dwattr $C$DW$441, DW_AT_bit_offset(0x08)
    9703                      .dwattr $C$DW$441, DW_AT_bit_size(0x01)
    9704                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9705                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    9706              
    9707              $C$DW$442       .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    9709                      .dwattr $C$DW$442, DW_AT_name("GPIO40")
    9710                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_GPIO40")
    9711                      .dwattr $C$DW$442, DW_AT_bit_offset(0x07)
    9712                      .dwattr $C$DW$442, DW_AT_bit_size(0x01)
    9713                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9714                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    9715              
    9716              $C$DW$443       .dwtag  DW_TAG_member
    9717                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    9718                      .dwattr $C$DW$443, DW_AT_name("GPIO41")
    9719                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_GPIO41")
    9720                      .dwattr $C$DW$443, DW_AT_bit_offset(0x06)
    9721                      .dwattr $C$DW$443, DW_AT_bit_size(0x01)
    9722                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9723                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    9724              
    9725              $C$DW$444       .dwtag  DW_TAG_member
    9726                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    9727                      .dwattr $C$DW$444, DW_AT_name("GPIO42")
    9728                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_GPIO42")
    9729                      .dwattr $C$DW$444, DW_AT_bit_offset(0x05)
    9730                      .dwattr $C$DW$444, DW_AT_bit_size(0x01)
    9731                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9732                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    9733              
    9734              $C$DW$445       .dwtag  DW_TAG_member
    9735                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
    9736                      .dwattr $C$DW$445, DW_AT_name("GPIO43")
    9737                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_GPIO43")
    9738                      .dwattr $C$DW$445, DW_AT_bit_offset(0x04)
    9739                      .dwattr $C$DW$445, DW_AT_bit_size(0x01)
    9740                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9741                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    9742              
    9743              $C$DW$446       .dwtag  DW_TAG_member
    9744                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    9745                      .dwattr $C$DW$446, DW_AT_name("GPIO44")
    9746                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GPIO44")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  207

    9747                      .dwattr $C$DW$446, DW_AT_bit_offset(0x03)
    9748                      .dwattr $C$DW$446, DW_AT_bit_size(0x01)
    9749                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9750                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    9751              
    9752              $C$DW$447       .dwtag  DW_TAG_member
    9753                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    9754                      .dwattr $C$DW$447, DW_AT_name("rsvd1")
    9755                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_rsvd1")
    9756                      .dwattr $C$DW$447, DW_AT_bit_offset(0x00)
    9757                      .dwattr $C$DW$447, DW_AT_bit_size(0x03)
    9758                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9759                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    9760              
    9761              $C$DW$448       .dwtag  DW_TAG_member
    9762                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
    9763                      .dwattr $C$DW$448, DW_AT_name("rsvd2")
    9764                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_rsvd2")
    9765                      .dwattr $C$DW$448, DW_AT_bit_offset(0x00)
    9766                      .dwattr $C$DW$448, DW_AT_bit_size(0x10)
    9767                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9768                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    9769              
    9770                      .dwendtag $C$DW$T$25
    9771              
    9772              
    9773              $C$DW$T$26      .dwtag  DW_TAG_union_type
    9774                      .dwattr $C$DW$T$26, DW_AT_name("GPBDAT_REG")
    9775                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    9776              $C$DW$449       .dwtag  DW_TAG_member
    9777                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$23)
    9778                      .dwattr $C$DW$449, DW_AT_name("all")
    9779                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_all")
    9780                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9781                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    9782              
    9783              $C$DW$450       .dwtag  DW_TAG_member
    9784                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$25)
    9785                      .dwattr $C$DW$450, DW_AT_name("bit")
    9786                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_bit")
    9787                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9788                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    9789              
    9790                      .dwendtag $C$DW$T$26
    9791              
    9792              
    9793              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    9794                      .dwattr $C$DW$T$28, DW_AT_name("GPIO_DATA_REGS")
    9795                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    9796              $C$DW$451       .dwtag  DW_TAG_member
    9797                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    9798                      .dwattr $C$DW$451, DW_AT_name("GPADAT")
    9799                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_GPADAT")
    9800                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9801                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  208

    9802              
    9803              $C$DW$452       .dwtag  DW_TAG_member
    9804                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    9805                      .dwattr $C$DW$452, DW_AT_name("GPASET")
    9806                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_GPASET")
    9807                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9808                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    9809              
    9810              $C$DW$453       .dwtag  DW_TAG_member
    9811                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    9812                      .dwattr $C$DW$453, DW_AT_name("GPACLEAR")
    9813                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GPACLEAR")
    9814                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9815                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    9816              
    9817              $C$DW$454       .dwtag  DW_TAG_member
    9818                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    9819                      .dwattr $C$DW$454, DW_AT_name("GPATOGGLE")
    9820                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_GPATOGGLE")
    9821                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9822                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    9823              
    9824              $C$DW$455       .dwtag  DW_TAG_member
    9825                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$26)
    9826                      .dwattr $C$DW$455, DW_AT_name("GPBDAT")
    9827                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_GPBDAT")
    9828                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9829                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    9830              
    9831              $C$DW$456       .dwtag  DW_TAG_member
    9832                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$26)
    9833                      .dwattr $C$DW$456, DW_AT_name("GPBSET")
    9834                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_GPBSET")
    9835                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9836                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    9837              
    9838              $C$DW$457       .dwtag  DW_TAG_member
    9839                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$26)
    9840                      .dwattr $C$DW$457, DW_AT_name("GPBCLEAR")
    9841                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_GPBCLEAR")
    9842                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9843                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    9844              
    9845              $C$DW$458       .dwtag  DW_TAG_member
    9846                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$26)
    9847                      .dwattr $C$DW$458, DW_AT_name("GPBTOGGLE")
    9848                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9849                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9850                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    9851              
    9852              $C$DW$459       .dwtag  DW_TAG_member
    9853                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$27)
    9854                      .dwattr $C$DW$459, DW_AT_name("rsvd1")
    9855                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_rsvd1")
    9856                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  209

    9857                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    9858              
    9859              $C$DW$460       .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$21)
    9861                      .dwattr $C$DW$460, DW_AT_name("AIODAT")
    9862                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_AIODAT")
    9863                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9864                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    9865              
    9866              $C$DW$461       .dwtag  DW_TAG_member
    9867                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
    9868                      .dwattr $C$DW$461, DW_AT_name("rsvd2")
    9869                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_rsvd2")
    9870                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    9871                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    9872              
    9873              $C$DW$462       .dwtag  DW_TAG_member
    9874                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$21)
    9875                      .dwattr $C$DW$462, DW_AT_name("AIOSET")
    9876                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_AIOSET")
    9877                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9878                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    9879              
    9880              $C$DW$463       .dwtag  DW_TAG_member
    9881                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    9882                      .dwattr $C$DW$463, DW_AT_name("rsvd3")
    9883                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_rsvd3")
    9884                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    9885                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    9886              
    9887              $C$DW$464       .dwtag  DW_TAG_member
    9888                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$21)
    9889                      .dwattr $C$DW$464, DW_AT_name("AIOCLEAR")
    9890                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_AIOCLEAR")
    9891                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9892                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    9893              
    9894              $C$DW$465       .dwtag  DW_TAG_member
    9895                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    9896                      .dwattr $C$DW$465, DW_AT_name("rsvd4")
    9897                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_rsvd4")
    9898                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    9899                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    9900              
    9901              $C$DW$466       .dwtag  DW_TAG_member
    9902                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$21)
    9903                      .dwattr $C$DW$466, DW_AT_name("AIOTOGGLE")
    9904                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9905                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9906                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    9907              
    9908              $C$DW$467       .dwtag  DW_TAG_member
    9909                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
    9910                      .dwattr $C$DW$467, DW_AT_name("rsvd5")
    9911                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_rsvd5")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  210

    9912                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    9913                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    9914              
    9915                      .dwendtag $C$DW$T$28
    9916              
    9917              $C$DW$468       .dwtag  DW_TAG_TI_far_type
    9918                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$28)
    9919              
    9920              $C$DW$T$59      .dwtag  DW_TAG_volatile_type
    9921                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$468)
    9922              
    9923              
    9924              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    9925                      .dwattr $C$DW$T$29, DW_AT_name("PIEACK_BITS")
    9926                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    9927              $C$DW$469       .dwtag  DW_TAG_member
    9928                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    9929                      .dwattr $C$DW$469, DW_AT_name("ACK1")
    9930                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_ACK1")
    9931                      .dwattr $C$DW$469, DW_AT_bit_offset(0x0f)
    9932                      .dwattr $C$DW$469, DW_AT_bit_size(0x01)
    9933                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9934                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    9935              
    9936              $C$DW$470       .dwtag  DW_TAG_member
    9937                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    9938                      .dwattr $C$DW$470, DW_AT_name("ACK2")
    9939                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_ACK2")
    9940                      .dwattr $C$DW$470, DW_AT_bit_offset(0x0e)
    9941                      .dwattr $C$DW$470, DW_AT_bit_size(0x01)
    9942                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9943                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    9944              
    9945              $C$DW$471       .dwtag  DW_TAG_member
    9946                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    9947                      .dwattr $C$DW$471, DW_AT_name("ACK3")
    9948                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ACK3")
    9949                      .dwattr $C$DW$471, DW_AT_bit_offset(0x0d)
    9950                      .dwattr $C$DW$471, DW_AT_bit_size(0x01)
    9951                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9952                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    9953              
    9954              $C$DW$472       .dwtag  DW_TAG_member
    9955                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    9956                      .dwattr $C$DW$472, DW_AT_name("ACK4")
    9957                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_ACK4")
    9958                      .dwattr $C$DW$472, DW_AT_bit_offset(0x0c)
    9959                      .dwattr $C$DW$472, DW_AT_bit_size(0x01)
    9960                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9961                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    9962              
    9963              $C$DW$473       .dwtag  DW_TAG_member
    9964                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    9965                      .dwattr $C$DW$473, DW_AT_name("ACK5")
    9966                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_ACK5")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  211

    9967                      .dwattr $C$DW$473, DW_AT_bit_offset(0x0b)
    9968                      .dwattr $C$DW$473, DW_AT_bit_size(0x01)
    9969                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9970                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    9971              
    9972              $C$DW$474       .dwtag  DW_TAG_member
    9973                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    9974                      .dwattr $C$DW$474, DW_AT_name("ACK6")
    9975                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_ACK6")
    9976                      .dwattr $C$DW$474, DW_AT_bit_offset(0x0a)
    9977                      .dwattr $C$DW$474, DW_AT_bit_size(0x01)
    9978                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9979                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    9980              
    9981              $C$DW$475       .dwtag  DW_TAG_member
    9982                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    9983                      .dwattr $C$DW$475, DW_AT_name("ACK7")
    9984                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_ACK7")
    9985                      .dwattr $C$DW$475, DW_AT_bit_offset(0x09)
    9986                      .dwattr $C$DW$475, DW_AT_bit_size(0x01)
    9987                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9988                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    9989              
    9990              $C$DW$476       .dwtag  DW_TAG_member
    9991                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    9992                      .dwattr $C$DW$476, DW_AT_name("ACK8")
    9993                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_ACK8")
    9994                      .dwattr $C$DW$476, DW_AT_bit_offset(0x08)
    9995                      .dwattr $C$DW$476, DW_AT_bit_size(0x01)
    9996                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9997                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    9998              
    9999              $C$DW$477       .dwtag  DW_TAG_member
   10000                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
   10001                      .dwattr $C$DW$477, DW_AT_name("ACK9")
   10002                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_ACK9")
   10003                      .dwattr $C$DW$477, DW_AT_bit_offset(0x07)
   10004                      .dwattr $C$DW$477, DW_AT_bit_size(0x01)
   10005                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10006                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
   10007              
   10008              $C$DW$478       .dwtag  DW_TAG_member
   10009                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$19)
   10010                      .dwattr $C$DW$478, DW_AT_name("ACK10")
   10011                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_ACK10")
   10012                      .dwattr $C$DW$478, DW_AT_bit_offset(0x06)
   10013                      .dwattr $C$DW$478, DW_AT_bit_size(0x01)
   10014                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10015                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
   10016              
   10017              $C$DW$479       .dwtag  DW_TAG_member
   10018                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
   10019                      .dwattr $C$DW$479, DW_AT_name("ACK11")
   10020                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_ACK11")
   10021                      .dwattr $C$DW$479, DW_AT_bit_offset(0x05)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  212

   10022                      .dwattr $C$DW$479, DW_AT_bit_size(0x01)
   10023                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10024                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
   10025              
   10026              $C$DW$480       .dwtag  DW_TAG_member
   10027                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
   10028                      .dwattr $C$DW$480, DW_AT_name("ACK12")
   10029                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_ACK12")
   10030                      .dwattr $C$DW$480, DW_AT_bit_offset(0x04)
   10031                      .dwattr $C$DW$480, DW_AT_bit_size(0x01)
   10032                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10033                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
   10034              
   10035              $C$DW$481       .dwtag  DW_TAG_member
   10036                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
   10037                      .dwattr $C$DW$481, DW_AT_name("rsvd")
   10038                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_rsvd")
   10039                      .dwattr $C$DW$481, DW_AT_bit_offset(0x00)
   10040                      .dwattr $C$DW$481, DW_AT_bit_size(0x04)
   10041                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10042                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
   10043              
   10044                      .dwendtag $C$DW$T$29
   10045              
   10046              
   10047              $C$DW$T$30      .dwtag  DW_TAG_union_type
   10048                      .dwattr $C$DW$T$30, DW_AT_name("PIEACK_REG")
   10049                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
   10050              $C$DW$482       .dwtag  DW_TAG_member
   10051                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
   10052                      .dwattr $C$DW$482, DW_AT_name("all")
   10053                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_all")
   10054                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10055                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
   10056              
   10057              $C$DW$483       .dwtag  DW_TAG_member
   10058                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$29)
   10059                      .dwattr $C$DW$483, DW_AT_name("bit")
   10060                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_bit")
   10061                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10062                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
   10063              
   10064                      .dwendtag $C$DW$T$30
   10065              
   10066              
   10067              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   10068                      .dwattr $C$DW$T$31, DW_AT_name("PIECTRL_BITS")
   10069                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
   10070              $C$DW$484       .dwtag  DW_TAG_member
   10071                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
   10072                      .dwattr $C$DW$484, DW_AT_name("ENPIE")
   10073                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_ENPIE")
   10074                      .dwattr $C$DW$484, DW_AT_bit_offset(0x0f)
   10075                      .dwattr $C$DW$484, DW_AT_bit_size(0x01)
   10076                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  213

   10077                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
   10078              
   10079              $C$DW$485       .dwtag  DW_TAG_member
   10080                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
   10081                      .dwattr $C$DW$485, DW_AT_name("PIEVECT")
   10082                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_PIEVECT")
   10083                      .dwattr $C$DW$485, DW_AT_bit_offset(0x00)
   10084                      .dwattr $C$DW$485, DW_AT_bit_size(0x0f)
   10085                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10086                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
   10087              
   10088                      .dwendtag $C$DW$T$31
   10089              
   10090              
   10091              $C$DW$T$32      .dwtag  DW_TAG_union_type
   10092                      .dwattr $C$DW$T$32, DW_AT_name("PIECTRL_REG")
   10093                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
   10094              $C$DW$486       .dwtag  DW_TAG_member
   10095                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
   10096                      .dwattr $C$DW$486, DW_AT_name("all")
   10097                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_all")
   10098                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10099                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
   10100              
   10101              $C$DW$487       .dwtag  DW_TAG_member
   10102                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$31)
   10103                      .dwattr $C$DW$487, DW_AT_name("bit")
   10104                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_bit")
   10105                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10106                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
   10107              
   10108                      .dwendtag $C$DW$T$32
   10109              
   10110              
   10111              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   10112                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER_BITS")
   10113                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   10114              $C$DW$488       .dwtag  DW_TAG_member
   10115                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
   10116                      .dwattr $C$DW$488, DW_AT_name("INTx1")
   10117                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_INTx1")
   10118                      .dwattr $C$DW$488, DW_AT_bit_offset(0x0f)
   10119                      .dwattr $C$DW$488, DW_AT_bit_size(0x01)
   10120                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10121                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
   10122              
   10123              $C$DW$489       .dwtag  DW_TAG_member
   10124                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
   10125                      .dwattr $C$DW$489, DW_AT_name("INTx2")
   10126                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_INTx2")
   10127                      .dwattr $C$DW$489, DW_AT_bit_offset(0x0e)
   10128                      .dwattr $C$DW$489, DW_AT_bit_size(0x01)
   10129                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10130                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
   10131              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  214

   10132              $C$DW$490       .dwtag  DW_TAG_member
   10133                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
   10134                      .dwattr $C$DW$490, DW_AT_name("INTx3")
   10135                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_INTx3")
   10136                      .dwattr $C$DW$490, DW_AT_bit_offset(0x0d)
   10137                      .dwattr $C$DW$490, DW_AT_bit_size(0x01)
   10138                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10139                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
   10140              
   10141              $C$DW$491       .dwtag  DW_TAG_member
   10142                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
   10143                      .dwattr $C$DW$491, DW_AT_name("INTx4")
   10144                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_INTx4")
   10145                      .dwattr $C$DW$491, DW_AT_bit_offset(0x0c)
   10146                      .dwattr $C$DW$491, DW_AT_bit_size(0x01)
   10147                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10148                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
   10149              
   10150              $C$DW$492       .dwtag  DW_TAG_member
   10151                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
   10152                      .dwattr $C$DW$492, DW_AT_name("INTx5")
   10153                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_INTx5")
   10154                      .dwattr $C$DW$492, DW_AT_bit_offset(0x0b)
   10155                      .dwattr $C$DW$492, DW_AT_bit_size(0x01)
   10156                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10157                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
   10158              
   10159              $C$DW$493       .dwtag  DW_TAG_member
   10160                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
   10161                      .dwattr $C$DW$493, DW_AT_name("INTx6")
   10162                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_INTx6")
   10163                      .dwattr $C$DW$493, DW_AT_bit_offset(0x0a)
   10164                      .dwattr $C$DW$493, DW_AT_bit_size(0x01)
   10165                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10166                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
   10167              
   10168              $C$DW$494       .dwtag  DW_TAG_member
   10169                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
   10170                      .dwattr $C$DW$494, DW_AT_name("INTx7")
   10171                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_INTx7")
   10172                      .dwattr $C$DW$494, DW_AT_bit_offset(0x09)
   10173                      .dwattr $C$DW$494, DW_AT_bit_size(0x01)
   10174                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10175                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
   10176              
   10177              $C$DW$495       .dwtag  DW_TAG_member
   10178                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
   10179                      .dwattr $C$DW$495, DW_AT_name("INTx8")
   10180                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_INTx8")
   10181                      .dwattr $C$DW$495, DW_AT_bit_offset(0x08)
   10182                      .dwattr $C$DW$495, DW_AT_bit_size(0x01)
   10183                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10184                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
   10185              
   10186              $C$DW$496       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  215

   10187                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
   10188                      .dwattr $C$DW$496, DW_AT_name("rsvd")
   10189                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_rsvd")
   10190                      .dwattr $C$DW$496, DW_AT_bit_offset(0x00)
   10191                      .dwattr $C$DW$496, DW_AT_bit_size(0x08)
   10192                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10193                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
   10194              
   10195                      .dwendtag $C$DW$T$33
   10196              
   10197              
   10198              $C$DW$T$34      .dwtag  DW_TAG_union_type
   10199                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER_REG")
   10200                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10201              $C$DW$497       .dwtag  DW_TAG_member
   10202                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
   10203                      .dwattr $C$DW$497, DW_AT_name("all")
   10204                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_all")
   10205                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10206                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
   10207              
   10208              $C$DW$498       .dwtag  DW_TAG_member
   10209                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$33)
   10210                      .dwattr $C$DW$498, DW_AT_name("bit")
   10211                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_bit")
   10212                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10213                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
   10214              
   10215                      .dwendtag $C$DW$T$34
   10216              
   10217              
   10218              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   10219                      .dwattr $C$DW$T$35, DW_AT_name("PIEIFR_BITS")
   10220                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   10221              $C$DW$499       .dwtag  DW_TAG_member
   10222                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
   10223                      .dwattr $C$DW$499, DW_AT_name("INTx1")
   10224                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_INTx1")
   10225                      .dwattr $C$DW$499, DW_AT_bit_offset(0x0f)
   10226                      .dwattr $C$DW$499, DW_AT_bit_size(0x01)
   10227                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10228                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
   10229              
   10230              $C$DW$500       .dwtag  DW_TAG_member
   10231                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
   10232                      .dwattr $C$DW$500, DW_AT_name("INTx2")
   10233                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_INTx2")
   10234                      .dwattr $C$DW$500, DW_AT_bit_offset(0x0e)
   10235                      .dwattr $C$DW$500, DW_AT_bit_size(0x01)
   10236                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10237                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
   10238              
   10239              $C$DW$501       .dwtag  DW_TAG_member
   10240                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
   10241                      .dwattr $C$DW$501, DW_AT_name("INTx3")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  216

   10242                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_INTx3")
   10243                      .dwattr $C$DW$501, DW_AT_bit_offset(0x0d)
   10244                      .dwattr $C$DW$501, DW_AT_bit_size(0x01)
   10245                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10246                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
   10247              
   10248              $C$DW$502       .dwtag  DW_TAG_member
   10249                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
   10250                      .dwattr $C$DW$502, DW_AT_name("INTx4")
   10251                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_INTx4")
   10252                      .dwattr $C$DW$502, DW_AT_bit_offset(0x0c)
   10253                      .dwattr $C$DW$502, DW_AT_bit_size(0x01)
   10254                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10255                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
   10256              
   10257              $C$DW$503       .dwtag  DW_TAG_member
   10258                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
   10259                      .dwattr $C$DW$503, DW_AT_name("INTx5")
   10260                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_INTx5")
   10261                      .dwattr $C$DW$503, DW_AT_bit_offset(0x0b)
   10262                      .dwattr $C$DW$503, DW_AT_bit_size(0x01)
   10263                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10264                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
   10265              
   10266              $C$DW$504       .dwtag  DW_TAG_member
   10267                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
   10268                      .dwattr $C$DW$504, DW_AT_name("INTx6")
   10269                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_INTx6")
   10270                      .dwattr $C$DW$504, DW_AT_bit_offset(0x0a)
   10271                      .dwattr $C$DW$504, DW_AT_bit_size(0x01)
   10272                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10273                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
   10274              
   10275              $C$DW$505       .dwtag  DW_TAG_member
   10276                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
   10277                      .dwattr $C$DW$505, DW_AT_name("INTx7")
   10278                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_INTx7")
   10279                      .dwattr $C$DW$505, DW_AT_bit_offset(0x09)
   10280                      .dwattr $C$DW$505, DW_AT_bit_size(0x01)
   10281                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10282                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
   10283              
   10284              $C$DW$506       .dwtag  DW_TAG_member
   10285                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
   10286                      .dwattr $C$DW$506, DW_AT_name("INTx8")
   10287                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_INTx8")
   10288                      .dwattr $C$DW$506, DW_AT_bit_offset(0x08)
   10289                      .dwattr $C$DW$506, DW_AT_bit_size(0x01)
   10290                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10291                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
   10292              
   10293              $C$DW$507       .dwtag  DW_TAG_member
   10294                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
   10295                      .dwattr $C$DW$507, DW_AT_name("rsvd")
   10296                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_rsvd")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  217

   10297                      .dwattr $C$DW$507, DW_AT_bit_offset(0x00)
   10298                      .dwattr $C$DW$507, DW_AT_bit_size(0x08)
   10299                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10300                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
   10301              
   10302                      .dwendtag $C$DW$T$35
   10303              
   10304              
   10305              $C$DW$T$36      .dwtag  DW_TAG_union_type
   10306                      .dwattr $C$DW$T$36, DW_AT_name("PIEIFR_REG")
   10307                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
   10308              $C$DW$508       .dwtag  DW_TAG_member
   10309                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
   10310                      .dwattr $C$DW$508, DW_AT_name("all")
   10311                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_all")
   10312                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10313                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
   10314              
   10315              $C$DW$509       .dwtag  DW_TAG_member
   10316                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$35)
   10317                      .dwattr $C$DW$509, DW_AT_name("bit")
   10318                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_bit")
   10319                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10320                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
   10321              
   10322                      .dwendtag $C$DW$T$36
   10323              
   10324              
   10325              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10326                      .dwattr $C$DW$T$37, DW_AT_name("PIE_CTRL_REGS")
   10327                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x1a)
   10328              $C$DW$510       .dwtag  DW_TAG_member
   10329                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$32)
   10330                      .dwattr $C$DW$510, DW_AT_name("PIECTRL")
   10331                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_PIECTRL")
   10332                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10333                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
   10334              
   10335              $C$DW$511       .dwtag  DW_TAG_member
   10336                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$30)
   10337                      .dwattr $C$DW$511, DW_AT_name("PIEACK")
   10338                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_PIEACK")
   10339                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10340                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
   10341              
   10342              $C$DW$512       .dwtag  DW_TAG_member
   10343                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$34)
   10344                      .dwattr $C$DW$512, DW_AT_name("PIEIER1")
   10345                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_PIEIER1")
   10346                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10347                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
   10348              
   10349              $C$DW$513       .dwtag  DW_TAG_member
   10350                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$36)
   10351                      .dwattr $C$DW$513, DW_AT_name("PIEIFR1")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  218

   10352                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_PIEIFR1")
   10353                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10354                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
   10355              
   10356              $C$DW$514       .dwtag  DW_TAG_member
   10357                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$34)
   10358                      .dwattr $C$DW$514, DW_AT_name("PIEIER2")
   10359                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_PIEIER2")
   10360                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10361                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
   10362              
   10363              $C$DW$515       .dwtag  DW_TAG_member
   10364                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$36)
   10365                      .dwattr $C$DW$515, DW_AT_name("PIEIFR2")
   10366                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_PIEIFR2")
   10367                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10368                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
   10369              
   10370              $C$DW$516       .dwtag  DW_TAG_member
   10371                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$34)
   10372                      .dwattr $C$DW$516, DW_AT_name("PIEIER3")
   10373                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_PIEIER3")
   10374                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10375                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
   10376              
   10377              $C$DW$517       .dwtag  DW_TAG_member
   10378                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$36)
   10379                      .dwattr $C$DW$517, DW_AT_name("PIEIFR3")
   10380                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_PIEIFR3")
   10381                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10382                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
   10383              
   10384              $C$DW$518       .dwtag  DW_TAG_member
   10385                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$34)
   10386                      .dwattr $C$DW$518, DW_AT_name("PIEIER4")
   10387                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_PIEIER4")
   10388                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10389                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
   10390              
   10391              $C$DW$519       .dwtag  DW_TAG_member
   10392                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$36)
   10393                      .dwattr $C$DW$519, DW_AT_name("PIEIFR4")
   10394                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_PIEIFR4")
   10395                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10396                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
   10397              
   10398              $C$DW$520       .dwtag  DW_TAG_member
   10399                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$34)
   10400                      .dwattr $C$DW$520, DW_AT_name("PIEIER5")
   10401                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_PIEIER5")
   10402                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10403                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
   10404              
   10405              $C$DW$521       .dwtag  DW_TAG_member
   10406                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:42 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{DE7973BA-E5EF-429A-AC54-55B4C34326AD} PAGE  219

   10407                      .dwattr $C$DW$521, DW_AT_name("PIEIFR5")
   10408                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_PIEIFR5")
   10409                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10410                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
   10411              
   10412              $C$DW$522       .dwtag  DW_TAG_member
   10413                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$34)
   10414                      .dwattr $C$DW$522, DW_AT_name("PIEIER6")
   10415                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_PIEIER6")
   10416                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10417                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
   10418              
   10419              $C$DW$523       .dwtag  DW_TAG_member
   10420                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$36)
   10421                      .dwattr $C$DW$523, DW_AT_name("PIEIFR6")
   10422                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_PIEIFR6")
   10423                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10424                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
   10425              
   10426              $C$DW$524       .dwtag  DW_TAG_member
   10427                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$34)
   10428                      .dwattr $C$DW$524, DW_AT_name("PIEIER7")
   10429                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_PIEIER7")
