TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Fri Dec 15 06:46:29 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=on --mem_model
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/rs_gsm_tx_sync1.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\GRIDTIE_170714\KT1205_MGI_V8.5_REVC_MASTER_GPRS_1711
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    7139 00000158 0031  $C$FSL16:       .string "100,SC7,MComplete,K17,",0,0
         00000159 0030 
         0000015a 0030 
         0000015b 002C 
         0000015c 0053 
         0000015d 0043 
         0000015e 0037 
         0000015f 002C 
         00000160 004D 
         00000161 0043 
         00000162 006F 
         00000163 006D 
         00000164 0070 
         00000165 006C 
         00000166 0065 
         00000167 0074 
         00000168 0065 
         00000169 002C 
         0000016a 004B 
         0000016b 0031 
         0000016c 0037 
         0000016d 002C 
         0000016e 0000 
         0000016f 0000 
    7140                      .align  2
    7141 00000170 0041  $C$FSL17:       .string "AT+HTTPDATA=192,2000",13,10,0,0
         00000171 0054 
         00000172 002B 
         00000173 0048 
         00000174 0054 
         00000175 0054 
         00000176 0050 
         00000177 0044 
         00000178 0041 
         00000179 0054 
         0000017a 0041 
         0000017b 003D 
         0000017c 0031 
         0000017d 0039 
         0000017e 0032 
         0000017f 002C 
         00000180 0032 
         00000181 0030 
         00000182 0030 
         00000183 0030 
         00000184 000D 
         00000185 000A 
         00000186 0000 
         00000187 0000 
    7142                      .align  2
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  155

    7143 00000188 0041  $C$FSL18:       .string "AT+HTTPACTION=1",13,10,0,0
         00000189 0054 
         0000018a 002B 
         0000018b 0048 
         0000018c 0054 
         0000018d 0054 
         0000018e 0050 
         0000018f 0041 
         00000190 0043 
         00000191 0054 
         00000192 0049 
         00000193 004F 
         00000194 004E 
         00000195 003D 
         00000196 0031 
         00000197 000D 
         00000198 000A 
         00000199 0000 
         0000019a 0000 
    7144                      .align  2
    7145 0000019c 0041  $C$FSL19:       .string "AT+HTTPREAD",13,10,0,0
         0000019d 0054 
         0000019e 002B 
         0000019f 0048 
         000001a0 0054 
         000001a1 0054 
         000001a2 0050 
         000001a3 0052 
         000001a4 0045 
         000001a5 0041 
         000001a6 0044 
         000001a7 000D 
         000001a8 000A 
         000001a9 0000 
         000001aa 0000 
    7146                      .align  2
    7147 000001ac 0041  $C$FSL20:       .string "AT+HTTPTERM",13,10,0,0
         000001ad 0054 
         000001ae 002B 
         000001af 0048 
         000001b0 0054 
         000001b1 0054 
         000001b2 0050 
         000001b3 0054 
         000001b4 0045 
         000001b5 0052 
         000001b6 004D 
         000001b7 000D 
         000001b8 000A 
         000001b9 0000 
         000001ba 0000 
    7148                      .align  2
    7149 000001bc 000D  $C$FSL21:       .string 13,10,0,0
         000001bd 000A 
         000001be 0000 
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  156

         000001bf 0000 
    7150                      .align  2
    7151 000001c0 0041  $C$FSL22:       .string "AT+CFUN=1,1",13,10,0,0
         000001c1 0054 
         000001c2 002B 
         000001c3 0043 
         000001c4 0046 
         000001c5 0055 
         000001c6 004E 
         000001c7 003D 
         000001c8 0031 
         000001c9 002C 
         000001ca 0031 
         000001cb 000D 
         000001cc 000A 
         000001cd 0000 
         000001ce 0000 
    7152              ;**************************************************************
    7153              ;* UNDEFINED EXTERNAL REFERENCES                              *
    7154              ;**************************************************************
    7155                      .global _peakInverterOutputVoltage
    7156                      .global _storeFaultState
    7157                      .global _gridFlag
    7158                      .global _systemState
    7159                      .global _measuredTemperature
    7160                      .global _flybackCurrent1
    7161                      .global _pvPanelVoltage
    7162                      .global _peakGridVoltage
    7163                      .global _peakInverterOutputCurrent
    7164                      .global _my_Irms_q15_result
    7165                      .global _SciaRegs
    7166                      .global _PieCtrlRegs
    7167                      .global _GpioDataRegs
    7168                      .global _prolog_c28x_1
    7169                      .global _prolog_c28x_2
    7170                      .global _prolog_c28x_3
    7171                      .global _abstract_func1_c28x
    7172                      .global _abstract_func2_c28x
    7173                      .global _epilog_c28x_1
    7174                      .global _epilog_c28x_2
    7175              
    7176              ;***************************************************************
    7177              ;* TYPE INFORMATION                                            *
    7178              ;***************************************************************
    7179              
    7180              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7181                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
    7182                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    7183              $C$DW$315       .dwtag  DW_TAG_member
    7184                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    7185                      .dwattr $C$DW$315, DW_AT_name("rsvd1")
    7186                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_rsvd1")
    7187                      .dwattr $C$DW$315, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7188                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7189                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  157

    7190              $C$DW$316       .dwtag  DW_TAG_member
    7191                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    7192                      .dwattr $C$DW$316, DW_AT_name("rsvd2")
    7193                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd2")
    7194                      .dwattr $C$DW$316, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7195                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7196                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    7197              $C$DW$317       .dwtag  DW_TAG_member
    7198                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    7199                      .dwattr $C$DW$317, DW_AT_name("AIO2")
    7200                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_AIO2")
    7201                      .dwattr $C$DW$317, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7202                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7203                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    7204              $C$DW$318       .dwtag  DW_TAG_member
    7205                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    7206                      .dwattr $C$DW$318, DW_AT_name("rsvd3")
    7207                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_rsvd3")
    7208                      .dwattr $C$DW$318, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7209                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7210                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    7211              $C$DW$319       .dwtag  DW_TAG_member
    7212                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    7213                      .dwattr $C$DW$319, DW_AT_name("AIO4")
    7214                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_AIO4")
    7215                      .dwattr $C$DW$319, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7216                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7217                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    7218              $C$DW$320       .dwtag  DW_TAG_member
    7219                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    7220                      .dwattr $C$DW$320, DW_AT_name("rsvd4")
    7221                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_rsvd4")
    7222                      .dwattr $C$DW$320, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    7223                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7224                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7225              $C$DW$321       .dwtag  DW_TAG_member
    7226                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    7227                      .dwattr $C$DW$321, DW_AT_name("AIO6")
    7228                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_AIO6")
    7229                      .dwattr $C$DW$321, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    7230                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7231                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    7232              $C$DW$322       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    7234                      .dwattr $C$DW$322, DW_AT_name("rsvd5")
    7235                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_rsvd5")
    7236                      .dwattr $C$DW$322, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    7237                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7238                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    7239              $C$DW$323       .dwtag  DW_TAG_member
    7240                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    7241                      .dwattr $C$DW$323, DW_AT_name("rsvd6")
    7242                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_rsvd6")
    7243                      .dwattr $C$DW$323, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    7244                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  158

    7245                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    7246              $C$DW$324       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    7248                      .dwattr $C$DW$324, DW_AT_name("rsvd7")
    7249                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_rsvd7")
    7250                      .dwattr $C$DW$324, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    7251                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7252                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    7253              $C$DW$325       .dwtag  DW_TAG_member
    7254                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    7255                      .dwattr $C$DW$325, DW_AT_name("AIO10")
    7256                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_AIO10")
    7257                      .dwattr $C$DW$325, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    7258                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7259                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    7260              $C$DW$326       .dwtag  DW_TAG_member
    7261                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    7262                      .dwattr $C$DW$326, DW_AT_name("rsvd8")
    7263                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_rsvd8")
    7264                      .dwattr $C$DW$326, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    7265                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7266                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    7267              $C$DW$327       .dwtag  DW_TAG_member
    7268                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    7269                      .dwattr $C$DW$327, DW_AT_name("AIO12")
    7270                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_AIO12")
    7271                      .dwattr $C$DW$327, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    7272                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7273                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    7274              $C$DW$328       .dwtag  DW_TAG_member
    7275                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    7276                      .dwattr $C$DW$328, DW_AT_name("rsvd9")
    7277                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_rsvd9")
    7278                      .dwattr $C$DW$328, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    7279                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7280                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    7281              $C$DW$329       .dwtag  DW_TAG_member
    7282                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    7283                      .dwattr $C$DW$329, DW_AT_name("AIO14")
    7284                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_AIO14")
    7285                      .dwattr $C$DW$329, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    7286                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7287                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7288              $C$DW$330       .dwtag  DW_TAG_member
    7289                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    7290                      .dwattr $C$DW$330, DW_AT_name("rsvd10")
    7291                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_rsvd10")
    7292                      .dwattr $C$DW$330, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    7293                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7294                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7295                      .dwendtag $C$DW$T$20
    7296              
    7297              
    7298              $C$DW$T$21      .dwtag  DW_TAG_union_type
    7299                      .dwattr $C$DW$T$21, DW_AT_name("AIODAT_REG")
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  159

    7300                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    7301              $C$DW$331       .dwtag  DW_TAG_member
    7302                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    7303                      .dwattr $C$DW$331, DW_AT_name("all")
    7304                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_all")
    7305                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7306                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7307              $C$DW$332       .dwtag  DW_TAG_member
    7308                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    7309                      .dwattr $C$DW$332, DW_AT_name("bit")
    7310                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_bit")
    7311                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7312                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    7313                      .dwendtag $C$DW$T$21
    7314              
    7315              
    7316              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7317                      .dwattr $C$DW$T$22, DW_AT_name("GPADAT_BITS")
    7318                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    7319              $C$DW$333       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    7321                      .dwattr $C$DW$333, DW_AT_name("GPIO0")
    7322                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_GPIO0")
    7323                      .dwattr $C$DW$333, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7324                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7325                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7326              $C$DW$334       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    7328                      .dwattr $C$DW$334, DW_AT_name("GPIO1")
    7329                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_GPIO1")
    7330                      .dwattr $C$DW$334, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7331                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7332                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7333              $C$DW$335       .dwtag  DW_TAG_member
    7334                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    7335                      .dwattr $C$DW$335, DW_AT_name("GPIO2")
    7336                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_GPIO2")
    7337                      .dwattr $C$DW$335, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7338                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7339                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    7340              $C$DW$336       .dwtag  DW_TAG_member
    7341                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    7342                      .dwattr $C$DW$336, DW_AT_name("GPIO3")
    7343                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_GPIO3")
    7344                      .dwattr $C$DW$336, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7345                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7346                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    7347              $C$DW$337       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    7349                      .dwattr $C$DW$337, DW_AT_name("GPIO4")
    7350                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_GPIO4")
    7351                      .dwattr $C$DW$337, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7352                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7353                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7354              $C$DW$338       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  160

    7355                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    7356                      .dwattr $C$DW$338, DW_AT_name("GPIO5")
    7357                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_GPIO5")
    7358                      .dwattr $C$DW$338, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    7359                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7360                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7361              $C$DW$339       .dwtag  DW_TAG_member
    7362                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    7363                      .dwattr $C$DW$339, DW_AT_name("GPIO6")
    7364                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_GPIO6")
    7365                      .dwattr $C$DW$339, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    7366                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7367                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7368              $C$DW$340       .dwtag  DW_TAG_member
    7369                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    7370                      .dwattr $C$DW$340, DW_AT_name("GPIO7")
    7371                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_GPIO7")
    7372                      .dwattr $C$DW$340, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    7373                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7374                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7375              $C$DW$341       .dwtag  DW_TAG_member
    7376                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    7377                      .dwattr $C$DW$341, DW_AT_name("GPIO8")
    7378                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_GPIO8")
    7379                      .dwattr $C$DW$341, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    7380                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7381                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7382              $C$DW$342       .dwtag  DW_TAG_member
    7383                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    7384                      .dwattr $C$DW$342, DW_AT_name("GPIO9")
    7385                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_GPIO9")
    7386                      .dwattr $C$DW$342, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    7387                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7388                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7389              $C$DW$343       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    7391                      .dwattr $C$DW$343, DW_AT_name("GPIO10")
    7392                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_GPIO10")
    7393                      .dwattr $C$DW$343, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    7394                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7395                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7396              $C$DW$344       .dwtag  DW_TAG_member
    7397                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    7398                      .dwattr $C$DW$344, DW_AT_name("GPIO11")
    7399                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_GPIO11")
    7400                      .dwattr $C$DW$344, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    7401                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7402                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7403              $C$DW$345       .dwtag  DW_TAG_member
    7404                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    7405                      .dwattr $C$DW$345, DW_AT_name("GPIO12")
    7406                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_GPIO12")
    7407                      .dwattr $C$DW$345, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    7408                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7409                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  161

    7410              $C$DW$346       .dwtag  DW_TAG_member
    7411                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    7412                      .dwattr $C$DW$346, DW_AT_name("GPIO13")
    7413                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_GPIO13")
    7414                      .dwattr $C$DW$346, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    7415                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7416                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7417              $C$DW$347       .dwtag  DW_TAG_member
    7418                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    7419                      .dwattr $C$DW$347, DW_AT_name("GPIO14")
    7420                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_GPIO14")
    7421                      .dwattr $C$DW$347, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    7422                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7423                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7424              $C$DW$348       .dwtag  DW_TAG_member
    7425                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    7426                      .dwattr $C$DW$348, DW_AT_name("GPIO15")
    7427                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_GPIO15")
    7428                      .dwattr $C$DW$348, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    7429                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7430                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7431              $C$DW$349       .dwtag  DW_TAG_member
    7432                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    7433                      .dwattr $C$DW$349, DW_AT_name("GPIO16")
    7434                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_GPIO16")
    7435                      .dwattr $C$DW$349, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7436                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7437                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7438              $C$DW$350       .dwtag  DW_TAG_member
    7439                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    7440                      .dwattr $C$DW$350, DW_AT_name("GPIO17")
    7441                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_GPIO17")
    7442                      .dwattr $C$DW$350, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7443                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7444                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7445              $C$DW$351       .dwtag  DW_TAG_member
    7446                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    7447                      .dwattr $C$DW$351, DW_AT_name("GPIO18")
    7448                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_GPIO18")
    7449                      .dwattr $C$DW$351, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7450                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7451                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7452              $C$DW$352       .dwtag  DW_TAG_member
    7453                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    7454                      .dwattr $C$DW$352, DW_AT_name("GPIO19")
    7455                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_GPIO19")
    7456                      .dwattr $C$DW$352, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7457                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7458                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7459              $C$DW$353       .dwtag  DW_TAG_member
    7460                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    7461                      .dwattr $C$DW$353, DW_AT_name("GPIO20")
    7462                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_GPIO20")
    7463                      .dwattr $C$DW$353, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7464                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  162

    7465                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7466              $C$DW$354       .dwtag  DW_TAG_member
    7467                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    7468                      .dwattr $C$DW$354, DW_AT_name("GPIO21")
    7469                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_GPIO21")
    7470                      .dwattr $C$DW$354, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    7471                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7472                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7473              $C$DW$355       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    7475                      .dwattr $C$DW$355, DW_AT_name("GPIO22")
    7476                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_GPIO22")
    7477                      .dwattr $C$DW$355, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    7478                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7479                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7480              $C$DW$356       .dwtag  DW_TAG_member
    7481                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    7482                      .dwattr $C$DW$356, DW_AT_name("GPIO23")
    7483                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_GPIO23")
    7484                      .dwattr $C$DW$356, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    7485                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7486                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$357       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    7489                      .dwattr $C$DW$357, DW_AT_name("GPIO24")
    7490                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_GPIO24")
    7491                      .dwattr $C$DW$357, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    7492                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7493                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7494              $C$DW$358       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    7496                      .dwattr $C$DW$358, DW_AT_name("GPIO25")
    7497                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_GPIO25")
    7498                      .dwattr $C$DW$358, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    7499                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7500                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7501              $C$DW$359       .dwtag  DW_TAG_member
    7502                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    7503                      .dwattr $C$DW$359, DW_AT_name("GPIO26")
    7504                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_GPIO26")
    7505                      .dwattr $C$DW$359, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    7506                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7507                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7508              $C$DW$360       .dwtag  DW_TAG_member
    7509                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    7510                      .dwattr $C$DW$360, DW_AT_name("GPIO27")
    7511                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_GPIO27")
    7512                      .dwattr $C$DW$360, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    7513                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7514                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7515              $C$DW$361       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    7517                      .dwattr $C$DW$361, DW_AT_name("GPIO28")
    7518                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_GPIO28")
    7519                      .dwattr $C$DW$361, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  163

    7520                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7521                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7522              $C$DW$362       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    7524                      .dwattr $C$DW$362, DW_AT_name("GPIO29")
    7525                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_GPIO29")
    7526                      .dwattr $C$DW$362, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    7527                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7528                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7529              $C$DW$363       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    7531                      .dwattr $C$DW$363, DW_AT_name("GPIO30")
    7532                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_GPIO30")
    7533                      .dwattr $C$DW$363, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    7534                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7535                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7536              $C$DW$364       .dwtag  DW_TAG_member
    7537                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    7538                      .dwattr $C$DW$364, DW_AT_name("GPIO31")
    7539                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_GPIO31")
    7540                      .dwattr $C$DW$364, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    7541                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7542                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7543                      .dwendtag $C$DW$T$22
    7544              
    7545              
    7546              $C$DW$T$24      .dwtag  DW_TAG_union_type
    7547                      .dwattr $C$DW$T$24, DW_AT_name("GPADAT_REG")
    7548                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    7549              $C$DW$365       .dwtag  DW_TAG_member
    7550                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    7551                      .dwattr $C$DW$365, DW_AT_name("all")
    7552                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_all")
    7553                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7554                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7555              $C$DW$366       .dwtag  DW_TAG_member
    7556                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    7557                      .dwattr $C$DW$366, DW_AT_name("bit")
    7558                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_bit")
    7559                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7560                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7561                      .dwendtag $C$DW$T$24
    7562              
    7563              
    7564              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7565                      .dwattr $C$DW$T$25, DW_AT_name("GPBDAT_BITS")
    7566                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    7567              $C$DW$367       .dwtag  DW_TAG_member
    7568                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    7569                      .dwattr $C$DW$367, DW_AT_name("GPIO32")
    7570                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_GPIO32")
    7571                      .dwattr $C$DW$367, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7572                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7573                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7574              $C$DW$368       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  164

    7575                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    7576                      .dwattr $C$DW$368, DW_AT_name("GPIO33")
    7577                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_GPIO33")
    7578                      .dwattr $C$DW$368, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7579                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7580                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7581              $C$DW$369       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    7583                      .dwattr $C$DW$369, DW_AT_name("GPIO34")
    7584                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_GPIO34")
    7585                      .dwattr $C$DW$369, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7586                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7587                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7588              $C$DW$370       .dwtag  DW_TAG_member
    7589                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    7590                      .dwattr $C$DW$370, DW_AT_name("GPIO35")
    7591                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_GPIO35")
    7592                      .dwattr $C$DW$370, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7593                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7594                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7595              $C$DW$371       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    7597                      .dwattr $C$DW$371, DW_AT_name("GPIO36")
    7598                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_GPIO36")
    7599                      .dwattr $C$DW$371, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7600                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7601                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7602              $C$DW$372       .dwtag  DW_TAG_member
    7603                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    7604                      .dwattr $C$DW$372, DW_AT_name("GPIO37")
    7605                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_GPIO37")
    7606                      .dwattr $C$DW$372, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    7607                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7608                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7609              $C$DW$373       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    7611                      .dwattr $C$DW$373, DW_AT_name("GPIO38")
    7612                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_GPIO38")
    7613                      .dwattr $C$DW$373, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    7614                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7615                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7616              $C$DW$374       .dwtag  DW_TAG_member
    7617                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    7618                      .dwattr $C$DW$374, DW_AT_name("GPIO39")
    7619                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_GPIO39")
    7620                      .dwattr $C$DW$374, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    7621                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7622                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7623              $C$DW$375       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    7625                      .dwattr $C$DW$375, DW_AT_name("GPIO40")
    7626                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_GPIO40")
    7627                      .dwattr $C$DW$375, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    7628                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7629                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  165

    7630              $C$DW$376       .dwtag  DW_TAG_member
    7631                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    7632                      .dwattr $C$DW$376, DW_AT_name("GPIO41")
    7633                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_GPIO41")
    7634                      .dwattr $C$DW$376, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    7635                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7636                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7637              $C$DW$377       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    7639                      .dwattr $C$DW$377, DW_AT_name("GPIO42")
    7640                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_GPIO42")
    7641                      .dwattr $C$DW$377, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    7642                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7643                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7644              $C$DW$378       .dwtag  DW_TAG_member
    7645                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    7646                      .dwattr $C$DW$378, DW_AT_name("GPIO43")
    7647                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_GPIO43")
    7648                      .dwattr $C$DW$378, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    7649                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7650                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7651              $C$DW$379       .dwtag  DW_TAG_member
    7652                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    7653                      .dwattr $C$DW$379, DW_AT_name("GPIO44")
    7654                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_GPIO44")
    7655                      .dwattr $C$DW$379, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    7656                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7657                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7658              $C$DW$380       .dwtag  DW_TAG_member
    7659                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    7660                      .dwattr $C$DW$380, DW_AT_name("rsvd1")
    7661                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd1")
    7662                      .dwattr $C$DW$380, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    7663                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7664                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7665              $C$DW$381       .dwtag  DW_TAG_member
    7666                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    7667                      .dwattr $C$DW$381, DW_AT_name("rsvd2")
    7668                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd2")
    7669                      .dwattr $C$DW$381, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    7670                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7671                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7672                      .dwendtag $C$DW$T$25
    7673              
    7674              
    7675              $C$DW$T$26      .dwtag  DW_TAG_union_type
    7676                      .dwattr $C$DW$T$26, DW_AT_name("GPBDAT_REG")
    7677                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    7678              $C$DW$382       .dwtag  DW_TAG_member
    7679                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    7680                      .dwattr $C$DW$382, DW_AT_name("all")
    7681                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_all")
    7682                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7683                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7684              $C$DW$383       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  166

    7685                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$25)
    7686                      .dwattr $C$DW$383, DW_AT_name("bit")
    7687                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_bit")
    7688                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7689                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7690                      .dwendtag $C$DW$T$26
    7691              
    7692              
    7693              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7694                      .dwattr $C$DW$T$28, DW_AT_name("GPIO_DATA_REGS")
    7695                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    7696              $C$DW$384       .dwtag  DW_TAG_member
    7697                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
    7698                      .dwattr $C$DW$384, DW_AT_name("GPADAT")
    7699                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_GPADAT")
    7700                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7701                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7702              $C$DW$385       .dwtag  DW_TAG_member
    7703                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$24)
    7704                      .dwattr $C$DW$385, DW_AT_name("GPASET")
    7705                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_GPASET")
    7706                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7707                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7708              $C$DW$386       .dwtag  DW_TAG_member
    7709                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$24)
    7710                      .dwattr $C$DW$386, DW_AT_name("GPACLEAR")
    7711                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_GPACLEAR")
    7712                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7713                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7714              $C$DW$387       .dwtag  DW_TAG_member
    7715                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$24)
    7716                      .dwattr $C$DW$387, DW_AT_name("GPATOGGLE")
    7717                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_GPATOGGLE")
    7718                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7719                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7720              $C$DW$388       .dwtag  DW_TAG_member
    7721                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$26)
    7722                      .dwattr $C$DW$388, DW_AT_name("GPBDAT")
    7723                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_GPBDAT")
    7724                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7725                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7726              $C$DW$389       .dwtag  DW_TAG_member
    7727                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$26)
    7728                      .dwattr $C$DW$389, DW_AT_name("GPBSET")
    7729                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_GPBSET")
    7730                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7731                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7732              $C$DW$390       .dwtag  DW_TAG_member
    7733                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$26)
    7734                      .dwattr $C$DW$390, DW_AT_name("GPBCLEAR")
    7735                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_GPBCLEAR")
    7736                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7737                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7738              $C$DW$391       .dwtag  DW_TAG_member
    7739                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  167

    7740                      .dwattr $C$DW$391, DW_AT_name("GPBTOGGLE")
    7741                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_GPBTOGGLE")
    7742                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7743                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    7744              $C$DW$392       .dwtag  DW_TAG_member
    7745                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$27)
    7746                      .dwattr $C$DW$392, DW_AT_name("rsvd1")
    7747                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd1")
    7748                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7749                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7750              $C$DW$393       .dwtag  DW_TAG_member
    7751                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    7752                      .dwattr $C$DW$393, DW_AT_name("AIODAT")
    7753                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_AIODAT")
    7754                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7755                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    7756              $C$DW$394       .dwtag  DW_TAG_member
    7757                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    7758                      .dwattr $C$DW$394, DW_AT_name("rsvd2")
    7759                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_rsvd2")
    7760                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7761                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    7762              $C$DW$395       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    7764                      .dwattr $C$DW$395, DW_AT_name("AIOSET")
    7765                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_AIOSET")
    7766                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7767                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    7768              $C$DW$396       .dwtag  DW_TAG_member
    7769                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    7770                      .dwattr $C$DW$396, DW_AT_name("rsvd3")
    7771                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd3")
    7772                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7773                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    7774              $C$DW$397       .dwtag  DW_TAG_member
    7775                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    7776                      .dwattr $C$DW$397, DW_AT_name("AIOCLEAR")
    7777                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_AIOCLEAR")
    7778                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7779                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    7780              $C$DW$398       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    7782                      .dwattr $C$DW$398, DW_AT_name("rsvd4")
    7783                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_rsvd4")
    7784                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7785                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    7786              $C$DW$399       .dwtag  DW_TAG_member
    7787                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    7788                      .dwattr $C$DW$399, DW_AT_name("AIOTOGGLE")
    7789                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_AIOTOGGLE")
    7790                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7791                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    7792              $C$DW$400       .dwtag  DW_TAG_member
    7793                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    7794                      .dwattr $C$DW$400, DW_AT_name("rsvd5")
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  168

    7795                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd5")
    7796                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7797                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    7798                      .dwendtag $C$DW$T$28
    7799              
    7800              $C$DW$401       .dwtag  DW_TAG_TI_far_type
    7801                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$28)
    7802              $C$DW$T$59      .dwtag  DW_TAG_volatile_type
    7803                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$401)
    7804              
    7805              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7806                      .dwattr $C$DW$T$29, DW_AT_name("PIEACK_BITS")
    7807                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    7808              $C$DW$402       .dwtag  DW_TAG_member
    7809                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    7810                      .dwattr $C$DW$402, DW_AT_name("ACK1")
    7811                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_ACK1")
    7812                      .dwattr $C$DW$402, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7813                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7814                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    7815              $C$DW$403       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    7817                      .dwattr $C$DW$403, DW_AT_name("ACK2")
    7818                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_ACK2")
    7819                      .dwattr $C$DW$403, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7820                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7821                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    7822              $C$DW$404       .dwtag  DW_TAG_member
    7823                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    7824                      .dwattr $C$DW$404, DW_AT_name("ACK3")
    7825                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_ACK3")
    7826                      .dwattr $C$DW$404, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7827                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7828                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    7829              $C$DW$405       .dwtag  DW_TAG_member
    7830                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    7831                      .dwattr $C$DW$405, DW_AT_name("ACK4")
    7832                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ACK4")
    7833                      .dwattr $C$DW$405, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7834                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7835                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    7836              $C$DW$406       .dwtag  DW_TAG_member
    7837                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    7838                      .dwattr $C$DW$406, DW_AT_name("ACK5")
    7839                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ACK5")
    7840                      .dwattr $C$DW$406, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7841                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7842                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    7843              $C$DW$407       .dwtag  DW_TAG_member
    7844                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    7845                      .dwattr $C$DW$407, DW_AT_name("ACK6")
    7846                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_ACK6")
    7847                      .dwattr $C$DW$407, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    7848                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7849                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  169

    7850              $C$DW$408       .dwtag  DW_TAG_member
    7851                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    7852                      .dwattr $C$DW$408, DW_AT_name("ACK7")
    7853                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ACK7")
    7854                      .dwattr $C$DW$408, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    7855                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7856                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7857              $C$DW$409       .dwtag  DW_TAG_member
    7858                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    7859                      .dwattr $C$DW$409, DW_AT_name("ACK8")
    7860                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_ACK8")
    7861                      .dwattr $C$DW$409, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    7862                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7863                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7864              $C$DW$410       .dwtag  DW_TAG_member
    7865                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    7866                      .dwattr $C$DW$410, DW_AT_name("ACK9")
    7867                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ACK9")
    7868                      .dwattr $C$DW$410, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    7869                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7870                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7871              $C$DW$411       .dwtag  DW_TAG_member
    7872                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    7873                      .dwattr $C$DW$411, DW_AT_name("ACK10")
    7874                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ACK10")
    7875                      .dwattr $C$DW$411, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    7876                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7877                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7878              $C$DW$412       .dwtag  DW_TAG_member
    7879                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    7880                      .dwattr $C$DW$412, DW_AT_name("ACK11")
    7881                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_ACK11")
    7882                      .dwattr $C$DW$412, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    7883                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7884                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7885              $C$DW$413       .dwtag  DW_TAG_member
    7886                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    7887                      .dwattr $C$DW$413, DW_AT_name("ACK12")
    7888                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ACK12")
    7889                      .dwattr $C$DW$413, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    7890                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7891                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7892              $C$DW$414       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    7894                      .dwattr $C$DW$414, DW_AT_name("rsvd")
    7895                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd")
    7896                      .dwattr $C$DW$414, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    7897                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7898                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7899                      .dwendtag $C$DW$T$29
    7900              
    7901              
    7902              $C$DW$T$30      .dwtag  DW_TAG_union_type
    7903                      .dwattr $C$DW$T$30, DW_AT_name("PIEACK_REG")
    7904                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  170

    7905              $C$DW$415       .dwtag  DW_TAG_member
    7906                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    7907                      .dwattr $C$DW$415, DW_AT_name("all")
    7908                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_all")
    7909                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7910                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7911              $C$DW$416       .dwtag  DW_TAG_member
    7912                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$29)
    7913                      .dwattr $C$DW$416, DW_AT_name("bit")
    7914                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_bit")
    7915                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7916                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    7917                      .dwendtag $C$DW$T$30
    7918              
    7919              
    7920              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7921                      .dwattr $C$DW$T$31, DW_AT_name("PIECTRL_BITS")
    7922                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    7923              $C$DW$417       .dwtag  DW_TAG_member
    7924                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
    7925                      .dwattr $C$DW$417, DW_AT_name("ENPIE")
    7926                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_ENPIE")
    7927                      .dwattr $C$DW$417, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7928                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7929                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7930              $C$DW$418       .dwtag  DW_TAG_member
    7931                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
    7932                      .dwattr $C$DW$418, DW_AT_name("PIEVECT")
    7933                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_PIEVECT")
    7934                      .dwattr $C$DW$418, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    7935                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7936                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7937                      .dwendtag $C$DW$T$31
    7938              
    7939              
    7940              $C$DW$T$32      .dwtag  DW_TAG_union_type
    7941                      .dwattr $C$DW$T$32, DW_AT_name("PIECTRL_REG")
    7942                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    7943              $C$DW$419       .dwtag  DW_TAG_member
    7944                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    7945                      .dwattr $C$DW$419, DW_AT_name("all")
    7946                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_all")
    7947                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7948                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7949              $C$DW$420       .dwtag  DW_TAG_member
    7950                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$31)
    7951                      .dwattr $C$DW$420, DW_AT_name("bit")
    7952                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_bit")
    7953                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7954                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7955                      .dwendtag $C$DW$T$32
    7956              
    7957              
    7958              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7959                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER_BITS")
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  171

    7960                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    7961              $C$DW$421       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
    7963                      .dwattr $C$DW$421, DW_AT_name("INTx1")
    7964                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_INTx1")
    7965                      .dwattr $C$DW$421, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7966                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7967                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7968              $C$DW$422       .dwtag  DW_TAG_member
    7969                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$19)
    7970                      .dwattr $C$DW$422, DW_AT_name("INTx2")
    7971                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_INTx2")
    7972                      .dwattr $C$DW$422, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7973                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7974                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7975              $C$DW$423       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$19)
    7977                      .dwattr $C$DW$423, DW_AT_name("INTx3")
    7978                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_INTx3")
    7979                      .dwattr $C$DW$423, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7980                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7981                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    7982              $C$DW$424       .dwtag  DW_TAG_member
    7983                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    7984                      .dwattr $C$DW$424, DW_AT_name("INTx4")
    7985                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_INTx4")
    7986                      .dwattr $C$DW$424, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7987                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7988                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    7989              $C$DW$425       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    7991                      .dwattr $C$DW$425, DW_AT_name("INTx5")
    7992                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_INTx5")
    7993                      .dwattr $C$DW$425, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7994                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7995                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    7996              $C$DW$426       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    7998                      .dwattr $C$DW$426, DW_AT_name("INTx6")
    7999                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_INTx6")
    8000                      .dwattr $C$DW$426, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8001                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8002                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    8003              $C$DW$427       .dwtag  DW_TAG_member
    8004                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    8005                      .dwattr $C$DW$427, DW_AT_name("INTx7")
    8006                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_INTx7")
    8007                      .dwattr $C$DW$427, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    8008                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8009                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    8010              $C$DW$428       .dwtag  DW_TAG_member
    8011                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    8012                      .dwattr $C$DW$428, DW_AT_name("INTx8")
    8013                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_INTx8")
    8014                      .dwattr $C$DW$428, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  172

    8015                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8016                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    8017              $C$DW$429       .dwtag  DW_TAG_member
    8018                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    8019                      .dwattr $C$DW$429, DW_AT_name("rsvd")
    8020                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_rsvd")
    8021                      .dwattr $C$DW$429, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    8022                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8023                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    8024                      .dwendtag $C$DW$T$33
    8025              
    8026              
    8027              $C$DW$T$34      .dwtag  DW_TAG_union_type
    8028                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER_REG")
    8029                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    8030              $C$DW$430       .dwtag  DW_TAG_member
    8031                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    8032                      .dwattr $C$DW$430, DW_AT_name("all")
    8033                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_all")
    8034                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8035                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    8036              $C$DW$431       .dwtag  DW_TAG_member
    8037                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$33)
    8038                      .dwattr $C$DW$431, DW_AT_name("bit")
    8039                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_bit")
    8040                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8041                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    8042                      .dwendtag $C$DW$T$34
    8043              
    8044              
    8045              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8046                      .dwattr $C$DW$T$35, DW_AT_name("PIEIFR_BITS")
    8047                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    8048              $C$DW$432       .dwtag  DW_TAG_member
    8049                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    8050                      .dwattr $C$DW$432, DW_AT_name("INTx1")
    8051                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_INTx1")
    8052                      .dwattr $C$DW$432, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    8053                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8054                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    8055              $C$DW$433       .dwtag  DW_TAG_member
    8056                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    8057                      .dwattr $C$DW$433, DW_AT_name("INTx2")
    8058                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_INTx2")
    8059                      .dwattr $C$DW$433, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    8060                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8061                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    8062              $C$DW$434       .dwtag  DW_TAG_member
    8063                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    8064                      .dwattr $C$DW$434, DW_AT_name("INTx3")
    8065                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_INTx3")
    8066                      .dwattr $C$DW$434, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    8067                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8068                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    8069              $C$DW$435       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  173

    8070                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
    8071                      .dwattr $C$DW$435, DW_AT_name("INTx4")
    8072                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_INTx4")
    8073                      .dwattr $C$DW$435, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    8074                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8075                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    8076              $C$DW$436       .dwtag  DW_TAG_member
    8077                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    8078                      .dwattr $C$DW$436, DW_AT_name("INTx5")
    8079                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_INTx5")
    8080                      .dwattr $C$DW$436, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    8081                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8082                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    8083              $C$DW$437       .dwtag  DW_TAG_member
    8084                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$19)
    8085                      .dwattr $C$DW$437, DW_AT_name("INTx6")
    8086                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_INTx6")
    8087                      .dwattr $C$DW$437, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8088                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8089                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    8090              $C$DW$438       .dwtag  DW_TAG_member
    8091                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$19)
    8092                      .dwattr $C$DW$438, DW_AT_name("INTx7")
    8093                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_INTx7")
    8094                      .dwattr $C$DW$438, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    8095                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8096                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    8097              $C$DW$439       .dwtag  DW_TAG_member
    8098                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$19)
    8099                      .dwattr $C$DW$439, DW_AT_name("INTx8")
    8100                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_INTx8")
    8101                      .dwattr $C$DW$439, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    8102                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8103                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    8104              $C$DW$440       .dwtag  DW_TAG_member
    8105                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    8106                      .dwattr $C$DW$440, DW_AT_name("rsvd")
    8107                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd")
    8108                      .dwattr $C$DW$440, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    8109                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8110                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    8111                      .dwendtag $C$DW$T$35
    8112              
    8113              
    8114              $C$DW$T$36      .dwtag  DW_TAG_union_type
    8115                      .dwattr $C$DW$T$36, DW_AT_name("PIEIFR_REG")
    8116                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8117              $C$DW$441       .dwtag  DW_TAG_member
    8118                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    8119                      .dwattr $C$DW$441, DW_AT_name("all")
    8120                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_all")
    8121                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8122                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    8123              $C$DW$442       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  174

    8125                      .dwattr $C$DW$442, DW_AT_name("bit")
    8126                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_bit")
    8127                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8128                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    8129                      .dwendtag $C$DW$T$36
    8130              
    8131              
    8132              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8133                      .dwattr $C$DW$T$37, DW_AT_name("PIE_CTRL_REGS")
    8134                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x1a)
    8135              $C$DW$443       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$32)
    8137                      .dwattr $C$DW$443, DW_AT_name("PIECTRL")
    8138                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_PIECTRL")
    8139                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8140                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    8141              $C$DW$444       .dwtag  DW_TAG_member
    8142                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$30)
    8143                      .dwattr $C$DW$444, DW_AT_name("PIEACK")
    8144                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_PIEACK")
    8145                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8146                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    8147              $C$DW$445       .dwtag  DW_TAG_member
    8148                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$34)
    8149                      .dwattr $C$DW$445, DW_AT_name("PIEIER1")
    8150                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_PIEIER1")
    8151                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8152                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    8153              $C$DW$446       .dwtag  DW_TAG_member
    8154                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$36)
    8155                      .dwattr $C$DW$446, DW_AT_name("PIEIFR1")
    8156                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_PIEIFR1")
    8157                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8158                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    8159              $C$DW$447       .dwtag  DW_TAG_member
    8160                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$34)
    8161                      .dwattr $C$DW$447, DW_AT_name("PIEIER2")
    8162                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_PIEIER2")
    8163                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8164                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    8165              $C$DW$448       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$36)
    8167                      .dwattr $C$DW$448, DW_AT_name("PIEIFR2")
    8168                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_PIEIFR2")
    8169                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8170                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    8171              $C$DW$449       .dwtag  DW_TAG_member
    8172                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$34)
    8173                      .dwattr $C$DW$449, DW_AT_name("PIEIER3")
    8174                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_PIEIER3")
    8175                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8176                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    8177              $C$DW$450       .dwtag  DW_TAG_member
    8178                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$36)
    8179                      .dwattr $C$DW$450, DW_AT_name("PIEIFR3")
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  175

    8180                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_PIEIFR3")
    8181                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8182                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    8183              $C$DW$451       .dwtag  DW_TAG_member
    8184                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$34)
    8185                      .dwattr $C$DW$451, DW_AT_name("PIEIER4")
    8186                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_PIEIER4")
    8187                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8188                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    8189              $C$DW$452       .dwtag  DW_TAG_member
    8190                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$36)
    8191                      .dwattr $C$DW$452, DW_AT_name("PIEIFR4")
    8192                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_PIEIFR4")
    8193                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8194                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    8195              $C$DW$453       .dwtag  DW_TAG_member
    8196                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$34)
    8197                      .dwattr $C$DW$453, DW_AT_name("PIEIER5")
    8198                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_PIEIER5")
    8199                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8200                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    8201              $C$DW$454       .dwtag  DW_TAG_member
    8202                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$36)
    8203                      .dwattr $C$DW$454, DW_AT_name("PIEIFR5")
    8204                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_PIEIFR5")
    8205                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8206                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    8207              $C$DW$455       .dwtag  DW_TAG_member
    8208                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$34)
    8209                      .dwattr $C$DW$455, DW_AT_name("PIEIER6")
    8210                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_PIEIER6")
    8211                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8212                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    8213              $C$DW$456       .dwtag  DW_TAG_member
    8214                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$36)
    8215                      .dwattr $C$DW$456, DW_AT_name("PIEIFR6")
    8216                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_PIEIFR6")
    8217                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8218                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8219              $C$DW$457       .dwtag  DW_TAG_member
    8220                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$34)
    8221                      .dwattr $C$DW$457, DW_AT_name("PIEIER7")
    8222                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_PIEIER7")
    8223                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8224                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8225              $C$DW$458       .dwtag  DW_TAG_member
    8226                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$36)
    8227                      .dwattr $C$DW$458, DW_AT_name("PIEIFR7")
    8228                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_PIEIFR7")
    8229                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8230                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8231              $C$DW$459       .dwtag  DW_TAG_member
    8232                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$34)
    8233                      .dwattr $C$DW$459, DW_AT_name("PIEIER8")
    8234                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_PIEIER8")
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  176

    8235                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8236                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8237              $C$DW$460       .dwtag  DW_TAG_member
    8238                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$36)
    8239                      .dwattr $C$DW$460, DW_AT_name("PIEIFR8")
    8240                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_PIEIFR8")
    8241                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8242                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8243              $C$DW$461       .dwtag  DW_TAG_member
    8244                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$34)
    8245                      .dwattr $C$DW$461, DW_AT_name("PIEIER9")
    8246                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_PIEIER9")
    8247                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8248                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8249              $C$DW$462       .dwtag  DW_TAG_member
    8250                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$36)
    8251                      .dwattr $C$DW$462, DW_AT_name("PIEIFR9")
    8252                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_PIEIFR9")
    8253                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8254                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8255              $C$DW$463       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$34)
    8257                      .dwattr $C$DW$463, DW_AT_name("PIEIER10")
    8258                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_PIEIER10")
    8259                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8260                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8261              $C$DW$464       .dwtag  DW_TAG_member
    8262                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$36)
    8263                      .dwattr $C$DW$464, DW_AT_name("PIEIFR10")
    8264                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_PIEIFR10")
    8265                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8266                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8267              $C$DW$465       .dwtag  DW_TAG_member
    8268                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$34)
    8269                      .dwattr $C$DW$465, DW_AT_name("PIEIER11")
    8270                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_PIEIER11")
    8271                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8272                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8273              $C$DW$466       .dwtag  DW_TAG_member
    8274                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$36)
    8275                      .dwattr $C$DW$466, DW_AT_name("PIEIFR11")
    8276                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_PIEIFR11")
    8277                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8278                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8279              $C$DW$467       .dwtag  DW_TAG_member
    8280                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$34)
    8281                      .dwattr $C$DW$467, DW_AT_name("PIEIER12")
    8282                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_PIEIER12")
    8283                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8284                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8285              $C$DW$468       .dwtag  DW_TAG_member
    8286                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$36)
    8287                      .dwattr $C$DW$468, DW_AT_name("PIEIFR12")
    8288                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_PIEIFR12")
    8289                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C2000 Assembler PC v6.4.10 Fri Dec 15 06:46:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\0558410                            PAGE  177

    8290                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8291                      .dwendtag $C$DW$T$37
    8292              
    8293              $C$DW$469       .dwtag  DW_TAG_TI_far_type
    8294                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$37)
    8295              $C$DW$T$62      .dwtag  DW_TAG_volatile_type
    8296                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$469)
    8297              
    8298              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8299                      .dwattr $C$DW$T$38, DW_AT_name("SCICCR_BITS")
    8300                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    8301              $C$DW$470       .dwtag  DW_TAG_member
    8302                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    8303                      .dwattr $C$DW$470, DW_AT_name("SCICHAR")
    8304                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SCICHAR")
    8305                      .dwattr $C$DW$470, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    8306                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8307                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8308              $C$DW$471       .dwtag  DW_TAG_member
    8309                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    8310                      .dwattr $C$DW$471, DW_AT_name("ADDRIDLE_MODE")
    8311                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ADDRIDLE_MODE")
    8312                      .dwattr $C$DW$471, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    8313                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8314                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8315              $C$DW$472       .dwtag  DW_TAG_member
    8316                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    8317                      .dwattr $C$DW$472, DW_AT_name("LOOPBKENA")
    8318                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_LOOPBKENA")
    8319                      .dwattr $C$DW$472, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    8320                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8321                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8322              $C$DW$473       .dwtag  DW_TAG_member
    8323                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    8324                      .dwattr $C$DW$473, DW_AT_name("PARITYENA")
    8325                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_PARITYENA")
    8326                      .dwattr $C$DW$473, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8327                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8328                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
