TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:46 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/Solar Microinverter_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2497                      .dwpsn  file "../source/Solar Microinverter_main.c",line 651,column 6,is_stmt,isa 0
    2498 0000006a 1A18!         OR        @_ECap1Regs+24,#0x0004 ; [CPU_] |651| 
         0000006b 0004 
    2499                      .dwpsn  file "../source/Solar Microinverter_main.c",line 652,column 6,is_stmt,isa 0
    2500 0000006c 1A18!         OR        @_ECap1Regs+24,#0x0001 ; [CPU_] |652| 
         0000006d 0001 
    2501 0000006e 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_U] 
         0000006f 0000 
    2502                      .dwpsn  file "../source/Solar Microinverter_main.c",line 654,column 5,is_stmt,isa 0
    2503 00000070 56BF!         MOVB      @_PieCtrlRegs+1,#8,UNC ; [CPU_] |654| 
         00000071 0801 
    2504 00000072 3B10   setc INTM
    2505 00000073 761A   EDIS
    2506 00000074 7617          NASP      ; [CPU_] 
    2507              $C$DW$125       .dwtag  DW_TAG_TI_branch
    2508                      .dwattr $C$DW$125, DW_AT_low_pc(0x00)
    2509                      .dwattr $C$DW$125, DW_AT_TI_return
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   54

    2510              
    2511 00000075 7602          IRET      ; [CPU_] 
    2512                      ; return occurs ; [] 
    2513                      .dwattr $C$DW$124, DW_AT_TI_end_file("../source/Solar Microinverter_main.c")
    2514                      .dwattr $C$DW$124, DW_AT_TI_end_line(0x294)
    2515                      .dwattr $C$DW$124, DW_AT_TI_end_column(0x01)
    2516                      .dwendentry
    2517                      .dwendtag $C$DW$124
    2518              
    2519              ;**************************************************************
    2520              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2521              ;**************************************************************
    2522                      .global _variablePI
    2523                      .global _statemachine
    2524                      .global _tx_gsm
    2525                      .global _InitEPwmSyncGpio
    2526                      .global _adc_isr
    2527                      .global _InitPieCtrl
    2528                      .global _InitEPwm3Gpio
    2529                      .global _InitSciaGpio
    2530                      .global _InitPieVectTable
    2531                      .global _InitECap1Gpio
    2532                      .global _InitAdc
    2533                      .global _InitEPwm2Gpio
    2534                      .global _InitEPwm1Gpio
    2535                      .global _oi_uart
    2536                      .global _MemCopy
    2537                      .global _sciRxFifoIsr
    2538                      .global _sciTxFifoIsr
    2539                      .global _InitTzGpio
    2540                      .global _InitSysCtrl
    2541                      .global _InitFlash
    2542                      .global _ServiceDog
    2543                      .global _scia_fifo_init
    2544                      .global _RamconstsLoadEnd
    2545                      .global _RamconstsLoadStart
    2546                      .global _systemState
    2547                      .global _RamconstsRunStart
    2548                      .global _RamfuncsRunStart
    2549                      .global _RamfuncsLoadEnd
    2550                      .global _Rx_timeout
    2551                      .global _Tx_timeout
    2552                      .global _gridFlag
    2553                      .global _acoffset_cal2
    2554                      .global _GSM_Restart_Count
    2555                      .global _GSM_DelayCount
    2556                      .global _RS485_TXEnable_Count
    2557                      .global _VariablePIFlag
    2558                      .global _Rx_time_count
    2559                      .global _gsm_count
    2560                      .global _RamfuncsLoadStart
    2561                      .global _GSM_Repeat_Count
    2562                      .global _Comp2Regs
    2563                      .global _Comp3Regs
    2564                      .global _Comp1Regs
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   55

    2565                      .global _PieCtrlRegs
    2566                      .global _GpioDataRegs
    2567                      .global _ECap1Regs
    2568                      .global _SysCtrlRegs
    2569                      .global _EPwm2Regs
    2570                      .global _EPwm1Regs
    2571                      .global _EPwm3Regs
    2572                      .global _EPwm4Regs
    2573                      .global _GpioCtrlRegs
    2574                      .global _AdcRegs
    2575                      .global _PieVectTable
    2576              
    2577              ;***************************************************************
    2578              ;* TYPE INFORMATION                                            *
    2579              ;***************************************************************
    2580              
    2581              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2582                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
    2583                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    2584              $C$DW$126       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2586                      .dwattr $C$DW$126, DW_AT_name("TEMPCONV")
    2587                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_TEMPCONV")
    2588                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0f)
    2589                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2590                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2592              
    2593              $C$DW$127       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2595                      .dwattr $C$DW$127, DW_AT_name("VREFLOCONV")
    2596                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_VREFLOCONV")
    2597                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e)
    2598                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2599                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2601              
    2602              $C$DW$128       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2604                      .dwattr $C$DW$128, DW_AT_name("INTPULSEPOS")
    2605                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTPULSEPOS")
    2606                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d)
    2607                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2608                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2610              
    2611              $C$DW$129       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2613                      .dwattr $C$DW$129, DW_AT_name("ADCREFSEL")
    2614                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCREFSEL")
    2615                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    2616                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2617                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2618                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2619              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   56

    2620              $C$DW$130       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    2623                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    2624                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0b)
    2625                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2626                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2627                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2628              
    2629              $C$DW$131       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$131, DW_AT_name("ADCREFPWD")
    2632                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCREFPWD")
    2633                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0a)
    2634                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2635                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638              $C$DW$132       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$132, DW_AT_name("ADCBGPWD")
    2641                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCBGPWD")
    2642                      .dwattr $C$DW$132, DW_AT_bit_offset(0x09)
    2643                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647              $C$DW$133       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$133, DW_AT_name("ADCPWDN")
    2650                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCPWDN")
    2651                      .dwattr $C$DW$133, DW_AT_bit_offset(0x08)
    2652                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2653                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2654                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2655              
    2656              $C$DW$134       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2658                      .dwattr $C$DW$134, DW_AT_name("ADCBSYCHN")
    2659                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCBSYCHN")
    2660                      .dwattr $C$DW$134, DW_AT_bit_offset(0x03)
    2661                      .dwattr $C$DW$134, DW_AT_bit_size(0x05)
    2662                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2663                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2664              
    2665              $C$DW$135       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2667                      .dwattr $C$DW$135, DW_AT_name("ADCBSY")
    2668                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCBSY")
    2669                      .dwattr $C$DW$135, DW_AT_bit_offset(0x02)
    2670                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2671                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2672                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2673              
    2674              $C$DW$136       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   57

    2675                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2676                      .dwattr $C$DW$136, DW_AT_name("ADCENABLE")
    2677                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCENABLE")
    2678                      .dwattr $C$DW$136, DW_AT_bit_offset(0x01)
    2679                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2680                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2682              
    2683              $C$DW$137       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2685                      .dwattr $C$DW$137, DW_AT_name("RESET")
    2686                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_RESET")
    2687                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2688                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2689                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2691              
    2692                      .dwendtag $C$DW$T$20
    2693              
    2694              
    2695              $C$DW$T$21      .dwtag  DW_TAG_union_type
    2696                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
    2697                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    2698              $C$DW$138       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$138, DW_AT_name("all")
    2701                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    2702                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2704              
    2705              $C$DW$139       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    2707                      .dwattr $C$DW$139, DW_AT_name("bit")
    2708                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    2709                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2710                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2711              
    2712                      .dwendtag $C$DW$T$21
    2713              
    2714              
    2715              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2716                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
    2717                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2718              $C$DW$140       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2720                      .dwattr $C$DW$140, DW_AT_name("CLKDIV2EN")
    2721                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CLKDIV2EN")
    2722                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f)
    2723                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2724                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2725                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2726              
    2727              $C$DW$141       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2729                      .dwattr $C$DW$141, DW_AT_name("ADCNONOVERLAP")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   58

    2730                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
    2731                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e)
    2732                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2733                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2734                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2735              
    2736              $C$DW$142       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2738                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2739                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2740                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2741                      .dwattr $C$DW$142, DW_AT_bit_size(0x0e)
    2742                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2743                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2744              
    2745                      .dwendtag $C$DW$T$22
    2746              
    2747              
    2748              $C$DW$T$23      .dwtag  DW_TAG_union_type
    2749                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
    2750                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    2751              $C$DW$143       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2753                      .dwattr $C$DW$143, DW_AT_name("all")
    2754                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    2755                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2756                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2757              
    2758              $C$DW$144       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$22)
    2760                      .dwattr $C$DW$144, DW_AT_name("bit")
    2761                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    2762                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2763                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2764              
    2765                      .dwendtag $C$DW$T$23
    2766              
    2767              
    2768              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2769                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
    2770                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2771              $C$DW$145       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2773                      .dwattr $C$DW$145, DW_AT_name("SOC0")
    2774                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SOC0")
    2775                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    2776                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    2777                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2778                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2779              
    2780              $C$DW$146       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2782                      .dwattr $C$DW$146, DW_AT_name("SOC1")
    2783                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SOC1")
    2784                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   59

    2785                      .dwattr $C$DW$146, DW_AT_bit_size(0x02)
    2786                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2787                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2788              
    2789              $C$DW$147       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2791                      .dwattr $C$DW$147, DW_AT_name("SOC2")
    2792                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_SOC2")
    2793                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a)
    2794                      .dwattr $C$DW$147, DW_AT_bit_size(0x02)
    2795                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2797              
    2798              $C$DW$148       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2800                      .dwattr $C$DW$148, DW_AT_name("SOC3")
    2801                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_SOC3")
    2802                      .dwattr $C$DW$148, DW_AT_bit_offset(0x08)
    2803                      .dwattr $C$DW$148, DW_AT_bit_size(0x02)
    2804                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2805                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2806              
    2807              $C$DW$149       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2809                      .dwattr $C$DW$149, DW_AT_name("SOC4")
    2810                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SOC4")
    2811                      .dwattr $C$DW$149, DW_AT_bit_offset(0x06)
    2812                      .dwattr $C$DW$149, DW_AT_bit_size(0x02)
    2813                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2814                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2815              
    2816              $C$DW$150       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2818                      .dwattr $C$DW$150, DW_AT_name("SOC5")
    2819                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SOC5")
    2820                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04)
    2821                      .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    2822                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2823                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2824              
    2825              $C$DW$151       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2827                      .dwattr $C$DW$151, DW_AT_name("SOC6")
    2828                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SOC6")
    2829                      .dwattr $C$DW$151, DW_AT_bit_offset(0x02)
    2830                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    2831                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2832                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2833              
    2834              $C$DW$152       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2836                      .dwattr $C$DW$152, DW_AT_name("SOC7")
    2837                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SOC7")
    2838                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    2839                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   60

    2840                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2842              
    2843                      .dwendtag $C$DW$T$24
    2844              
    2845              
    2846              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2847                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
    2848                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2849              $C$DW$153       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2851                      .dwattr $C$DW$153, DW_AT_name("all")
    2852                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    2853                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2854                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2855              
    2856              $C$DW$154       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$24)
    2858                      .dwattr $C$DW$154, DW_AT_name("bit")
    2859                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    2860                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2861                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2862              
    2863                      .dwendtag $C$DW$T$25
    2864              
    2865              
    2866              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2867                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
    2868                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2869              $C$DW$155       .dwtag  DW_TAG_member
    2870                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2871                      .dwattr $C$DW$155, DW_AT_name("SOC8")
    2872                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_SOC8")
    2873                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e)
    2874                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2875                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2877              
    2878              $C$DW$156       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2880                      .dwattr $C$DW$156, DW_AT_name("SOC9")
    2881                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_SOC9")
    2882                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0c)
    2883                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    2884                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2885                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2886              
    2887              $C$DW$157       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2889                      .dwattr $C$DW$157, DW_AT_name("SOC10")
    2890                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SOC10")
    2891                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0a)
    2892                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2893                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   61

    2895              
    2896              $C$DW$158       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2898                      .dwattr $C$DW$158, DW_AT_name("SOC11")
    2899                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SOC11")
    2900                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08)
    2901                      .dwattr $C$DW$158, DW_AT_bit_size(0x02)
    2902                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2903                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2904              
    2905              $C$DW$159       .dwtag  DW_TAG_member
    2906                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2907                      .dwattr $C$DW$159, DW_AT_name("SOC12")
    2908                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SOC12")
    2909                      .dwattr $C$DW$159, DW_AT_bit_offset(0x06)
    2910                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    2911                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2912                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2913              
    2914              $C$DW$160       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2916                      .dwattr $C$DW$160, DW_AT_name("SOC13")
    2917                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_SOC13")
    2918                      .dwattr $C$DW$160, DW_AT_bit_offset(0x04)
    2919                      .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2920                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2921                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2922              
    2923              $C$DW$161       .dwtag  DW_TAG_member
    2924                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2925                      .dwattr $C$DW$161, DW_AT_name("SOC14")
    2926                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SOC14")
    2927                      .dwattr $C$DW$161, DW_AT_bit_offset(0x02)
    2928                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    2929                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2931              
    2932              $C$DW$162       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2934                      .dwattr $C$DW$162, DW_AT_name("SOC15")
    2935                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_SOC15")
    2936                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2937                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    2938                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2939                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2940              
    2941                      .dwendtag $C$DW$T$26
    2942              
    2943              
    2944              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2945                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
    2946                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2947              $C$DW$163       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2949                      .dwattr $C$DW$163, DW_AT_name("all")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   62

    2950                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    2951                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2953              
    2954              $C$DW$164       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$26)
    2956                      .dwattr $C$DW$164, DW_AT_name("bit")
    2957                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    2958                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2959                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2960              
    2961                      .dwendtag $C$DW$T$27
    2962              
    2963              
    2964              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2965                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
    2966                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2967              $C$DW$165       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2969                      .dwattr $C$DW$165, DW_AT_name("ADCINT1")
    2970                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ADCINT1")
    2971                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0f)
    2972                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2973                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2974                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2975              
    2976              $C$DW$166       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2978                      .dwattr $C$DW$166, DW_AT_name("ADCINT2")
    2979                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ADCINT2")
    2980                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0e)
    2981                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2982                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2983                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2984              
    2985              $C$DW$167       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2987                      .dwattr $C$DW$167, DW_AT_name("ADCINT3")
    2988                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ADCINT3")
    2989                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0d)
    2990                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2991                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2992                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2993              
    2994              $C$DW$168       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2996                      .dwattr $C$DW$168, DW_AT_name("ADCINT4")
    2997                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ADCINT4")
    2998                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0c)
    2999                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    3000                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3002              
    3003              $C$DW$169       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   63

    3005                      .dwattr $C$DW$169, DW_AT_name("ADCINT5")
    3006                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_ADCINT5")
    3007                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0b)
    3008                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3009                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3010                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3011              
    3012              $C$DW$170       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3014                      .dwattr $C$DW$170, DW_AT_name("ADCINT6")
    3015                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ADCINT6")
    3016                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0a)
    3017                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3018                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3019                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3020              
    3021              $C$DW$171       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3023                      .dwattr $C$DW$171, DW_AT_name("ADCINT7")
    3024                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ADCINT7")
    3025                      .dwattr $C$DW$171, DW_AT_bit_offset(0x09)
    3026                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3027                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3028                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3029              
    3030              $C$DW$172       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3032                      .dwattr $C$DW$172, DW_AT_name("ADCINT8")
    3033                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_ADCINT8")
    3034                      .dwattr $C$DW$172, DW_AT_bit_offset(0x08)
    3035                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3036                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3037                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3038              
    3039              $C$DW$173       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3041                      .dwattr $C$DW$173, DW_AT_name("ADCINT9")
    3042                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCINT9")
    3043                      .dwattr $C$DW$173, DW_AT_bit_offset(0x07)
    3044                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    3045                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3046                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3047              
    3048              $C$DW$174       .dwtag  DW_TAG_member
    3049                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3050                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    3051                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    3052                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    3053                      .dwattr $C$DW$174, DW_AT_bit_size(0x07)
    3054                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3055                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3056              
    3057                      .dwendtag $C$DW$T$28
    3058              
    3059              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   64

    3060              $C$DW$T$29      .dwtag  DW_TAG_union_type
    3061                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
    3062                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3063              $C$DW$175       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3065                      .dwattr $C$DW$175, DW_AT_name("all")
    3066                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    3067                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3068                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3069              
    3070              $C$DW$176       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$28)
    3072                      .dwattr $C$DW$176, DW_AT_name("bit")
    3073                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    3074                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3075                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3076              
    3077                      .dwendtag $C$DW$T$29
    3078              
    3079              
    3080              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3081                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
    3082                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    3083              $C$DW$177       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$30)
    3085                      .dwattr $C$DW$177, DW_AT_name("OFFTRIM")
    3086                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_OFFTRIM")
    3087                      .dwattr $C$DW$177, DW_AT_bit_offset(0x07)
    3088                      .dwattr $C$DW$177, DW_AT_bit_size(0x09)
    3089                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3090                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3091              
    3092              $C$DW$178       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3094                      .dwattr $C$DW$178, DW_AT_name("rsvd1")
    3095                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd1")
    3096                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    3097                      .dwattr $C$DW$178, DW_AT_bit_size(0x07)
    3098                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3099                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3100              
    3101                      .dwendtag $C$DW$T$31
    3102              
    3103              
    3104              $C$DW$T$32      .dwtag  DW_TAG_union_type
    3105                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
    3106                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    3107              $C$DW$179       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3109                      .dwattr $C$DW$179, DW_AT_name("all")
    3110                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    3111                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3113              
    3114              $C$DW$180       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   65

    3115                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    3116                      .dwattr $C$DW$180, DW_AT_name("bit")
    3117                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    3118                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3119                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3120              
    3121                      .dwendtag $C$DW$T$32
    3122              
    3123              
    3124              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3125                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
    3126                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3127              $C$DW$181       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3129                      .dwattr $C$DW$181, DW_AT_name("BG_FINE_TRIM")
    3130                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
    3131                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0c)
    3132                      .dwattr $C$DW$181, DW_AT_bit_size(0x04)
    3133                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3135              
    3136              $C$DW$182       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3138                      .dwattr $C$DW$182, DW_AT_name("BG_COARSE_TRIM")
    3139                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
    3140                      .dwattr $C$DW$182, DW_AT_bit_offset(0x07)
    3141                      .dwattr $C$DW$182, DW_AT_bit_size(0x05)
    3142                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3143                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3144              
    3145              $C$DW$183       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3147                      .dwattr $C$DW$183, DW_AT_name("EXTREF_FINE_TRIM")
    3148                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
    3149                      .dwattr $C$DW$183, DW_AT_bit_offset(0x02)
    3150                      .dwattr $C$DW$183, DW_AT_bit_size(0x05)
    3151                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3152                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3153              
    3154              $C$DW$184       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3156                      .dwattr $C$DW$184, DW_AT_name("rsvd1")
    3157                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd1")
    3158                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3159                      .dwattr $C$DW$184, DW_AT_bit_size(0x02)
    3160                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163                      .dwendtag $C$DW$T$33
    3164              
    3165              
    3166              $C$DW$T$34      .dwtag  DW_TAG_union_type
    3167                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
    3168                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3169              $C$DW$185       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   66

    3170                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3171                      .dwattr $C$DW$185, DW_AT_name("all")
    3172                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_all")
    3173                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3174                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3175              
    3176              $C$DW$186       .dwtag  DW_TAG_member
    3177                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$33)
    3178                      .dwattr $C$DW$186, DW_AT_name("bit")
    3179                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_bit")
    3180                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3181                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3182              
    3183                      .dwendtag $C$DW$T$34
    3184              
    3185              
    3186              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3187                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
    3188                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    3189              $C$DW$187       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3191                      .dwattr $C$DW$187, DW_AT_name("SIMULEN0")
    3192                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_SIMULEN0")
    3193                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0f)
    3194                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    3195                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3196                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3197              
    3198              $C$DW$188       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3200                      .dwattr $C$DW$188, DW_AT_name("SIMULEN2")
    3201                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_SIMULEN2")
    3202                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0e)
    3203                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    3204                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3205                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3206              
    3207              $C$DW$189       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3209                      .dwattr $C$DW$189, DW_AT_name("SIMULEN4")
    3210                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SIMULEN4")
    3211                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0d)
    3212                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    3213                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3214                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3215              
    3216              $C$DW$190       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3218                      .dwattr $C$DW$190, DW_AT_name("SIMULEN6")
    3219                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_SIMULEN6")
    3220                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0c)
    3221                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    3222                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3223                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3224              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   67

    3225              $C$DW$191       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3227                      .dwattr $C$DW$191, DW_AT_name("SIMULEN8")
    3228                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SIMULEN8")
    3229                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0b)
    3230                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3231                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3232                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3233              
    3234              $C$DW$192       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3236                      .dwattr $C$DW$192, DW_AT_name("SIMULEN10")
    3237                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_SIMULEN10")
    3238                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0a)
    3239                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3240                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3241                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3242              
    3243              $C$DW$193       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3245                      .dwattr $C$DW$193, DW_AT_name("SIMULEN12")
    3246                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_SIMULEN12")
    3247                      .dwattr $C$DW$193, DW_AT_bit_offset(0x09)
    3248                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    3249                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3250                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$194       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3254                      .dwattr $C$DW$194, DW_AT_name("SIMULEN14")
    3255                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SIMULEN14")
    3256                      .dwattr $C$DW$194, DW_AT_bit_offset(0x08)
    3257                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3258                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3260              
    3261              $C$DW$195       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3263                      .dwattr $C$DW$195, DW_AT_name("rsvd1")
    3264                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd1")
    3265                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    3266                      .dwattr $C$DW$195, DW_AT_bit_size(0x08)
    3267                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3268                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3269              
    3270                      .dwendtag $C$DW$T$35
    3271              
    3272              
    3273              $C$DW$T$36      .dwtag  DW_TAG_union_type
    3274                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
    3275                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    3276              $C$DW$196       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3278                      .dwattr $C$DW$196, DW_AT_name("all")
    3279                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   68

    3280                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3281                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3282              
    3283              $C$DW$197       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$35)
    3285                      .dwattr $C$DW$197, DW_AT_name("bit")
    3286                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    3287                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3288                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3289              
    3290                      .dwendtag $C$DW$T$36
    3291              
    3292              
    3293              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3294                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
    3295                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3296              $C$DW$198       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3298                      .dwattr $C$DW$198, DW_AT_name("SOC0")
    3299                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_SOC0")
    3300                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f)
    3301                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    3302                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3303                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$199       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3307                      .dwattr $C$DW$199, DW_AT_name("SOC1")
    3308                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SOC1")
    3309                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e)
    3310                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    3311                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3313              
    3314              $C$DW$200       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3316                      .dwattr $C$DW$200, DW_AT_name("SOC2")
    3317                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_SOC2")
    3318                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d)
    3319                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    3320                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3321                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3322              
    3323              $C$DW$201       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3325                      .dwattr $C$DW$201, DW_AT_name("SOC3")
    3326                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SOC3")
    3327                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0c)
    3328                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    3329                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3330                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3331              
    3332              $C$DW$202       .dwtag  DW_TAG_member
    3333                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3334                      .dwattr $C$DW$202, DW_AT_name("SOC4")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   69

    3335                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SOC4")
    3336                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0b)
    3337                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    3338                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3340              
    3341              $C$DW$203       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3343                      .dwattr $C$DW$203, DW_AT_name("SOC5")
    3344                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_SOC5")
    3345                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a)
    3346                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3347                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3349              
    3350              $C$DW$204       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3352                      .dwattr $C$DW$204, DW_AT_name("SOC6")
    3353                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SOC6")
    3354                      .dwattr $C$DW$204, DW_AT_bit_offset(0x09)
    3355                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3356                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359              $C$DW$205       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3361                      .dwattr $C$DW$205, DW_AT_name("SOC7")
    3362                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SOC7")
    3363                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08)
    3364                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    3365                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3367              
    3368              $C$DW$206       .dwtag  DW_TAG_member
    3369                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3370                      .dwattr $C$DW$206, DW_AT_name("SOC8")
    3371                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_SOC8")
    3372                      .dwattr $C$DW$206, DW_AT_bit_offset(0x07)
    3373                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    3374                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3375                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3376              
    3377              $C$DW$207       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3379                      .dwattr $C$DW$207, DW_AT_name("SOC9")
    3380                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SOC9")
    3381                      .dwattr $C$DW$207, DW_AT_bit_offset(0x06)
    3382                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    3383                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3384                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3385              
    3386              $C$DW$208       .dwtag  DW_TAG_member
    3387                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3388                      .dwattr $C$DW$208, DW_AT_name("SOC10")
    3389                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_SOC10")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   70

    3390                      .dwattr $C$DW$208, DW_AT_bit_offset(0x05)
    3391                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    3392                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3393                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3394              
    3395              $C$DW$209       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3397                      .dwattr $C$DW$209, DW_AT_name("SOC11")
    3398                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_SOC11")
    3399                      .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    3400                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    3401                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3403              
    3404              $C$DW$210       .dwtag  DW_TAG_member
    3405                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3406                      .dwattr $C$DW$210, DW_AT_name("SOC12")
    3407                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SOC12")
    3408                      .dwattr $C$DW$210, DW_AT_bit_offset(0x03)
    3409                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    3410                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3411                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3412              
    3413              $C$DW$211       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3415                      .dwattr $C$DW$211, DW_AT_name("SOC13")
    3416                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_SOC13")
    3417                      .dwattr $C$DW$211, DW_AT_bit_offset(0x02)
    3418                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    3419                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3420                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3421              
    3422              $C$DW$212       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3424                      .dwattr $C$DW$212, DW_AT_name("SOC14")
    3425                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_SOC14")
    3426                      .dwattr $C$DW$212, DW_AT_bit_offset(0x01)
    3427                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    3428                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3429                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3430              
    3431              $C$DW$213       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3433                      .dwattr $C$DW$213, DW_AT_name("SOC15")
    3434                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_SOC15")
    3435                      .dwattr $C$DW$213, DW_AT_bit_offset(0x00)
    3436                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    3437                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3438                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3439              
    3440                      .dwendtag $C$DW$T$37
    3441              
    3442              
    3443              $C$DW$T$38      .dwtag  DW_TAG_union_type
    3444                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   71

    3445                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3446              $C$DW$214       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3448                      .dwattr $C$DW$214, DW_AT_name("all")
    3449                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_all")
    3450                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3451                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3452              
    3453              $C$DW$215       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$37)
    3455                      .dwattr $C$DW$215, DW_AT_name("bit")
    3456                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_bit")
    3457                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3458                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3459              
    3460                      .dwendtag $C$DW$T$38
    3461              
    3462              
    3463              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3464                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
    3465                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3466              $C$DW$216       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3468                      .dwattr $C$DW$216, DW_AT_name("ACQPS")
    3469                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_ACQPS")
    3470                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0a)
    3471                      .dwattr $C$DW$216, DW_AT_bit_size(0x06)
    3472                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3473                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3474              
    3475              $C$DW$217       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3477                      .dwattr $C$DW$217, DW_AT_name("CHSEL")
    3478                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_CHSEL")
    3479                      .dwattr $C$DW$217, DW_AT_bit_offset(0x06)
    3480                      .dwattr $C$DW$217, DW_AT_bit_size(0x04)
    3481                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3482                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3483              
    3484              $C$DW$218       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3486                      .dwattr $C$DW$218, DW_AT_name("rsvd1")
    3487                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd1")
    3488                      .dwattr $C$DW$218, DW_AT_bit_offset(0x05)
    3489                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3490                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3491                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3492              
    3493              $C$DW$219       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3495                      .dwattr $C$DW$219, DW_AT_name("TRIGSEL")
    3496                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_TRIGSEL")
    3497                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00)
    3498                      .dwattr $C$DW$219, DW_AT_bit_size(0x05)
    3499                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   72

    3500                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3501              
    3502                      .dwendtag $C$DW$T$39
    3503              
    3504              
    3505              $C$DW$T$40      .dwtag  DW_TAG_union_type
    3506                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    3507                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3508              $C$DW$220       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3510                      .dwattr $C$DW$220, DW_AT_name("all")
    3511                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_all")
    3512                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3513                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3514              
    3515              $C$DW$221       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$39)
    3517                      .dwattr $C$DW$221, DW_AT_name("bit")
    3518                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_bit")
    3519                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3520                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3521              
    3522                      .dwendtag $C$DW$T$40
    3523              
    3524              
    3525              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3526                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    3527                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x50)
    3528              $C$DW$222       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    3530                      .dwattr $C$DW$222, DW_AT_name("ADCCTL1")
    3531                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ADCCTL1")
    3532                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3533                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3534              
    3535              $C$DW$223       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$23)
    3537                      .dwattr $C$DW$223, DW_AT_name("ADCCTL2")
    3538                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_ADCCTL2")
    3539                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3540                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3541              
    3542              $C$DW$224       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$41)
    3544                      .dwattr $C$DW$224, DW_AT_name("rsvd1")
    3545                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd1")
    3546                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3547                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3548              
    3549              $C$DW$225       .dwtag  DW_TAG_member
    3550                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$29)
    3551                      .dwattr $C$DW$225, DW_AT_name("ADCINTFLG")
    3552                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_ADCINTFLG")
    3553                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3554                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   73

    3555              
    3556              $C$DW$226       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$29)
    3558                      .dwattr $C$DW$226, DW_AT_name("ADCINTFLGCLR")
    3559                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3560                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3561                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3562              
    3563              $C$DW$227       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$29)
    3565                      .dwattr $C$DW$227, DW_AT_name("ADCINTOVF")
    3566                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_ADCINTOVF")
    3567                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3568                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3569              
    3570              $C$DW$228       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$29)
    3572                      .dwattr $C$DW$228, DW_AT_name("ADCINTOVFCLR")
    3573                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3574                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3575                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3576              
    3577              $C$DW$229       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$133)
    3579                      .dwattr $C$DW$229, DW_AT_name("INTSEL1N2")
    3580                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTSEL1N2")
    3581                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3582                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3583              
    3584              $C$DW$230       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$135)
    3586                      .dwattr $C$DW$230, DW_AT_name("INTSEL3N4")
    3587                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTSEL3N4")
    3588                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3589                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3590              
    3591              $C$DW$231       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$137)
    3593                      .dwattr $C$DW$231, DW_AT_name("INTSEL5N6")
    3594                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTSEL5N6")
    3595                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3596                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3597              
    3598              $C$DW$232       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$139)
    3600                      .dwattr $C$DW$232, DW_AT_name("INTSEL7N8")
    3601                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTSEL7N8")
    3602                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3603                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3604              
    3605              $C$DW$233       .dwtag  DW_TAG_member
    3606                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$141)
    3607                      .dwattr $C$DW$233, DW_AT_name("INTSEL9N10")
    3608                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTSEL9N10")
    3609                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   74

    3610                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3611              
    3612              $C$DW$234       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$42)
    3614                      .dwattr $C$DW$234, DW_AT_name("rsvd2")
    3615                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd2")
    3616                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3617                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3618              
    3619              $C$DW$235       .dwtag  DW_TAG_member
    3620                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$172)
    3621                      .dwattr $C$DW$235, DW_AT_name("SOCPRICTL")
    3622                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_SOCPRICTL")
    3623                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3624                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3625              
    3626              $C$DW$236       .dwtag  DW_TAG_member
    3627                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3628                      .dwattr $C$DW$236, DW_AT_name("rsvd3")
    3629                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd3")
    3630                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3631                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3632              
    3633              $C$DW$237       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$36)
    3635                      .dwattr $C$DW$237, DW_AT_name("ADCSAMPLEMODE")
    3636                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3637                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3638                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3639              
    3640              $C$DW$238       .dwtag  DW_TAG_member
    3641                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3642                      .dwattr $C$DW$238, DW_AT_name("rsvd4")
    3643                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd4")
    3644                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3645                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3646              
    3647              $C$DW$239       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$25)
    3649                      .dwattr $C$DW$239, DW_AT_name("ADCINTSOCSEL1")
    3650                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3651                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3652                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3653              
    3654              $C$DW$240       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    3656                      .dwattr $C$DW$240, DW_AT_name("ADCINTSOCSEL2")
    3657                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3658                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3659                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3660              
    3661              $C$DW$241       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$41)
    3663                      .dwattr $C$DW$241, DW_AT_name("rsvd5")
    3664                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_rsvd5")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   75

    3665                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3666                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3667              
    3668              $C$DW$242       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$38)
    3670                      .dwattr $C$DW$242, DW_AT_name("ADCSOCFLG1")
    3671                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3672                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3673                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3674              
    3675              $C$DW$243       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3677                      .dwattr $C$DW$243, DW_AT_name("rsvd6")
    3678                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd6")
    3679                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3680                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3681              
    3682              $C$DW$244       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$38)
    3684                      .dwattr $C$DW$244, DW_AT_name("ADCSOCFRC1")
    3685                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3686                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3687                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3688              
    3689              $C$DW$245       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3691                      .dwattr $C$DW$245, DW_AT_name("rsvd7")
    3692                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd7")
    3693                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3694                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3695              
    3696              $C$DW$246       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$38)
    3698                      .dwattr $C$DW$246, DW_AT_name("ADCSOCOVF1")
    3699                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3700                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3701                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3702              
    3703              $C$DW$247       .dwtag  DW_TAG_member
    3704                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3705                      .dwattr $C$DW$247, DW_AT_name("rsvd8")
    3706                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_rsvd8")
    3707                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3708                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3709              
    3710              $C$DW$248       .dwtag  DW_TAG_member
    3711                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$38)
    3712                      .dwattr $C$DW$248, DW_AT_name("ADCSOCOVFCLR1")
    3713                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3714                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3715                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3716              
    3717              $C$DW$249       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3719                      .dwattr $C$DW$249, DW_AT_name("rsvd9")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   76

    3720                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd9")
    3721                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3722                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3723              
    3724              $C$DW$250       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$40)
    3726                      .dwattr $C$DW$250, DW_AT_name("ADCSOC0CTL")
    3727                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    3728                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3729                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3730              
    3731              $C$DW$251       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$40)
    3733                      .dwattr $C$DW$251, DW_AT_name("ADCSOC1CTL")
    3734                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    3735                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3736                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3737              
    3738              $C$DW$252       .dwtag  DW_TAG_member
    3739                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$40)
    3740                      .dwattr $C$DW$252, DW_AT_name("ADCSOC2CTL")
    3741                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    3742                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3743                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3744              
    3745              $C$DW$253       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$40)
    3747                      .dwattr $C$DW$253, DW_AT_name("ADCSOC3CTL")
    3748                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    3749                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3750                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3751              
    3752              $C$DW$254       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$40)
    3754                      .dwattr $C$DW$254, DW_AT_name("ADCSOC4CTL")
    3755                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    3756                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3757                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3758              
    3759              $C$DW$255       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$40)
    3761                      .dwattr $C$DW$255, DW_AT_name("ADCSOC5CTL")
    3762                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    3763                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3764                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3765              
    3766              $C$DW$256       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$40)
    3768                      .dwattr $C$DW$256, DW_AT_name("ADCSOC6CTL")
    3769                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    3770                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3771                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3772              
    3773              $C$DW$257       .dwtag  DW_TAG_member
    3774                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   77

    3775                      .dwattr $C$DW$257, DW_AT_name("ADCSOC7CTL")
    3776                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    3777                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3778                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3779              
    3780              $C$DW$258       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$40)
    3782                      .dwattr $C$DW$258, DW_AT_name("ADCSOC8CTL")
    3783                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    3784                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3785                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3786              
    3787              $C$DW$259       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$40)
    3789                      .dwattr $C$DW$259, DW_AT_name("ADCSOC9CTL")
    3790                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    3791                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3792                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3793              
    3794              $C$DW$260       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$40)
    3796                      .dwattr $C$DW$260, DW_AT_name("ADCSOC10CTL")
    3797                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_ADCSOC10CTL")
    3798                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3799                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3800              
    3801              $C$DW$261       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$40)
    3803                      .dwattr $C$DW$261, DW_AT_name("ADCSOC11CTL")
    3804                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    3805                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3806                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3807              
    3808              $C$DW$262       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$40)
    3810                      .dwattr $C$DW$262, DW_AT_name("ADCSOC12CTL")
    3811                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    3812                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3813                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3814              
    3815              $C$DW$263       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$40)
    3817                      .dwattr $C$DW$263, DW_AT_name("ADCSOC13CTL")
    3818                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    3819                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3820                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3821              
    3822              $C$DW$264       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$40)
    3824                      .dwattr $C$DW$264, DW_AT_name("ADCSOC14CTL")
    3825                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    3826                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3827                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3828              
    3829              $C$DW$265       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{ED9AE313-281A-4435-8F2A-5411619B06A2} PAGE   78

    3830                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$40)
    3831                      .dwattr $C$DW$265, DW_AT_name("ADCSOC15CTL")
    3832                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_ADCSOC15CTL")
    3833                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    3834                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3835              
    3836              $C$DW$266       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$43)
    3838                      .dwattr $C$DW$266, DW_AT_name("rsvd10")
    3839                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_rsvd10")
    3840                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3841                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3842              
    3843              $C$DW$267       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$34)
    3845                      .dwattr $C$DW$267, DW_AT_name("ADCREFTRIM")
    3846                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3847                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3848                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3849              
    3850              $C$DW$268       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$32)
    3852                      .dwattr $C$DW$268, DW_AT_name("ADCOFFTRIM")
    3853                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3854                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3855                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3856              
    3857              $C$DW$269       .dwtag  DW_TAG_member
    3858                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$44)
    3859                      .dwattr $C$DW$269, DW_AT_name("rsvd11")
    3860                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_rsvd11")
    3861                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
