TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 18:34:43 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/Solar Microinverter_Statemachine.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4495                      .dwattr $C$DW$203, DW_AT_low_pc(0x00)
    4496                      .dwattr $C$DW$203, DW_AT_name("_faultindication")
    4497                      .dwattr $C$DW$203, DW_AT_TI_call
    4498              
    4499 00000418 7640'         LCR       #_faultindication     ; [CPU_] |784| 
         00000419 02D1 
    4500                      ; call occurs [#_faultindication] ; [] |784| 
    4501 0000041a       $C$L101:    
    4502 0000041a FF69          SPM       #0                    ; [CPU_] 
    4503 0000041b FE84          SUBB      SP,#4                 ; [CPU_U] 
    4504                      .dwcfi  cfa_offset, -2
    4505              $C$DW$204       .dwtag  DW_TAG_TI_branch
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE   95

    4506                      .dwattr $C$DW$204, DW_AT_low_pc(0x00)
    4507                      .dwattr $C$DW$204, DW_AT_TI_return
    4508              
    4509 0000041c 0006          LRETR     ; [CPU_] 
    4510                      ; return occurs ; [] 
    4511                      .dwattr $C$DW$196, DW_AT_TI_end_file("../source/Solar Microinverter_Statemachine.c")
    4512                      .dwattr $C$DW$196, DW_AT_TI_end_line(0x31f)
    4513                      .dwattr $C$DW$196, DW_AT_TI_end_column(0x01)
    4514                      .dwendentry
    4515                      .dwendtag $C$DW$196
    4516              
    4517              ;***************************************************************
    4518              ;* FLOATING-POINT CONSTANTS                                    *
    4519              ;***************************************************************
    4520 00000000               .sect   ".econst"
    4521                      .align  2
    4522 00000000 0000  $C$FL1: .xldouble       $strtod("0x1p+15")
         00000001 0000 
         00000002 0000 
         00000003 40E0 
    4523              ;**************************************************************
    4524              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4525              ;**************************************************************
    4526                      .global _PWMSTOP
    4527                      .global _peakInverterOutputCurrent
    4528                      .global _pvPanelVoltage
    4529                      .global _maxInverterOutputCurrent
    4530                      .global _avgPeakGridVotlage
    4531                      .global _StatemachineCheckFlag
    4532                      .global _Zcd1Flag
    4533                      .global _avgPeakGridVotlage1
    4534                      .global _frequencyFaultCounter
    4535                      .global _Trip_zeroCrossDetectFlag
    4536                      .global _rectifiedGridVoltage
    4537                      .global _grid_present_flag
    4538                      .global _Ra
    4539                      .global _startupZeroCrossCounter1
    4540                      .global _flybackshutdownflag
    4541                      .global _averageRectifiedCurrent
    4542                      .global _Rsa
    4543                      .global _flybacktron
    4544                      .global _measuredTemperature
    4545                      .global _mpptFactorMaximum
    4546                      .global _inverterPeriod
    4547                      .global _criticalFaultFlag
    4548                      .global _startupZeroCrossCounter
    4549                      .global _driveSupplyVoltage
    4550                      .global _softstart_counter
    4551                      .global _inverterOutputCurrent
    4552                      .global _ninetyDegreeDetectFlag
    4553                      .global _inverterPeriodCounter_off
    4554                      .global _peakGridVoltage
    4555                      .global _avgInputDataReadyFlag
    4556                      .global _sfst_acVoltage
    4557                      .global _Comp2Regs
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE   96

    4558                      .global _Comp3Regs
    4559                      .global _PieCtrlRegs
    4560                      .global _ECap1Regs
    4561                      .global _AdcResult
    4562                      .global _GpioDataRegs
    4563                      .global _EPwm3Regs
    4564                      .global _EPwm1Regs
    4565                      .global _EPwm2Regs
    4566                      .global FD$$MPY
    4567                      .global FS$$TOFD
    4568                      .global U$$TOFS
    4569                      .global FS$$MPY
    4570                      .global FS$$NEG
    4571                      .global FS$$ADD
    4572                      .global FS$$SUB
    4573                      .global FD$$TOL
    4574                      .global ULL$$CMP
    4575              
    4576              ;***************************************************************
    4577              ;* TYPE INFORMATION                                            *
    4578              ;***************************************************************
    4579              
    4580              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4581                      .dwattr $C$DW$T$21, DW_AT_name("ADC_RESULT_REGS")
    4582                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x20)
    4583              $C$DW$205       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    4585                      .dwattr $C$DW$205, DW_AT_name("ADCRESULT0")
    4586                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ADCRESULT0")
    4587                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4588                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4589              
    4590              $C$DW$206       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    4592                      .dwattr $C$DW$206, DW_AT_name("ADCRESULT1")
    4593                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_ADCRESULT1")
    4594                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4595                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4596              
    4597              $C$DW$207       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    4599                      .dwattr $C$DW$207, DW_AT_name("ADCRESULT2")
    4600                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ADCRESULT2")
    4601                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4602                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4603              
    4604              $C$DW$208       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    4606                      .dwattr $C$DW$208, DW_AT_name("ADCRESULT3")
    4607                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_ADCRESULT3")
    4608                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4609                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4610              
    4611              $C$DW$209       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE   97

    4613                      .dwattr $C$DW$209, DW_AT_name("ADCRESULT4")
    4614                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_ADCRESULT4")
    4615                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4616                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4617              
    4618              $C$DW$210       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    4620                      .dwattr $C$DW$210, DW_AT_name("ADCRESULT5")
    4621                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_ADCRESULT5")
    4622                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4623                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4624              
    4625              $C$DW$211       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    4627                      .dwattr $C$DW$211, DW_AT_name("ADCRESULT6")
    4628                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_ADCRESULT6")
    4629                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4630                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4631              
    4632              $C$DW$212       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    4634                      .dwattr $C$DW$212, DW_AT_name("ADCRESULT7")
    4635                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ADCRESULT7")
    4636                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4637                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4638              
    4639              $C$DW$213       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    4641                      .dwattr $C$DW$213, DW_AT_name("ADCRESULT8")
    4642                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ADCRESULT8")
    4643                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4644                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4645              
    4646              $C$DW$214       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    4648                      .dwattr $C$DW$214, DW_AT_name("ADCRESULT9")
    4649                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_ADCRESULT9")
    4650                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4651                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4652              
    4653              $C$DW$215       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    4655                      .dwattr $C$DW$215, DW_AT_name("ADCRESULT10")
    4656                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ADCRESULT10")
    4657                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4658                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4659              
    4660              $C$DW$216       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    4662                      .dwattr $C$DW$216, DW_AT_name("ADCRESULT11")
    4663                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_ADCRESULT11")
    4664                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4665                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4666              
    4667              $C$DW$217       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE   98

    4668                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    4669                      .dwattr $C$DW$217, DW_AT_name("ADCRESULT12")
    4670                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ADCRESULT12")
    4671                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4672                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4673              
    4674              $C$DW$218       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    4676                      .dwattr $C$DW$218, DW_AT_name("ADCRESULT13")
    4677                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_ADCRESULT13")
    4678                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4679                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4680              
    4681              $C$DW$219       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    4683                      .dwattr $C$DW$219, DW_AT_name("ADCRESULT14")
    4684                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_ADCRESULT14")
    4685                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4686                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4687              
    4688              $C$DW$220       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    4690                      .dwattr $C$DW$220, DW_AT_name("ADCRESULT15")
    4691                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_ADCRESULT15")
    4692                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4693                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4694              
    4695              $C$DW$221       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    4697                      .dwattr $C$DW$221, DW_AT_name("rsvd")
    4698                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd")
    4699                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4700                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4701              
    4702                      .dwendtag $C$DW$T$21
    4703              
    4704              $C$DW$222       .dwtag  DW_TAG_TI_far_type
    4705                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    4706              
    4707              $C$DW$T$122     .dwtag  DW_TAG_volatile_type
    4708                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$222)
    4709              
    4710              
    4711              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4712                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_BITS")
    4713                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    4714              $C$DW$223       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    4716                      .dwattr $C$DW$223, DW_AT_name("rsvd1")
    4717                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd1")
    4718                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0f)
    4719                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    4720                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4721                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4722              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE   99

    4723              $C$DW$224       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    4725                      .dwattr $C$DW$224, DW_AT_name("rsvd2")
    4726                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd2")
    4727                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0e)
    4728                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    4729                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4730                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4731              
    4732              $C$DW$225       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    4734                      .dwattr $C$DW$225, DW_AT_name("AIO2")
    4735                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_AIO2")
    4736                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0d)
    4737                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    4738                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4739                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4740              
    4741              $C$DW$226       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    4743                      .dwattr $C$DW$226, DW_AT_name("rsvd3")
    4744                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd3")
    4745                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0c)
    4746                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    4747                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4748                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4749              
    4750              $C$DW$227       .dwtag  DW_TAG_member
    4751                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    4752                      .dwattr $C$DW$227, DW_AT_name("AIO4")
    4753                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_AIO4")
    4754                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0b)
    4755                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    4756                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4757                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4758              
    4759              $C$DW$228       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    4761                      .dwattr $C$DW$228, DW_AT_name("rsvd4")
    4762                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_rsvd4")
    4763                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0a)
    4764                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    4765                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4766                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4767              
    4768              $C$DW$229       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    4770                      .dwattr $C$DW$229, DW_AT_name("AIO6")
    4771                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_AIO6")
    4772                      .dwattr $C$DW$229, DW_AT_bit_offset(0x09)
    4773                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    4774                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4775                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4776              
    4777              $C$DW$230       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  100

    4778                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    4779                      .dwattr $C$DW$230, DW_AT_name("rsvd5")
    4780                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd5")
    4781                      .dwattr $C$DW$230, DW_AT_bit_offset(0x08)
    4782                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    4783                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4784                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4785              
    4786              $C$DW$231       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    4788                      .dwattr $C$DW$231, DW_AT_name("rsvd6")
    4789                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd6")
    4790                      .dwattr $C$DW$231, DW_AT_bit_offset(0x07)
    4791                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    4792                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4793                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4794              
    4795              $C$DW$232       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    4797                      .dwattr $C$DW$232, DW_AT_name("rsvd7")
    4798                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd7")
    4799                      .dwattr $C$DW$232, DW_AT_bit_offset(0x06)
    4800                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    4801                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4802                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4803              
    4804              $C$DW$233       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    4806                      .dwattr $C$DW$233, DW_AT_name("AIO10")
    4807                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_AIO10")
    4808                      .dwattr $C$DW$233, DW_AT_bit_offset(0x05)
    4809                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    4810                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4811                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4812              
    4813              $C$DW$234       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    4815                      .dwattr $C$DW$234, DW_AT_name("rsvd8")
    4816                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd8")
    4817                      .dwattr $C$DW$234, DW_AT_bit_offset(0x04)
    4818                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    4819                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4820                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4821              
    4822              $C$DW$235       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    4824                      .dwattr $C$DW$235, DW_AT_name("AIO12")
    4825                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_AIO12")
    4826                      .dwattr $C$DW$235, DW_AT_bit_offset(0x03)
    4827                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    4828                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4829                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4830              
    4831              $C$DW$236       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  101

    4833                      .dwattr $C$DW$236, DW_AT_name("rsvd9")
    4834                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd9")
    4835                      .dwattr $C$DW$236, DW_AT_bit_offset(0x02)
    4836                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    4837                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4838                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4839              
    4840              $C$DW$237       .dwtag  DW_TAG_member
    4841                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    4842                      .dwattr $C$DW$237, DW_AT_name("AIO14")
    4843                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_AIO14")
    4844                      .dwattr $C$DW$237, DW_AT_bit_offset(0x01)
    4845                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    4846                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4847                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4848              
    4849              $C$DW$238       .dwtag  DW_TAG_member
    4850                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    4851                      .dwattr $C$DW$238, DW_AT_name("rsvd10")
    4852                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd10")
    4853                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00)
    4854                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    4855                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4856                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4857              
    4858                      .dwendtag $C$DW$T$22
    4859              
    4860              
    4861              $C$DW$T$23      .dwtag  DW_TAG_union_type
    4862                      .dwattr $C$DW$T$23, DW_AT_name("AIODAT_REG")
    4863                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4864              $C$DW$239       .dwtag  DW_TAG_member
    4865                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    4866                      .dwattr $C$DW$239, DW_AT_name("all")
    4867                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
    4868                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4869                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4870              
    4871              $C$DW$240       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    4873                      .dwattr $C$DW$240, DW_AT_name("bit")
    4874                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
    4875                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4876                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4877              
    4878                      .dwendtag $C$DW$T$23
    4879              
    4880              
    4881              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4882                      .dwattr $C$DW$T$24, DW_AT_name("AQCSFRC_BITS")
    4883                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4884              $C$DW$241       .dwtag  DW_TAG_member
    4885                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    4886                      .dwattr $C$DW$241, DW_AT_name("CSFA")
    4887                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_CSFA")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  102

    4888                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0e)
    4889                      .dwattr $C$DW$241, DW_AT_bit_size(0x02)
    4890                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4891                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4892              
    4893              $C$DW$242       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    4895                      .dwattr $C$DW$242, DW_AT_name("CSFB")
    4896                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_CSFB")
    4897                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
    4898                      .dwattr $C$DW$242, DW_AT_bit_size(0x02)
    4899                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4900                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4901              
    4902              $C$DW$243       .dwtag  DW_TAG_member
    4903                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    4904                      .dwattr $C$DW$243, DW_AT_name("rsvd1")
    4905                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd1")
    4906                      .dwattr $C$DW$243, DW_AT_bit_offset(0x00)
    4907                      .dwattr $C$DW$243, DW_AT_bit_size(0x0c)
    4908                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4909                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4910              
    4911                      .dwendtag $C$DW$T$24
    4912              
    4913              
    4914              $C$DW$T$25      .dwtag  DW_TAG_union_type
    4915                      .dwattr $C$DW$T$25, DW_AT_name("AQCSFRC_REG")
    4916                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4917              $C$DW$244       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    4919                      .dwattr $C$DW$244, DW_AT_name("all")
    4920                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_all")
    4921                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4922                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4923              
    4924              $C$DW$245       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$24)
    4926                      .dwattr $C$DW$245, DW_AT_name("bit")
    4927                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_bit")
    4928                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4929                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4930              
    4931                      .dwendtag $C$DW$T$25
    4932              
    4933              
    4934              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4935                      .dwattr $C$DW$T$26, DW_AT_name("AQCTL_BITS")
    4936                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4937              $C$DW$246       .dwtag  DW_TAG_member
    4938                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    4939                      .dwattr $C$DW$246, DW_AT_name("ZRO")
    4940                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_ZRO")
    4941                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0e)
    4942                      .dwattr $C$DW$246, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  103

    4943                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4944                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4945              
    4946              $C$DW$247       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    4948                      .dwattr $C$DW$247, DW_AT_name("PRD")
    4949                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_PRD")
    4950                      .dwattr $C$DW$247, DW_AT_bit_offset(0x0c)
    4951                      .dwattr $C$DW$247, DW_AT_bit_size(0x02)
    4952                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4953                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4954              
    4955              $C$DW$248       .dwtag  DW_TAG_member
    4956                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    4957                      .dwattr $C$DW$248, DW_AT_name("CAU")
    4958                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_CAU")
    4959                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0a)
    4960                      .dwattr $C$DW$248, DW_AT_bit_size(0x02)
    4961                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4962                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4963              
    4964              $C$DW$249       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    4966                      .dwattr $C$DW$249, DW_AT_name("CAD")
    4967                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_CAD")
    4968                      .dwattr $C$DW$249, DW_AT_bit_offset(0x08)
    4969                      .dwattr $C$DW$249, DW_AT_bit_size(0x02)
    4970                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4971                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4972              
    4973              $C$DW$250       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    4975                      .dwattr $C$DW$250, DW_AT_name("CBU")
    4976                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_CBU")
    4977                      .dwattr $C$DW$250, DW_AT_bit_offset(0x06)
    4978                      .dwattr $C$DW$250, DW_AT_bit_size(0x02)
    4979                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4980                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4981              
    4982              $C$DW$251       .dwtag  DW_TAG_member
    4983                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    4984                      .dwattr $C$DW$251, DW_AT_name("CBD")
    4985                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_CBD")
    4986                      .dwattr $C$DW$251, DW_AT_bit_offset(0x04)
    4987                      .dwattr $C$DW$251, DW_AT_bit_size(0x02)
    4988                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4989                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4990              
    4991              $C$DW$252       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    4993                      .dwattr $C$DW$252, DW_AT_name("rsvd")
    4994                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd")
    4995                      .dwattr $C$DW$252, DW_AT_bit_offset(0x00)
    4996                      .dwattr $C$DW$252, DW_AT_bit_size(0x04)
    4997                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  104

    4998                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4999              
    5000                      .dwendtag $C$DW$T$26
    5001              
    5002              
    5003              $C$DW$T$27      .dwtag  DW_TAG_union_type
    5004                      .dwattr $C$DW$T$27, DW_AT_name("AQCTL_REG")
    5005                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5006              $C$DW$253       .dwtag  DW_TAG_member
    5007                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    5008                      .dwattr $C$DW$253, DW_AT_name("all")
    5009                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_all")
    5010                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5011                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5012              
    5013              $C$DW$254       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$26)
    5015                      .dwattr $C$DW$254, DW_AT_name("bit")
    5016                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_bit")
    5017                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5018                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5019              
    5020                      .dwendtag $C$DW$T$27
    5021              
    5022              
    5023              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5024                      .dwattr $C$DW$T$28, DW_AT_name("AQSFRC_BITS")
    5025                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5026              $C$DW$255       .dwtag  DW_TAG_member
    5027                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    5028                      .dwattr $C$DW$255, DW_AT_name("ACTSFA")
    5029                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_ACTSFA")
    5030                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0e)
    5031                      .dwattr $C$DW$255, DW_AT_bit_size(0x02)
    5032                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5033                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5034              
    5035              $C$DW$256       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    5037                      .dwattr $C$DW$256, DW_AT_name("OTSFA")
    5038                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_OTSFA")
    5039                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0d)
    5040                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    5041                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5042                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5043              
    5044              $C$DW$257       .dwtag  DW_TAG_member
    5045                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    5046                      .dwattr $C$DW$257, DW_AT_name("ACTSFB")
    5047                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_ACTSFB")
    5048                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0b)
    5049                      .dwattr $C$DW$257, DW_AT_bit_size(0x02)
    5050                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5051                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5052              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  105

    5053              $C$DW$258       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    5055                      .dwattr $C$DW$258, DW_AT_name("OTSFB")
    5056                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_OTSFB")
    5057                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0a)
    5058                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    5059                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5060                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5061              
    5062              $C$DW$259       .dwtag  DW_TAG_member
    5063                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    5064                      .dwattr $C$DW$259, DW_AT_name("RLDCSF")
    5065                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_RLDCSF")
    5066                      .dwattr $C$DW$259, DW_AT_bit_offset(0x08)
    5067                      .dwattr $C$DW$259, DW_AT_bit_size(0x02)
    5068                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5069                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5070              
    5071              $C$DW$260       .dwtag  DW_TAG_member
    5072                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    5073                      .dwattr $C$DW$260, DW_AT_name("rsvd1")
    5074                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd1")
    5075                      .dwattr $C$DW$260, DW_AT_bit_offset(0x00)
    5076                      .dwattr $C$DW$260, DW_AT_bit_size(0x08)
    5077                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5078                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5079              
    5080                      .dwendtag $C$DW$T$28
    5081              
    5082              
    5083              $C$DW$T$29      .dwtag  DW_TAG_union_type
    5084                      .dwattr $C$DW$T$29, DW_AT_name("AQSFRC_REG")
    5085                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5086              $C$DW$261       .dwtag  DW_TAG_member
    5087                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    5088                      .dwattr $C$DW$261, DW_AT_name("all")
    5089                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_all")
    5090                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5091                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5092              
    5093              $C$DW$262       .dwtag  DW_TAG_member
    5094                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$28)
    5095                      .dwattr $C$DW$262, DW_AT_name("bit")
    5096                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_bit")
    5097                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5098                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5099              
    5100                      .dwendtag $C$DW$T$29
    5101              
    5102              
    5103              $C$DW$T$31      .dwtag  DW_TAG_union_type
    5104                      .dwattr $C$DW$T$31, DW_AT_name("CMPA_HRPWM_GROUP")
    5105                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    5106              $C$DW$263       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  106

    5108                      .dwattr $C$DW$263, DW_AT_name("all")
    5109                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_all")
    5110                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5111                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5112              
    5113              $C$DW$264       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$32)
    5115                      .dwattr $C$DW$264, DW_AT_name("half")
    5116                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_half")
    5117                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5118                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5119              
    5120                      .dwendtag $C$DW$T$31
    5121              
    5122              
    5123              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5124                      .dwattr $C$DW$T$32, DW_AT_name("CMPA_HRPWM_REG")
    5125                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5126              $C$DW$265       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    5128                      .dwattr $C$DW$265, DW_AT_name("CMPAHR")
    5129                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_CMPAHR")
    5130                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5131                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5132              
    5133              $C$DW$266       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    5135                      .dwattr $C$DW$266, DW_AT_name("CMPA")
    5136                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_CMPA")
    5137                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5138                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5139              
    5140                      .dwendtag $C$DW$T$32
    5141              
    5142              
    5143              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5144                      .dwattr $C$DW$T$33, DW_AT_name("CMPCTL_BITS")
    5145                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5146              $C$DW$267       .dwtag  DW_TAG_member
    5147                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    5148                      .dwattr $C$DW$267, DW_AT_name("LOADAMODE")
    5149                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_LOADAMODE")
    5150                      .dwattr $C$DW$267, DW_AT_bit_offset(0x0e)
    5151                      .dwattr $C$DW$267, DW_AT_bit_size(0x02)
    5152                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5153                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5154              
    5155              $C$DW$268       .dwtag  DW_TAG_member
    5156                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    5157                      .dwattr $C$DW$268, DW_AT_name("LOADBMODE")
    5158                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_LOADBMODE")
    5159                      .dwattr $C$DW$268, DW_AT_bit_offset(0x0c)
    5160                      .dwattr $C$DW$268, DW_AT_bit_size(0x02)
    5161                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5162                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  107

    5163              
    5164              $C$DW$269       .dwtag  DW_TAG_member
    5165                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    5166                      .dwattr $C$DW$269, DW_AT_name("SHDWAMODE")
    5167                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_SHDWAMODE")
    5168                      .dwattr $C$DW$269, DW_AT_bit_offset(0x0b)
    5169                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    5170                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5171                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5172              
    5173              $C$DW$270       .dwtag  DW_TAG_member
    5174                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    5175                      .dwattr $C$DW$270, DW_AT_name("rsvd1")
    5176                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd1")
    5177                      .dwattr $C$DW$270, DW_AT_bit_offset(0x0a)
    5178                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    5179                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5180                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5181              
    5182              $C$DW$271       .dwtag  DW_TAG_member
    5183                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    5184                      .dwattr $C$DW$271, DW_AT_name("SHDWBMODE")
    5185                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_SHDWBMODE")
    5186                      .dwattr $C$DW$271, DW_AT_bit_offset(0x09)
    5187                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    5188                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5189                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5190              
    5191              $C$DW$272       .dwtag  DW_TAG_member
    5192                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    5193                      .dwattr $C$DW$272, DW_AT_name("rsvd2")
    5194                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_rsvd2")
    5195                      .dwattr $C$DW$272, DW_AT_bit_offset(0x08)
    5196                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    5197                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5198                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5199              
    5200              $C$DW$273       .dwtag  DW_TAG_member
    5201                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    5202                      .dwattr $C$DW$273, DW_AT_name("SHDWAFULL")
    5203                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_SHDWAFULL")
    5204                      .dwattr $C$DW$273, DW_AT_bit_offset(0x07)
    5205                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    5206                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5207                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5208              
    5209              $C$DW$274       .dwtag  DW_TAG_member
    5210                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    5211                      .dwattr $C$DW$274, DW_AT_name("SHDWBFULL")
    5212                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_SHDWBFULL")
    5213                      .dwattr $C$DW$274, DW_AT_bit_offset(0x06)
    5214                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    5215                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5216                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5217              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  108

    5218              $C$DW$275       .dwtag  DW_TAG_member
    5219                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    5220                      .dwattr $C$DW$275, DW_AT_name("rsvd3")
    5221                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_rsvd3")
    5222                      .dwattr $C$DW$275, DW_AT_bit_offset(0x00)
    5223                      .dwattr $C$DW$275, DW_AT_bit_size(0x06)
    5224                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5225                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5226              
    5227                      .dwendtag $C$DW$T$33
    5228              
    5229              
    5230              $C$DW$T$34      .dwtag  DW_TAG_union_type
    5231                      .dwattr $C$DW$T$34, DW_AT_name("CMPCTL_REG")
    5232                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5233              $C$DW$276       .dwtag  DW_TAG_member
    5234                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    5235                      .dwattr $C$DW$276, DW_AT_name("all")
    5236                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_all")
    5237                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5238                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5239              
    5240              $C$DW$277       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$33)
    5242                      .dwattr $C$DW$277, DW_AT_name("bit")
    5243                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_bit")
    5244                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5245                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5246              
    5247                      .dwendtag $C$DW$T$34
    5248              
    5249              
    5250              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5251                      .dwattr $C$DW$T$35, DW_AT_name("COMPCTL_BITS")
    5252                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    5253              $C$DW$278       .dwtag  DW_TAG_member
    5254                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    5255                      .dwattr $C$DW$278, DW_AT_name("COMPDACEN")
    5256                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_COMPDACEN")
    5257                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0f)
    5258                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    5259                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5260                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5261              
    5262              $C$DW$279       .dwtag  DW_TAG_member
    5263                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    5264                      .dwattr $C$DW$279, DW_AT_name("COMPSOURCE")
    5265                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_COMPSOURCE")
    5266                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0e)
    5267                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    5268                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5269                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5270              
    5271              $C$DW$280       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  109

    5273                      .dwattr $C$DW$280, DW_AT_name("CMPINV")
    5274                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_CMPINV")
    5275                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0d)
    5276                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    5277                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5278                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5279              
    5280              $C$DW$281       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    5282                      .dwattr $C$DW$281, DW_AT_name("QUALSEL")
    5283                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_QUALSEL")
    5284                      .dwattr $C$DW$281, DW_AT_bit_offset(0x08)
    5285                      .dwattr $C$DW$281, DW_AT_bit_size(0x05)
    5286                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5287                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5288              
    5289              $C$DW$282       .dwtag  DW_TAG_member
    5290                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    5291                      .dwattr $C$DW$282, DW_AT_name("SYNCSEL")
    5292                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SYNCSEL")
    5293                      .dwattr $C$DW$282, DW_AT_bit_offset(0x07)
    5294                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    5295                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5296                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5297              
    5298              $C$DW$283       .dwtag  DW_TAG_member
    5299                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    5300                      .dwattr $C$DW$283, DW_AT_name("rsvd1")
    5301                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_rsvd1")
    5302                      .dwattr $C$DW$283, DW_AT_bit_offset(0x00)
    5303                      .dwattr $C$DW$283, DW_AT_bit_size(0x07)
    5304                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5305                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5306              
    5307                      .dwendtag $C$DW$T$35
    5308              
    5309              
    5310              $C$DW$T$36      .dwtag  DW_TAG_union_type
    5311                      .dwattr $C$DW$T$36, DW_AT_name("COMPCTL_REG")
    5312                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5313              $C$DW$284       .dwtag  DW_TAG_member
    5314                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    5315                      .dwattr $C$DW$284, DW_AT_name("all")
    5316                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_all")
    5317                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5318                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5319              
    5320              $C$DW$285       .dwtag  DW_TAG_member
    5321                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$35)
    5322                      .dwattr $C$DW$285, DW_AT_name("bit")
    5323                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_bit")
    5324                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5325                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5326              
    5327                      .dwendtag $C$DW$T$36
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  110

    5328              
    5329              
    5330              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5331                      .dwattr $C$DW$T$37, DW_AT_name("COMPSTS_BITS")
    5332                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    5333              $C$DW$286       .dwtag  DW_TAG_member
    5334                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    5335                      .dwattr $C$DW$286, DW_AT_name("COMPSTS")
    5336                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_COMPSTS")
    5337                      .dwattr $C$DW$286, DW_AT_bit_offset(0x0f)
    5338                      .dwattr $C$DW$286, DW_AT_bit_size(0x01)
    5339                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5340                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5341              
    5342              $C$DW$287       .dwtag  DW_TAG_member
    5343                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    5344                      .dwattr $C$DW$287, DW_AT_name("rsvd1")
    5345                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_rsvd1")
    5346                      .dwattr $C$DW$287, DW_AT_bit_offset(0x00)
    5347                      .dwattr $C$DW$287, DW_AT_bit_size(0x0f)
    5348                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5349                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5350              
    5351                      .dwendtag $C$DW$T$37
    5352              
    5353              
    5354              $C$DW$T$38      .dwtag  DW_TAG_union_type
    5355                      .dwattr $C$DW$T$38, DW_AT_name("COMPSTS_REG")
    5356                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    5357              $C$DW$288       .dwtag  DW_TAG_member
    5358                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    5359                      .dwattr $C$DW$288, DW_AT_name("all")
    5360                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_all")
    5361                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5362                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5363              
    5364              $C$DW$289       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$37)
    5366                      .dwattr $C$DW$289, DW_AT_name("bit")
    5367                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_bit")
    5368                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5369                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5370              
    5371                      .dwendtag $C$DW$T$38
    5372              
    5373              
    5374              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5375                      .dwattr $C$DW$T$41, DW_AT_name("COMP_REGS")
    5376                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x11)
    5377              $C$DW$290       .dwtag  DW_TAG_member
    5378                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$36)
    5379                      .dwattr $C$DW$290, DW_AT_name("COMPCTL")
    5380                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_COMPCTL")
    5381                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5382                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  111

    5383              
    5384              $C$DW$291       .dwtag  DW_TAG_member
    5385                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    5386                      .dwattr $C$DW$291, DW_AT_name("rsvd1")
    5387                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_rsvd1")
    5388                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5389                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5390              
    5391              $C$DW$292       .dwtag  DW_TAG_member
    5392                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$38)
    5393                      .dwattr $C$DW$292, DW_AT_name("COMPSTS")
    5394                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_COMPSTS")
    5395                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5396                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5397              
    5398              $C$DW$293       .dwtag  DW_TAG_member
    5399                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$39)
    5400                      .dwattr $C$DW$293, DW_AT_name("rsvd2")
    5401                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_rsvd2")
    5402                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5403                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5404              
    5405              $C$DW$294       .dwtag  DW_TAG_member
    5406                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$43)
    5407                      .dwattr $C$DW$294, DW_AT_name("DACVAL")
    5408                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_DACVAL")
    5409                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5410                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5411              
    5412              $C$DW$295       .dwtag  DW_TAG_member
    5413                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$40)
    5414                      .dwattr $C$DW$295, DW_AT_name("rsvd4")
    5415                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_rsvd4")
    5416                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5417                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5418              
    5419                      .dwendtag $C$DW$T$41
    5420              
    5421              $C$DW$296       .dwtag  DW_TAG_TI_far_type
    5422                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$41)
    5423              
    5424              $C$DW$T$123     .dwtag  DW_TAG_volatile_type
    5425                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$296)
    5426              
    5427              
    5428              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5429                      .dwattr $C$DW$T$42, DW_AT_name("DACVAL_BITS")
    5430                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    5431              $C$DW$297       .dwtag  DW_TAG_member
    5432                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    5433                      .dwattr $C$DW$297, DW_AT_name("DACVAL")
    5434                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_DACVAL")
    5435                      .dwattr $C$DW$297, DW_AT_bit_offset(0x06)
    5436                      .dwattr $C$DW$297, DW_AT_bit_size(0x0a)
    5437                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  112

    5438                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5439              
    5440              $C$DW$298       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    5442                      .dwattr $C$DW$298, DW_AT_name("rsvd1")
    5443                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_rsvd1")
    5444                      .dwattr $C$DW$298, DW_AT_bit_offset(0x00)
    5445                      .dwattr $C$DW$298, DW_AT_bit_size(0x06)
    5446                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5447                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5448              
    5449                      .dwendtag $C$DW$T$42
    5450              
    5451              
    5452              $C$DW$T$43      .dwtag  DW_TAG_union_type
    5453                      .dwattr $C$DW$T$43, DW_AT_name("DACVAL_REG")
    5454                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    5455              $C$DW$299       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    5457                      .dwattr $C$DW$299, DW_AT_name("all")
    5458                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_all")
    5459                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5460                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5461              
    5462              $C$DW$300       .dwtag  DW_TAG_member
    5463                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$42)
    5464                      .dwattr $C$DW$300, DW_AT_name("bit")
    5465                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_bit")
    5466                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5467                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5468              
    5469                      .dwendtag $C$DW$T$43
    5470              
    5471              
    5472              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5473                      .dwattr $C$DW$T$44, DW_AT_name("DBCTL_BITS")
    5474                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5475              $C$DW$301       .dwtag  DW_TAG_member
    5476                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    5477                      .dwattr $C$DW$301, DW_AT_name("OUT_MODE")
    5478                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_OUT_MODE")
    5479                      .dwattr $C$DW$301, DW_AT_bit_offset(0x0e)
    5480                      .dwattr $C$DW$301, DW_AT_bit_size(0x02)
    5481                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5482                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5483              
    5484              $C$DW$302       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    5486                      .dwattr $C$DW$302, DW_AT_name("POLSEL")
    5487                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_POLSEL")
    5488                      .dwattr $C$DW$302, DW_AT_bit_offset(0x0c)
    5489                      .dwattr $C$DW$302, DW_AT_bit_size(0x02)
    5490                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5491                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5492              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  113

    5493              $C$DW$303       .dwtag  DW_TAG_member
    5494                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    5495                      .dwattr $C$DW$303, DW_AT_name("IN_MODE")
    5496                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_IN_MODE")
    5497                      .dwattr $C$DW$303, DW_AT_bit_offset(0x0a)
    5498                      .dwattr $C$DW$303, DW_AT_bit_size(0x02)
    5499                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5500                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5501              
    5502              $C$DW$304       .dwtag  DW_TAG_member
    5503                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    5504                      .dwattr $C$DW$304, DW_AT_name("rsvd1")
    5505                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_rsvd1")
    5506                      .dwattr $C$DW$304, DW_AT_bit_offset(0x01)
    5507                      .dwattr $C$DW$304, DW_AT_bit_size(0x09)
    5508                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5509                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5510              
    5511              $C$DW$305       .dwtag  DW_TAG_member
    5512                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    5513                      .dwattr $C$DW$305, DW_AT_name("HALFCYCLE")
    5514                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_HALFCYCLE")
    5515                      .dwattr $C$DW$305, DW_AT_bit_offset(0x00)
    5516                      .dwattr $C$DW$305, DW_AT_bit_size(0x01)
    5517                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5518                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5519              
    5520                      .dwendtag $C$DW$T$44
    5521              
    5522              
    5523              $C$DW$T$45      .dwtag  DW_TAG_union_type
    5524                      .dwattr $C$DW$T$45, DW_AT_name("DBCTL_REG")
    5525                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    5526              $C$DW$306       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    5528                      .dwattr $C$DW$306, DW_AT_name("all")
    5529                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_all")
    5530                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5531                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5532              
    5533              $C$DW$307       .dwtag  DW_TAG_member
    5534                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$44)
    5535                      .dwattr $C$DW$307, DW_AT_name("bit")
    5536                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_bit")
    5537                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5538                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5539              
    5540                      .dwendtag $C$DW$T$45
    5541              
    5542              
    5543              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    5544                      .dwattr $C$DW$T$46, DW_AT_name("DCCAPCTL_BITS")
    5545                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    5546              $C$DW$308       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  114

    5548                      .dwattr $C$DW$308, DW_AT_name("CAPE")
    5549                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_CAPE")
    5550                      .dwattr $C$DW$308, DW_AT_bit_offset(0x0f)
    5551                      .dwattr $C$DW$308, DW_AT_bit_size(0x01)
    5552                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5553                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5554              
    5555              $C$DW$309       .dwtag  DW_TAG_member
    5556                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    5557                      .dwattr $C$DW$309, DW_AT_name("SHDWMODE")
    5558                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_SHDWMODE")
    5559                      .dwattr $C$DW$309, DW_AT_bit_offset(0x0e)
    5560                      .dwattr $C$DW$309, DW_AT_bit_size(0x01)
    5561                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5562                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5563              
    5564              $C$DW$310       .dwtag  DW_TAG_member
    5565                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    5566                      .dwattr $C$DW$310, DW_AT_name("rsvd")
    5567                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_rsvd")
    5568                      .dwattr $C$DW$310, DW_AT_bit_offset(0x00)
    5569                      .dwattr $C$DW$310, DW_AT_bit_size(0x0e)
    5570                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5571                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5572              
    5573                      .dwendtag $C$DW$T$46
    5574              
    5575              
    5576              $C$DW$T$47      .dwtag  DW_TAG_union_type
    5577                      .dwattr $C$DW$T$47, DW_AT_name("DCCAPCTL_REG")
    5578                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    5579              $C$DW$311       .dwtag  DW_TAG_member
    5580                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    5581                      .dwattr $C$DW$311, DW_AT_name("all")
    5582                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_all")
    5583                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5584                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5585              
    5586              $C$DW$312       .dwtag  DW_TAG_member
    5587                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$46)
    5588                      .dwattr $C$DW$312, DW_AT_name("bit")
    5589                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_bit")
    5590                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5591                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5592              
    5593                      .dwendtag $C$DW$T$47
    5594              
    5595              
    5596              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5597                      .dwattr $C$DW$T$48, DW_AT_name("DCCTL_BITS")
    5598                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    5599              $C$DW$313       .dwtag  DW_TAG_member
    5600                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    5601                      .dwattr $C$DW$313, DW_AT_name("EVT1SRCSEL")
    5602                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_EVT1SRCSEL")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  115

    5603                      .dwattr $C$DW$313, DW_AT_bit_offset(0x0f)
    5604                      .dwattr $C$DW$313, DW_AT_bit_size(0x01)
    5605                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5606                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5607              
    5608              $C$DW$314       .dwtag  DW_TAG_member
    5609                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    5610                      .dwattr $C$DW$314, DW_AT_name("EVT1FRCSYNCSEL")
    5611                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_EVT1FRCSYNCSEL")
    5612                      .dwattr $C$DW$314, DW_AT_bit_offset(0x0e)
    5613                      .dwattr $C$DW$314, DW_AT_bit_size(0x01)
    5614                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5615                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5616              
    5617              $C$DW$315       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    5619                      .dwattr $C$DW$315, DW_AT_name("EVT1SOCE")
    5620                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_EVT1SOCE")
    5621                      .dwattr $C$DW$315, DW_AT_bit_offset(0x0d)
    5622                      .dwattr $C$DW$315, DW_AT_bit_size(0x01)
    5623                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5624                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5625              
    5626              $C$DW$316       .dwtag  DW_TAG_member
    5627                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    5628                      .dwattr $C$DW$316, DW_AT_name("EVT1SYNCE")
    5629                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_EVT1SYNCE")
    5630                      .dwattr $C$DW$316, DW_AT_bit_offset(0x0c)
    5631                      .dwattr $C$DW$316, DW_AT_bit_size(0x01)
    5632                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5633                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5634              
    5635              $C$DW$317       .dwtag  DW_TAG_member
    5636                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    5637                      .dwattr $C$DW$317, DW_AT_name("rsvd1")
    5638                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_rsvd1")
    5639                      .dwattr $C$DW$317, DW_AT_bit_offset(0x08)
    5640                      .dwattr $C$DW$317, DW_AT_bit_size(0x04)
    5641                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5642                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5643              
    5644              $C$DW$318       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    5646                      .dwattr $C$DW$318, DW_AT_name("EVT2SRCSEL")
    5647                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_EVT2SRCSEL")
    5648                      .dwattr $C$DW$318, DW_AT_bit_offset(0x07)
    5649                      .dwattr $C$DW$318, DW_AT_bit_size(0x01)
    5650                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5651                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5652              
    5653              $C$DW$319       .dwtag  DW_TAG_member
    5654                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    5655                      .dwattr $C$DW$319, DW_AT_name("EVT2FRCSYNCSEL")
    5656                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_EVT2FRCSYNCSEL")
    5657                      .dwattr $C$DW$319, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  116

    5658                      .dwattr $C$DW$319, DW_AT_bit_size(0x01)
    5659                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5660                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5661              
    5662              $C$DW$320       .dwtag  DW_TAG_member
    5663                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    5664                      .dwattr $C$DW$320, DW_AT_name("rsvd2")
    5665                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_rsvd2")
    5666                      .dwattr $C$DW$320, DW_AT_bit_offset(0x00)
    5667                      .dwattr $C$DW$320, DW_AT_bit_size(0x06)
    5668                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5669                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5670              
    5671                      .dwendtag $C$DW$T$48
    5672              
    5673              
    5674              $C$DW$T$49      .dwtag  DW_TAG_union_type
    5675                      .dwattr $C$DW$T$49, DW_AT_name("DCCTL_REG")
    5676                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    5677              $C$DW$321       .dwtag  DW_TAG_member
    5678                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    5679                      .dwattr $C$DW$321, DW_AT_name("all")
    5680                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_all")
    5681                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5682                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5683              
    5684              $C$DW$322       .dwtag  DW_TAG_member
    5685                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$48)
    5686                      .dwattr $C$DW$322, DW_AT_name("bit")
    5687                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_bit")
    5688                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5689                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5690              
    5691                      .dwendtag $C$DW$T$49
    5692              
    5693              
    5694              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    5695                      .dwattr $C$DW$T$50, DW_AT_name("DCFCTL_BITS")
    5696                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    5697              $C$DW$323       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    5699                      .dwattr $C$DW$323, DW_AT_name("SRCSEL")
    5700                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_SRCSEL")
    5701                      .dwattr $C$DW$323, DW_AT_bit_offset(0x0e)
    5702                      .dwattr $C$DW$323, DW_AT_bit_size(0x02)
    5703                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5704                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5705              
    5706              $C$DW$324       .dwtag  DW_TAG_member
    5707                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    5708                      .dwattr $C$DW$324, DW_AT_name("BLANKE")
    5709                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_BLANKE")
    5710                      .dwattr $C$DW$324, DW_AT_bit_offset(0x0d)
    5711                      .dwattr $C$DW$324, DW_AT_bit_size(0x01)
    5712                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  117

    5713                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5714              
    5715              $C$DW$325       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    5717                      .dwattr $C$DW$325, DW_AT_name("BLANKINV")
    5718                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_BLANKINV")
    5719                      .dwattr $C$DW$325, DW_AT_bit_offset(0x0c)
    5720                      .dwattr $C$DW$325, DW_AT_bit_size(0x01)
    5721                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5722                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5723              
    5724              $C$DW$326       .dwtag  DW_TAG_member
    5725                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    5726                      .dwattr $C$DW$326, DW_AT_name("PULSESEL")
    5727                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_PULSESEL")
    5728                      .dwattr $C$DW$326, DW_AT_bit_offset(0x0a)
    5729                      .dwattr $C$DW$326, DW_AT_bit_size(0x02)
    5730                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5731                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5732              
    5733              $C$DW$327       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    5735                      .dwattr $C$DW$327, DW_AT_name("rsvd")
    5736                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_rsvd")
    5737                      .dwattr $C$DW$327, DW_AT_bit_offset(0x00)
    5738                      .dwattr $C$DW$327, DW_AT_bit_size(0x0a)
    5739                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5740                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5741              
    5742                      .dwendtag $C$DW$T$50
    5743              
    5744              
    5745              $C$DW$T$51      .dwtag  DW_TAG_union_type
    5746                      .dwattr $C$DW$T$51, DW_AT_name("DCFCTL_REG")
    5747                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    5748              $C$DW$328       .dwtag  DW_TAG_member
    5749                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    5750                      .dwattr $C$DW$328, DW_AT_name("all")
    5751                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_all")
    5752                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5753                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5754              
    5755              $C$DW$329       .dwtag  DW_TAG_member
    5756                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$50)
    5757                      .dwattr $C$DW$329, DW_AT_name("bit")
    5758                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_bit")
    5759                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5760                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5761              
    5762                      .dwendtag $C$DW$T$51
    5763              
    5764              
    5765              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5766                      .dwattr $C$DW$T$52, DW_AT_name("DCTRIPSEL_BITS")
    5767                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  118

    5768              $C$DW$330       .dwtag  DW_TAG_member
    5769                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    5770                      .dwattr $C$DW$330, DW_AT_name("DCAHCOMPSEL")
    5771                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_DCAHCOMPSEL")
    5772                      .dwattr $C$DW$330, DW_AT_bit_offset(0x0c)
    5773                      .dwattr $C$DW$330, DW_AT_bit_size(0x04)
    5774                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5775                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5776              
    5777              $C$DW$331       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    5779                      .dwattr $C$DW$331, DW_AT_name("DCALCOMPSEL")
    5780                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_DCALCOMPSEL")
    5781                      .dwattr $C$DW$331, DW_AT_bit_offset(0x08)
    5782                      .dwattr $C$DW$331, DW_AT_bit_size(0x04)
    5783                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5784                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5785              
    5786              $C$DW$332       .dwtag  DW_TAG_member
    5787                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    5788                      .dwattr $C$DW$332, DW_AT_name("DCBHCOMPSEL")
    5789                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_DCBHCOMPSEL")
    5790                      .dwattr $C$DW$332, DW_AT_bit_offset(0x04)
    5791                      .dwattr $C$DW$332, DW_AT_bit_size(0x04)
    5792                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5793                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5794              
    5795              $C$DW$333       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    5797                      .dwattr $C$DW$333, DW_AT_name("DCBLCOMPSEL")
    5798                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_DCBLCOMPSEL")
    5799                      .dwattr $C$DW$333, DW_AT_bit_offset(0x00)
    5800                      .dwattr $C$DW$333, DW_AT_bit_size(0x04)
    5801                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5802                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5803              
    5804                      .dwendtag $C$DW$T$52
    5805              
    5806              
    5807              $C$DW$T$53      .dwtag  DW_TAG_union_type
    5808                      .dwattr $C$DW$T$53, DW_AT_name("DCTRIPSEL_REG")
    5809                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    5810              $C$DW$334       .dwtag  DW_TAG_member
    5811                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    5812                      .dwattr $C$DW$334, DW_AT_name("all")
    5813                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_all")
    5814                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5816              
    5817              $C$DW$335       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$52)
    5819                      .dwattr $C$DW$335, DW_AT_name("bit")
    5820                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_bit")
    5821                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5822                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  119

    5823              
    5824                      .dwendtag $C$DW$T$53
    5825              
    5826              
    5827              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    5828                      .dwattr $C$DW$T$56, DW_AT_name("ECAP_REGS")
    5829                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x20)
    5830              $C$DW$336       .dwtag  DW_TAG_member
    5831                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$30)
    5832                      .dwattr $C$DW$336, DW_AT_name("TSCTR")
    5833                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_TSCTR")
    5834                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5835                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5836              
    5837              $C$DW$337       .dwtag  DW_TAG_member
    5838                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$30)
    5839                      .dwattr $C$DW$337, DW_AT_name("CTRPHS")
    5840                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_CTRPHS")
    5841                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5842                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5843              
    5844              $C$DW$338       .dwtag  DW_TAG_member
    5845                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$30)
    5846                      .dwattr $C$DW$338, DW_AT_name("CAP1")
    5847                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_CAP1")
    5848                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5849                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5850              
    5851              $C$DW$339       .dwtag  DW_TAG_member
    5852                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$30)
    5853                      .dwattr $C$DW$339, DW_AT_name("CAP2")
    5854                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_CAP2")
    5855                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5856                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5857              
    5858              $C$DW$340       .dwtag  DW_TAG_member
    5859                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$30)
    5860                      .dwattr $C$DW$340, DW_AT_name("CAP3")
    5861                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_CAP3")
    5862                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5863                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5864              
    5865              $C$DW$341       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$30)
    5867                      .dwattr $C$DW$341, DW_AT_name("CAP4")
    5868                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_CAP4")
    5869                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5870                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5871              
    5872              $C$DW$342       .dwtag  DW_TAG_member
    5873                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$54)
    5874                      .dwattr $C$DW$342, DW_AT_name("rsvd1")
    5875                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_rsvd1")
    5876                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5877                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 18:34:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{78D7371F-21EB-4614-AB60-EA8DDF702B94} PAGE  120

    5878              
    5879              $C$DW$343       .dwtag  DW_TAG_member
    5880                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$58)
