TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Mar 06 19:39:32 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=softlib --hll_source=
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/Solar Microinverter_isr.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admin\workspace_v7\KT1205_MGI_V7.2_REVC_MASTER_GPRS_180301
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5451 00000703 1A05!         OR        @_AdcRegs+5,#0x0001   ; [CPU_] |1399| 
         00000704 0001 
    5452 00000705 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_U] 
         00000706 0000 
    5453                      .dwpsn  file "../source/Solar Microinverter_isr.c",line 1400,column 2,is_stmt,isa 0
    5454 00000707 1A01!         OR        @_PieCtrlRegs+1,#0x0001 ; [CPU_] |1400| 
         00000708 0001 
    5455 00000709 761A   EDIS
    5456 0000070a 761F!         MOVW      DP,#_GpioDataRegs+5   ; [CPU_U] 
         0000070b 0000 
    5457                      .dwpsn  file "../source/Solar Microinverter_isr.c",line 1402,column 5,is_stmt,isa 0
    5458 0000070c 1A05!         OR        @_GpioDataRegs+5,#0x2000 ; [CPU_] |1402| 
         0000070d 2000 
    5459 0000070e FE82          SUBB      SP,#2                 ; [CPU_U] 
    5460                      .dwcfi  cfa_offset, -14
    5461 0000070f C5BE          MOVL      XAR7,*--SP            ; [CPU_] 
    5462                      .dwcfi  cfa_offset, -12
    5463                      .dwcfi  restore_reg, 18
    5464 00000710 C4BE          MOVL      XAR6,*--SP            ; [CPU_] 
    5465                      .dwcfi  cfa_offset, -10
    5466                      .dwcfi  restore_reg, 16
    5467 00000711 83BE          MOVL      XAR5,*--SP            ; [CPU_] 
    5468                      .dwcfi  cfa_offset, -8
    5469                      .dwcfi  restore_reg, 14
    5470 00000712 8ABE          MOVL      XAR4,*--SP            ; [CPU_] 
    5471                      .dwcfi  cfa_offset, -6
    5472                      .dwcfi  restore_reg, 12
    5473 00000713 87BE          MOVL      XT,*--SP              ; [CPU_] 
    5474                      .dwcfi  cfa_offset, -4
    5475                      .dwcfi  restore_reg, 22
    5476                      .dwcfi  restore_reg, 21
    5477 00000714 0003          POP       AR1H:AR0H             ; [CPU_] 
    5478                      .dwcfi  cfa_offset, -2
    5479                      .dwcfi  restore_reg, 5
    5480                      .dwcfi  restore_reg, 7
    5481 00000715 7617          NASP      ; [CPU_] 
    5482              $C$DW$197       .dwtag  DW_TAG_TI_branch
    5483                      .dwattr $C$DW$197, DW_AT_low_pc(0x00)
    5484                      .dwattr $C$DW$197, DW_AT_TI_return
    5485              
    5486 00000716 7602          IRET      ; [CPU_] 
    5487                      ; return occurs ; [] 
    5488                      .dwattr $C$DW$178, DW_AT_TI_end_file("../source/Solar Microinverter_isr.c")
    5489                      .dwattr $C$DW$178, DW_AT_TI_end_line(0x57c)
    5490                      .dwattr $C$DW$178, DW_AT_TI_end_column(0x01)
    5491                      .dwendentry
    5492                      .dwendtag $C$DW$178
    5493              
    5494              ;**************************************************************
    5495              ;* UNDEFINED EXTERNAL REFERENCES                              *
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  115

    5496              ;**************************************************************
    5497                      .global _ServiceDog
    5498                      .global _gridFlag
    5499                      .global _AC_grid_offset
    5500                      .global _AC_inv_offset
    5501                      .global _zeroCrossDelayMax
    5502                      .global _zeroCrossDelayNom
    5503                      .global _inputCurrentAverage
    5504                      .global _inputVoltageAverage
    5505                      .global _faultState
    5506                      .global _systemState
    5507                      .global _startFullBridgeFlag
    5508                      .global _zeroCrossDelay
    5509                      .global _inverterPeriodMin
    5510                      .global _acCurrentOffset
    5511                      .global _GridVOutofRangeFlag
    5512                      .global _GridFOutofRangeFlag
    5513                      .global _storeFaultState
    5514                      .global _mpptFactor
    5515                      .global __IQ15rmpy
    5516                      .global __IQ15isqrt
    5517                      .global __IQ15rsmpy
    5518                      .global __IQ15sqrt
    5519                      .global _Comp2Regs
    5520                      .global _Comp3Regs
    5521                      .global _Comp1Regs
    5522                      .global _PieCtrlRegs
    5523                      .global _GpioDataRegs
    5524                      .global _AdcResult
    5525                      .global _EPwm2Regs
    5526                      .global _EPwm3Regs
    5527                      .global _EPwm1Regs
    5528                      .global _AdcRegs
    5529                      .global L$$DIV
    5530              
    5531              ;***************************************************************
    5532              ;* TYPE INFORMATION                                            *
    5533              ;***************************************************************
    5534              
    5535              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5536                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
    5537                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    5538              $C$DW$198       .dwtag  DW_TAG_member
    5539                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    5540                      .dwattr $C$DW$198, DW_AT_name("TEMPCONV")
    5541                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_TEMPCONV")
    5542                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f)
    5543                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    5544                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5545                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    5546              
    5547              $C$DW$199       .dwtag  DW_TAG_member
    5548                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    5549                      .dwattr $C$DW$199, DW_AT_name("VREFLOCONV")
    5550                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_VREFLOCONV")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  116

    5551                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e)
    5552                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    5553                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5554                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    5555              
    5556              $C$DW$200       .dwtag  DW_TAG_member
    5557                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    5558                      .dwattr $C$DW$200, DW_AT_name("INTPULSEPOS")
    5559                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTPULSEPOS")
    5560                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d)
    5561                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    5562                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5563                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5564              
    5565              $C$DW$201       .dwtag  DW_TAG_member
    5566                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    5567                      .dwattr $C$DW$201, DW_AT_name("ADCREFSEL")
    5568                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_ADCREFSEL")
    5569                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0c)
    5570                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    5571                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5572                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5573              
    5574              $C$DW$202       .dwtag  DW_TAG_member
    5575                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    5576                      .dwattr $C$DW$202, DW_AT_name("rsvd1")
    5577                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd1")
    5578                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0b)
    5579                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    5580                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5581                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    5582              
    5583              $C$DW$203       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    5585                      .dwattr $C$DW$203, DW_AT_name("ADCREFPWD")
    5586                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ADCREFPWD")
    5587                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a)
    5588                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    5589                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5590                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    5591              
    5592              $C$DW$204       .dwtag  DW_TAG_member
    5593                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    5594                      .dwattr $C$DW$204, DW_AT_name("ADCBGPWD")
    5595                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ADCBGPWD")
    5596                      .dwattr $C$DW$204, DW_AT_bit_offset(0x09)
    5597                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    5598                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5599                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    5600              
    5601              $C$DW$205       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    5603                      .dwattr $C$DW$205, DW_AT_name("ADCPWDN")
    5604                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ADCPWDN")
    5605                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  117

    5606                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    5607                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5608                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    5609              
    5610              $C$DW$206       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    5612                      .dwattr $C$DW$206, DW_AT_name("ADCBSYCHN")
    5613                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_ADCBSYCHN")
    5614                      .dwattr $C$DW$206, DW_AT_bit_offset(0x03)
    5615                      .dwattr $C$DW$206, DW_AT_bit_size(0x05)
    5616                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5617                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    5618              
    5619              $C$DW$207       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    5621                      .dwattr $C$DW$207, DW_AT_name("ADCBSY")
    5622                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ADCBSY")
    5623                      .dwattr $C$DW$207, DW_AT_bit_offset(0x02)
    5624                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    5625                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5626                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    5627              
    5628              $C$DW$208       .dwtag  DW_TAG_member
    5629                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    5630                      .dwattr $C$DW$208, DW_AT_name("ADCENABLE")
    5631                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_ADCENABLE")
    5632                      .dwattr $C$DW$208, DW_AT_bit_offset(0x01)
    5633                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    5634                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5635                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    5636              
    5637              $C$DW$209       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    5639                      .dwattr $C$DW$209, DW_AT_name("RESET")
    5640                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RESET")
    5641                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00)
    5642                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    5643                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5644                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    5645              
    5646                      .dwendtag $C$DW$T$20
    5647              
    5648              
    5649              $C$DW$T$21      .dwtag  DW_TAG_union_type
    5650                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
    5651                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    5652              $C$DW$210       .dwtag  DW_TAG_member
    5653                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    5654                      .dwattr $C$DW$210, DW_AT_name("all")
    5655                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_all")
    5656                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5657                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    5658              
    5659              $C$DW$211       .dwtag  DW_TAG_member
    5660                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  118

    5661                      .dwattr $C$DW$211, DW_AT_name("bit")
    5662                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_bit")
    5663                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5664                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    5665              
    5666                      .dwendtag $C$DW$T$21
    5667              
    5668              
    5669              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5670                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
    5671                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    5672              $C$DW$212       .dwtag  DW_TAG_member
    5673                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    5674                      .dwattr $C$DW$212, DW_AT_name("CLKDIV2EN")
    5675                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_CLKDIV2EN")
    5676                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0f)
    5677                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    5678                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5679                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    5680              
    5681              $C$DW$213       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    5683                      .dwattr $C$DW$213, DW_AT_name("ADCNONOVERLAP")
    5684                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
    5685                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0e)
    5686                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    5687                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5688                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    5689              
    5690              $C$DW$214       .dwtag  DW_TAG_member
    5691                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    5692                      .dwattr $C$DW$214, DW_AT_name("rsvd1")
    5693                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd1")
    5694                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00)
    5695                      .dwattr $C$DW$214, DW_AT_bit_size(0x0e)
    5696                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5697                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    5698              
    5699                      .dwendtag $C$DW$T$22
    5700              
    5701              
    5702              $C$DW$T$23      .dwtag  DW_TAG_union_type
    5703                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
    5704                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    5705              $C$DW$215       .dwtag  DW_TAG_member
    5706                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    5707                      .dwattr $C$DW$215, DW_AT_name("all")
    5708                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
    5709                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5710                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    5711              
    5712              $C$DW$216       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    5714                      .dwattr $C$DW$216, DW_AT_name("bit")
    5715                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  119

    5716                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5717                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    5718              
    5719                      .dwendtag $C$DW$T$23
    5720              
    5721              
    5722              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5723                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
    5724                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    5725              $C$DW$217       .dwtag  DW_TAG_member
    5726                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    5727                      .dwattr $C$DW$217, DW_AT_name("SOC0")
    5728                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_SOC0")
    5729                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0e)
    5730                      .dwattr $C$DW$217, DW_AT_bit_size(0x02)
    5731                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5732                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    5733              
    5734              $C$DW$218       .dwtag  DW_TAG_member
    5735                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    5736                      .dwattr $C$DW$218, DW_AT_name("SOC1")
    5737                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_SOC1")
    5738                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0c)
    5739                      .dwattr $C$DW$218, DW_AT_bit_size(0x02)
    5740                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5741                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    5742              
    5743              $C$DW$219       .dwtag  DW_TAG_member
    5744                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    5745                      .dwattr $C$DW$219, DW_AT_name("SOC2")
    5746                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SOC2")
    5747                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0a)
    5748                      .dwattr $C$DW$219, DW_AT_bit_size(0x02)
    5749                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5750                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    5751              
    5752              $C$DW$220       .dwtag  DW_TAG_member
    5753                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    5754                      .dwattr $C$DW$220, DW_AT_name("SOC3")
    5755                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_SOC3")
    5756                      .dwattr $C$DW$220, DW_AT_bit_offset(0x08)
    5757                      .dwattr $C$DW$220, DW_AT_bit_size(0x02)
    5758                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5759                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    5760              
    5761              $C$DW$221       .dwtag  DW_TAG_member
    5762                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    5763                      .dwattr $C$DW$221, DW_AT_name("SOC4")
    5764                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_SOC4")
    5765                      .dwattr $C$DW$221, DW_AT_bit_offset(0x06)
    5766                      .dwattr $C$DW$221, DW_AT_bit_size(0x02)
    5767                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5768                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    5769              
    5770              $C$DW$222       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  120

    5771                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    5772                      .dwattr $C$DW$222, DW_AT_name("SOC5")
    5773                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SOC5")
    5774                      .dwattr $C$DW$222, DW_AT_bit_offset(0x04)
    5775                      .dwattr $C$DW$222, DW_AT_bit_size(0x02)
    5776                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5777                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    5778              
    5779              $C$DW$223       .dwtag  DW_TAG_member
    5780                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    5781                      .dwattr $C$DW$223, DW_AT_name("SOC6")
    5782                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_SOC6")
    5783                      .dwattr $C$DW$223, DW_AT_bit_offset(0x02)
    5784                      .dwattr $C$DW$223, DW_AT_bit_size(0x02)
    5785                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5786                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    5787              
    5788              $C$DW$224       .dwtag  DW_TAG_member
    5789                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    5790                      .dwattr $C$DW$224, DW_AT_name("SOC7")
    5791                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_SOC7")
    5792                      .dwattr $C$DW$224, DW_AT_bit_offset(0x00)
    5793                      .dwattr $C$DW$224, DW_AT_bit_size(0x02)
    5794                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5795                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    5796              
    5797                      .dwendtag $C$DW$T$24
    5798              
    5799              
    5800              $C$DW$T$25      .dwtag  DW_TAG_union_type
    5801                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
    5802                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    5803              $C$DW$225       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    5805                      .dwattr $C$DW$225, DW_AT_name("all")
    5806                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_all")
    5807                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5808                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    5809              
    5810              $C$DW$226       .dwtag  DW_TAG_member
    5811                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    5812                      .dwattr $C$DW$226, DW_AT_name("bit")
    5813                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_bit")
    5814                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    5816              
    5817                      .dwendtag $C$DW$T$25
    5818              
    5819              
    5820              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5821                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
    5822                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5823              $C$DW$227       .dwtag  DW_TAG_member
    5824                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    5825                      .dwattr $C$DW$227, DW_AT_name("SOC8")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  121

    5826                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_SOC8")
    5827                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0e)
    5828                      .dwattr $C$DW$227, DW_AT_bit_size(0x02)
    5829                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5830                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    5831              
    5832              $C$DW$228       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    5834                      .dwattr $C$DW$228, DW_AT_name("SOC9")
    5835                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_SOC9")
    5836                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0c)
    5837                      .dwattr $C$DW$228, DW_AT_bit_size(0x02)
    5838                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5839                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    5840              
    5841              $C$DW$229       .dwtag  DW_TAG_member
    5842                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    5843                      .dwattr $C$DW$229, DW_AT_name("SOC10")
    5844                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_SOC10")
    5845                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0a)
    5846                      .dwattr $C$DW$229, DW_AT_bit_size(0x02)
    5847                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5848                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    5849              
    5850              $C$DW$230       .dwtag  DW_TAG_member
    5851                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    5852                      .dwattr $C$DW$230, DW_AT_name("SOC11")
    5853                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_SOC11")
    5854                      .dwattr $C$DW$230, DW_AT_bit_offset(0x08)
    5855                      .dwattr $C$DW$230, DW_AT_bit_size(0x02)
    5856                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5857                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    5858              
    5859              $C$DW$231       .dwtag  DW_TAG_member
    5860                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    5861                      .dwattr $C$DW$231, DW_AT_name("SOC12")
    5862                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_SOC12")
    5863                      .dwattr $C$DW$231, DW_AT_bit_offset(0x06)
    5864                      .dwattr $C$DW$231, DW_AT_bit_size(0x02)
    5865                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5866                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    5867              
    5868              $C$DW$232       .dwtag  DW_TAG_member
    5869                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    5870                      .dwattr $C$DW$232, DW_AT_name("SOC13")
    5871                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_SOC13")
    5872                      .dwattr $C$DW$232, DW_AT_bit_offset(0x04)
    5873                      .dwattr $C$DW$232, DW_AT_bit_size(0x02)
    5874                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5875                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    5876              
    5877              $C$DW$233       .dwtag  DW_TAG_member
    5878                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    5879                      .dwattr $C$DW$233, DW_AT_name("SOC14")
    5880                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_SOC14")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  122

    5881                      .dwattr $C$DW$233, DW_AT_bit_offset(0x02)
    5882                      .dwattr $C$DW$233, DW_AT_bit_size(0x02)
    5883                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5884                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    5885              
    5886              $C$DW$234       .dwtag  DW_TAG_member
    5887                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    5888                      .dwattr $C$DW$234, DW_AT_name("SOC15")
    5889                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_SOC15")
    5890                      .dwattr $C$DW$234, DW_AT_bit_offset(0x00)
    5891                      .dwattr $C$DW$234, DW_AT_bit_size(0x02)
    5892                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5893                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5894              
    5895                      .dwendtag $C$DW$T$26
    5896              
    5897              
    5898              $C$DW$T$27      .dwtag  DW_TAG_union_type
    5899                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
    5900                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5901              $C$DW$235       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    5903                      .dwattr $C$DW$235, DW_AT_name("all")
    5904                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_all")
    5905                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5906                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5907              
    5908              $C$DW$236       .dwtag  DW_TAG_member
    5909                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$26)
    5910                      .dwattr $C$DW$236, DW_AT_name("bit")
    5911                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_bit")
    5912                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5913                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    5914              
    5915                      .dwendtag $C$DW$T$27
    5916              
    5917              
    5918              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5919                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
    5920                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5921              $C$DW$237       .dwtag  DW_TAG_member
    5922                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    5923                      .dwattr $C$DW$237, DW_AT_name("ADCINT1")
    5924                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ADCINT1")
    5925                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0f)
    5926                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    5927                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5928                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    5929              
    5930              $C$DW$238       .dwtag  DW_TAG_member
    5931                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    5932                      .dwattr $C$DW$238, DW_AT_name("ADCINT2")
    5933                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_ADCINT2")
    5934                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0e)
    5935                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  123

    5936                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5937                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5938              
    5939              $C$DW$239       .dwtag  DW_TAG_member
    5940                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    5941                      .dwattr $C$DW$239, DW_AT_name("ADCINT3")
    5942                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_ADCINT3")
    5943                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0d)
    5944                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    5945                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5946                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5947              
    5948              $C$DW$240       .dwtag  DW_TAG_member
    5949                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    5950                      .dwattr $C$DW$240, DW_AT_name("ADCINT4")
    5951                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_ADCINT4")
    5952                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0c)
    5953                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    5954                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5955                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    5956              
    5957              $C$DW$241       .dwtag  DW_TAG_member
    5958                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    5959                      .dwattr $C$DW$241, DW_AT_name("ADCINT5")
    5960                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_ADCINT5")
    5961                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0b)
    5962                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    5963                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5964                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    5965              
    5966              $C$DW$242       .dwtag  DW_TAG_member
    5967                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    5968                      .dwattr $C$DW$242, DW_AT_name("ADCINT6")
    5969                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_ADCINT6")
    5970                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0a)
    5971                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    5972                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5973                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    5974              
    5975              $C$DW$243       .dwtag  DW_TAG_member
    5976                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    5977                      .dwattr $C$DW$243, DW_AT_name("ADCINT7")
    5978                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_ADCINT7")
    5979                      .dwattr $C$DW$243, DW_AT_bit_offset(0x09)
    5980                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    5981                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5982                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5983              
    5984              $C$DW$244       .dwtag  DW_TAG_member
    5985                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    5986                      .dwattr $C$DW$244, DW_AT_name("ADCINT8")
    5987                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_ADCINT8")
    5988                      .dwattr $C$DW$244, DW_AT_bit_offset(0x08)
    5989                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    5990                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  124

    5991                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5992              
    5993              $C$DW$245       .dwtag  DW_TAG_member
    5994                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    5995                      .dwattr $C$DW$245, DW_AT_name("ADCINT9")
    5996                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ADCINT9")
    5997                      .dwattr $C$DW$245, DW_AT_bit_offset(0x07)
    5998                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    5999                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6000                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    6001              
    6002              $C$DW$246       .dwtag  DW_TAG_member
    6003                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    6004                      .dwattr $C$DW$246, DW_AT_name("rsvd1")
    6005                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd1")
    6006                      .dwattr $C$DW$246, DW_AT_bit_offset(0x00)
    6007                      .dwattr $C$DW$246, DW_AT_bit_size(0x07)
    6008                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6009                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    6010              
    6011                      .dwendtag $C$DW$T$28
    6012              
    6013              
    6014              $C$DW$T$29      .dwtag  DW_TAG_union_type
    6015                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
    6016                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    6017              $C$DW$247       .dwtag  DW_TAG_member
    6018                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    6019                      .dwattr $C$DW$247, DW_AT_name("all")
    6020                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_all")
    6021                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6022                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    6023              
    6024              $C$DW$248       .dwtag  DW_TAG_member
    6025                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$28)
    6026                      .dwattr $C$DW$248, DW_AT_name("bit")
    6027                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_bit")
    6028                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6029                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    6030              
    6031                      .dwendtag $C$DW$T$29
    6032              
    6033              
    6034              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6035                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
    6036                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    6037              $C$DW$249       .dwtag  DW_TAG_member
    6038                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$30)
    6039                      .dwattr $C$DW$249, DW_AT_name("OFFTRIM")
    6040                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_OFFTRIM")
    6041                      .dwattr $C$DW$249, DW_AT_bit_offset(0x07)
    6042                      .dwattr $C$DW$249, DW_AT_bit_size(0x09)
    6043                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6044                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    6045              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  125

    6046              $C$DW$250       .dwtag  DW_TAG_member
    6047                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    6048                      .dwattr $C$DW$250, DW_AT_name("rsvd1")
    6049                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_rsvd1")
    6050                      .dwattr $C$DW$250, DW_AT_bit_offset(0x00)
    6051                      .dwattr $C$DW$250, DW_AT_bit_size(0x07)
    6052                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6053                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    6054              
    6055                      .dwendtag $C$DW$T$31
    6056              
    6057              
    6058              $C$DW$T$32      .dwtag  DW_TAG_union_type
    6059                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
    6060                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    6061              $C$DW$251       .dwtag  DW_TAG_member
    6062                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    6063                      .dwattr $C$DW$251, DW_AT_name("all")
    6064                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_all")
    6065                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6066                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    6067              
    6068              $C$DW$252       .dwtag  DW_TAG_member
    6069                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$31)
    6070                      .dwattr $C$DW$252, DW_AT_name("bit")
    6071                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_bit")
    6072                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6073                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    6074              
    6075                      .dwendtag $C$DW$T$32
    6076              
    6077              
    6078              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6079                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
    6080                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6081              $C$DW$253       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    6083                      .dwattr $C$DW$253, DW_AT_name("BG_FINE_TRIM")
    6084                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
    6085                      .dwattr $C$DW$253, DW_AT_bit_offset(0x0c)
    6086                      .dwattr $C$DW$253, DW_AT_bit_size(0x04)
    6087                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6088                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    6089              
    6090              $C$DW$254       .dwtag  DW_TAG_member
    6091                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    6092                      .dwattr $C$DW$254, DW_AT_name("BG_COARSE_TRIM")
    6093                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
    6094                      .dwattr $C$DW$254, DW_AT_bit_offset(0x07)
    6095                      .dwattr $C$DW$254, DW_AT_bit_size(0x05)
    6096                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6097                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    6098              
    6099              $C$DW$255       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  126

    6101                      .dwattr $C$DW$255, DW_AT_name("EXTREF_FINE_TRIM")
    6102                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
    6103                      .dwattr $C$DW$255, DW_AT_bit_offset(0x02)
    6104                      .dwattr $C$DW$255, DW_AT_bit_size(0x05)
    6105                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6106                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    6107              
    6108              $C$DW$256       .dwtag  DW_TAG_member
    6109                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    6110                      .dwattr $C$DW$256, DW_AT_name("rsvd1")
    6111                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd1")
    6112                      .dwattr $C$DW$256, DW_AT_bit_offset(0x00)
    6113                      .dwattr $C$DW$256, DW_AT_bit_size(0x02)
    6114                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6115                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    6116              
    6117                      .dwendtag $C$DW$T$33
    6118              
    6119              
    6120              $C$DW$T$34      .dwtag  DW_TAG_union_type
    6121                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
    6122                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6123              $C$DW$257       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    6125                      .dwattr $C$DW$257, DW_AT_name("all")
    6126                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_all")
    6127                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6128                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    6129              
    6130              $C$DW$258       .dwtag  DW_TAG_member
    6131                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$33)
    6132                      .dwattr $C$DW$258, DW_AT_name("bit")
    6133                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_bit")
    6134                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6135                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    6136              
    6137                      .dwendtag $C$DW$T$34
    6138              
    6139              
    6140              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6141                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
    6142                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    6143              $C$DW$259       .dwtag  DW_TAG_member
    6144                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    6145                      .dwattr $C$DW$259, DW_AT_name("SIMULEN0")
    6146                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SIMULEN0")
    6147                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0f)
    6148                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    6149                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6150                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    6151              
    6152              $C$DW$260       .dwtag  DW_TAG_member
    6153                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    6154                      .dwattr $C$DW$260, DW_AT_name("SIMULEN2")
    6155                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SIMULEN2")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  127

    6156                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0e)
    6157                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    6158                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6159                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    6160              
    6161              $C$DW$261       .dwtag  DW_TAG_member
    6162                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    6163                      .dwattr $C$DW$261, DW_AT_name("SIMULEN4")
    6164                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SIMULEN4")
    6165                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0d)
    6166                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    6167                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6168                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    6169              
    6170              $C$DW$262       .dwtag  DW_TAG_member
    6171                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    6172                      .dwattr $C$DW$262, DW_AT_name("SIMULEN6")
    6173                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_SIMULEN6")
    6174                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0c)
    6175                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    6176                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6177                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    6178              
    6179              $C$DW$263       .dwtag  DW_TAG_member
    6180                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    6181                      .dwattr $C$DW$263, DW_AT_name("SIMULEN8")
    6182                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_SIMULEN8")
    6183                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0b)
    6184                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    6185                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6186                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    6187              
    6188              $C$DW$264       .dwtag  DW_TAG_member
    6189                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    6190                      .dwattr $C$DW$264, DW_AT_name("SIMULEN10")
    6191                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_SIMULEN10")
    6192                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0a)
    6193                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    6194                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6195                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    6196              
    6197              $C$DW$265       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    6199                      .dwattr $C$DW$265, DW_AT_name("SIMULEN12")
    6200                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_SIMULEN12")
    6201                      .dwattr $C$DW$265, DW_AT_bit_offset(0x09)
    6202                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    6203                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6204                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    6205              
    6206              $C$DW$266       .dwtag  DW_TAG_member
    6207                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    6208                      .dwattr $C$DW$266, DW_AT_name("SIMULEN14")
    6209                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_SIMULEN14")
    6210                      .dwattr $C$DW$266, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  128

    6211                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    6212                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6213                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    6214              
    6215              $C$DW$267       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    6217                      .dwattr $C$DW$267, DW_AT_name("rsvd1")
    6218                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_rsvd1")
    6219                      .dwattr $C$DW$267, DW_AT_bit_offset(0x00)
    6220                      .dwattr $C$DW$267, DW_AT_bit_size(0x08)
    6221                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6222                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    6223              
    6224                      .dwendtag $C$DW$T$35
    6225              
    6226              
    6227              $C$DW$T$36      .dwtag  DW_TAG_union_type
    6228                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
    6229                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6230              $C$DW$268       .dwtag  DW_TAG_member
    6231                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    6232                      .dwattr $C$DW$268, DW_AT_name("all")
    6233                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_all")
    6234                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6235                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    6236              
    6237              $C$DW$269       .dwtag  DW_TAG_member
    6238                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$35)
    6239                      .dwattr $C$DW$269, DW_AT_name("bit")
    6240                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_bit")
    6241                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6242                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    6243              
    6244                      .dwendtag $C$DW$T$36
    6245              
    6246              
    6247              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6248                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
    6249                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6250              $C$DW$270       .dwtag  DW_TAG_member
    6251                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    6252                      .dwattr $C$DW$270, DW_AT_name("SOC0")
    6253                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_SOC0")
    6254                      .dwattr $C$DW$270, DW_AT_bit_offset(0x0f)
    6255                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    6256                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6257                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    6258              
    6259              $C$DW$271       .dwtag  DW_TAG_member
    6260                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    6261                      .dwattr $C$DW$271, DW_AT_name("SOC1")
    6262                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_SOC1")
    6263                      .dwattr $C$DW$271, DW_AT_bit_offset(0x0e)
    6264                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    6265                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  129

    6266                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    6267              
    6268              $C$DW$272       .dwtag  DW_TAG_member
    6269                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    6270                      .dwattr $C$DW$272, DW_AT_name("SOC2")
    6271                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_SOC2")
    6272                      .dwattr $C$DW$272, DW_AT_bit_offset(0x0d)
    6273                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    6274                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6275                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    6276              
    6277              $C$DW$273       .dwtag  DW_TAG_member
    6278                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    6279                      .dwattr $C$DW$273, DW_AT_name("SOC3")
    6280                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_SOC3")
    6281                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0c)
    6282                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    6283                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6284                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    6285              
    6286              $C$DW$274       .dwtag  DW_TAG_member
    6287                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    6288                      .dwattr $C$DW$274, DW_AT_name("SOC4")
    6289                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_SOC4")
    6290                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0b)
    6291                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    6292                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6293                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    6294              
    6295              $C$DW$275       .dwtag  DW_TAG_member
    6296                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    6297                      .dwattr $C$DW$275, DW_AT_name("SOC5")
    6298                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_SOC5")
    6299                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0a)
    6300                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    6301                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6302                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    6303              
    6304              $C$DW$276       .dwtag  DW_TAG_member
    6305                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    6306                      .dwattr $C$DW$276, DW_AT_name("SOC6")
    6307                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_SOC6")
    6308                      .dwattr $C$DW$276, DW_AT_bit_offset(0x09)
    6309                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    6310                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6311                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    6312              
    6313              $C$DW$277       .dwtag  DW_TAG_member
    6314                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    6315                      .dwattr $C$DW$277, DW_AT_name("SOC7")
    6316                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_SOC7")
    6317                      .dwattr $C$DW$277, DW_AT_bit_offset(0x08)
    6318                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    6319                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6320                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  130

    6321              
    6322              $C$DW$278       .dwtag  DW_TAG_member
    6323                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    6324                      .dwattr $C$DW$278, DW_AT_name("SOC8")
    6325                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_SOC8")
    6326                      .dwattr $C$DW$278, DW_AT_bit_offset(0x07)
    6327                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    6328                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6329                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    6330              
    6331              $C$DW$279       .dwtag  DW_TAG_member
    6332                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    6333                      .dwattr $C$DW$279, DW_AT_name("SOC9")
    6334                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_SOC9")
    6335                      .dwattr $C$DW$279, DW_AT_bit_offset(0x06)
    6336                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    6337                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6338                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    6339              
    6340              $C$DW$280       .dwtag  DW_TAG_member
    6341                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    6342                      .dwattr $C$DW$280, DW_AT_name("SOC10")
    6343                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_SOC10")
    6344                      .dwattr $C$DW$280, DW_AT_bit_offset(0x05)
    6345                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    6346                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6347                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    6348              
    6349              $C$DW$281       .dwtag  DW_TAG_member
    6350                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    6351                      .dwattr $C$DW$281, DW_AT_name("SOC11")
    6352                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_SOC11")
    6353                      .dwattr $C$DW$281, DW_AT_bit_offset(0x04)
    6354                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    6355                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6356                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    6357              
    6358              $C$DW$282       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    6360                      .dwattr $C$DW$282, DW_AT_name("SOC12")
    6361                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SOC12")
    6362                      .dwattr $C$DW$282, DW_AT_bit_offset(0x03)
    6363                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    6364                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6365                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    6366              
    6367              $C$DW$283       .dwtag  DW_TAG_member
    6368                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    6369                      .dwattr $C$DW$283, DW_AT_name("SOC13")
    6370                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_SOC13")
    6371                      .dwattr $C$DW$283, DW_AT_bit_offset(0x02)
    6372                      .dwattr $C$DW$283, DW_AT_bit_size(0x01)
    6373                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6374                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    6375              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  131

    6376              $C$DW$284       .dwtag  DW_TAG_member
    6377                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    6378                      .dwattr $C$DW$284, DW_AT_name("SOC14")
    6379                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_SOC14")
    6380                      .dwattr $C$DW$284, DW_AT_bit_offset(0x01)
    6381                      .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    6382                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6383                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    6384              
    6385              $C$DW$285       .dwtag  DW_TAG_member
    6386                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    6387                      .dwattr $C$DW$285, DW_AT_name("SOC15")
    6388                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_SOC15")
    6389                      .dwattr $C$DW$285, DW_AT_bit_offset(0x00)
    6390                      .dwattr $C$DW$285, DW_AT_bit_size(0x01)
    6391                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6392                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    6393              
    6394                      .dwendtag $C$DW$T$37
    6395              
    6396              
    6397              $C$DW$T$38      .dwtag  DW_TAG_union_type
    6398                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
    6399                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    6400              $C$DW$286       .dwtag  DW_TAG_member
    6401                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    6402                      .dwattr $C$DW$286, DW_AT_name("all")
    6403                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_all")
    6404                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6405                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    6406              
    6407              $C$DW$287       .dwtag  DW_TAG_member
    6408                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$37)
    6409                      .dwattr $C$DW$287, DW_AT_name("bit")
    6410                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_bit")
    6411                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6412                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    6413              
    6414                      .dwendtag $C$DW$T$38
    6415              
    6416              
    6417              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6418                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
    6419                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6420              $C$DW$288       .dwtag  DW_TAG_member
    6421                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    6422                      .dwattr $C$DW$288, DW_AT_name("ACQPS")
    6423                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ACQPS")
    6424                      .dwattr $C$DW$288, DW_AT_bit_offset(0x0a)
    6425                      .dwattr $C$DW$288, DW_AT_bit_size(0x06)
    6426                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6427                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    6428              
    6429              $C$DW$289       .dwtag  DW_TAG_member
    6430                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  132

    6431                      .dwattr $C$DW$289, DW_AT_name("CHSEL")
    6432                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_CHSEL")
    6433                      .dwattr $C$DW$289, DW_AT_bit_offset(0x06)
    6434                      .dwattr $C$DW$289, DW_AT_bit_size(0x04)
    6435                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6436                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    6437              
    6438              $C$DW$290       .dwtag  DW_TAG_member
    6439                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    6440                      .dwattr $C$DW$290, DW_AT_name("rsvd1")
    6441                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_rsvd1")
    6442                      .dwattr $C$DW$290, DW_AT_bit_offset(0x05)
    6443                      .dwattr $C$DW$290, DW_AT_bit_size(0x01)
    6444                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6445                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    6446              
    6447              $C$DW$291       .dwtag  DW_TAG_member
    6448                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    6449                      .dwattr $C$DW$291, DW_AT_name("TRIGSEL")
    6450                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_TRIGSEL")
    6451                      .dwattr $C$DW$291, DW_AT_bit_offset(0x00)
    6452                      .dwattr $C$DW$291, DW_AT_bit_size(0x05)
    6453                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6454                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    6455              
    6456                      .dwendtag $C$DW$T$39
    6457              
    6458              
    6459              $C$DW$T$40      .dwtag  DW_TAG_union_type
    6460                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    6461                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    6462              $C$DW$292       .dwtag  DW_TAG_member
    6463                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    6464                      .dwattr $C$DW$292, DW_AT_name("all")
    6465                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_all")
    6466                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6467                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    6468              
    6469              $C$DW$293       .dwtag  DW_TAG_member
    6470                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$39)
    6471                      .dwattr $C$DW$293, DW_AT_name("bit")
    6472                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_bit")
    6473                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6474                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    6475              
    6476                      .dwendtag $C$DW$T$40
    6477              
    6478              
    6479              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6480                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    6481                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x50)
    6482              $C$DW$294       .dwtag  DW_TAG_member
    6483                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    6484                      .dwattr $C$DW$294, DW_AT_name("ADCCTL1")
    6485                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_ADCCTL1")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  133

    6486                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6487                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    6488              
    6489              $C$DW$295       .dwtag  DW_TAG_member
    6490                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
    6491                      .dwattr $C$DW$295, DW_AT_name("ADCCTL2")
    6492                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_ADCCTL2")
    6493                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6494                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    6495              
    6496              $C$DW$296       .dwtag  DW_TAG_member
    6497                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$41)
    6498                      .dwattr $C$DW$296, DW_AT_name("rsvd1")
    6499                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_rsvd1")
    6500                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6501                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    6502              
    6503              $C$DW$297       .dwtag  DW_TAG_member
    6504                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    6505                      .dwattr $C$DW$297, DW_AT_name("ADCINTFLG")
    6506                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_ADCINTFLG")
    6507                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6508                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    6509              
    6510              $C$DW$298       .dwtag  DW_TAG_member
    6511                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    6512                      .dwattr $C$DW$298, DW_AT_name("ADCINTFLGCLR")
    6513                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6514                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6515                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    6516              
    6517              $C$DW$299       .dwtag  DW_TAG_member
    6518                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    6519                      .dwattr $C$DW$299, DW_AT_name("ADCINTOVF")
    6520                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_ADCINTOVF")
    6521                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6522                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    6523              
    6524              $C$DW$300       .dwtag  DW_TAG_member
    6525                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$29)
    6526                      .dwattr $C$DW$300, DW_AT_name("ADCINTOVFCLR")
    6527                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6528                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6529                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    6530              
    6531              $C$DW$301       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$103)
    6533                      .dwattr $C$DW$301, DW_AT_name("INTSEL1N2")
    6534                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_INTSEL1N2")
    6535                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6536                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6537              
    6538              $C$DW$302       .dwtag  DW_TAG_member
    6539                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$105)
    6540                      .dwattr $C$DW$302, DW_AT_name("INTSEL3N4")
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  134

    6541                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_INTSEL3N4")
    6542                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6543                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6544              
    6545              $C$DW$303       .dwtag  DW_TAG_member
    6546                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$107)
    6547                      .dwattr $C$DW$303, DW_AT_name("INTSEL5N6")
    6548                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_INTSEL5N6")
    6549                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6550                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6551              
    6552              $C$DW$304       .dwtag  DW_TAG_member
    6553                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$109)
    6554                      .dwattr $C$DW$304, DW_AT_name("INTSEL7N8")
    6555                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_INTSEL7N8")
    6556                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6557                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6558              
    6559              $C$DW$305       .dwtag  DW_TAG_member
    6560                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$111)
    6561                      .dwattr $C$DW$305, DW_AT_name("INTSEL9N10")
    6562                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_INTSEL9N10")
    6563                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6564                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6565              
    6566              $C$DW$306       .dwtag  DW_TAG_member
    6567                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$42)
    6568                      .dwattr $C$DW$306, DW_AT_name("rsvd2")
    6569                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_rsvd2")
    6570                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6571                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6572              
    6573              $C$DW$307       .dwtag  DW_TAG_member
    6574                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$124)
    6575                      .dwattr $C$DW$307, DW_AT_name("SOCPRICTL")
    6576                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_SOCPRICTL")
    6577                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6578                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6579              
    6580              $C$DW$308       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    6582                      .dwattr $C$DW$308, DW_AT_name("rsvd3")
    6583                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_rsvd3")
    6584                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6585                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6586              
    6587              $C$DW$309       .dwtag  DW_TAG_member
    6588                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$36)
    6589                      .dwattr $C$DW$309, DW_AT_name("ADCSAMPLEMODE")
    6590                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6591                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6592                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6593              
    6594              $C$DW$310       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  135

    6596                      .dwattr $C$DW$310, DW_AT_name("rsvd4")
    6597                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_rsvd4")
    6598                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6599                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6600              
    6601              $C$DW$311       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$25)
    6603                      .dwattr $C$DW$311, DW_AT_name("ADCINTSOCSEL1")
    6604                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6605                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6606                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6607              
    6608              $C$DW$312       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    6610                      .dwattr $C$DW$312, DW_AT_name("ADCINTSOCSEL2")
    6611                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6612                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6613                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6614              
    6615              $C$DW$313       .dwtag  DW_TAG_member
    6616                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$41)
    6617                      .dwattr $C$DW$313, DW_AT_name("rsvd5")
    6618                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_rsvd5")
    6619                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6620                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6621              
    6622              $C$DW$314       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$38)
    6624                      .dwattr $C$DW$314, DW_AT_name("ADCSOCFLG1")
    6625                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6626                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6627                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6628              
    6629              $C$DW$315       .dwtag  DW_TAG_member
    6630                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    6631                      .dwattr $C$DW$315, DW_AT_name("rsvd6")
    6632                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_rsvd6")
    6633                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6634                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6635              
    6636              $C$DW$316       .dwtag  DW_TAG_member
    6637                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$38)
    6638                      .dwattr $C$DW$316, DW_AT_name("ADCSOCFRC1")
    6639                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6640                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6641                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6642              
    6643              $C$DW$317       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    6645                      .dwattr $C$DW$317, DW_AT_name("rsvd7")
    6646                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_rsvd7")
    6647                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6648                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6649              
    6650              $C$DW$318       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  136

    6651                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$38)
    6652                      .dwattr $C$DW$318, DW_AT_name("ADCSOCOVF1")
    6653                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6654                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6655                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6656              
    6657              $C$DW$319       .dwtag  DW_TAG_member
    6658                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    6659                      .dwattr $C$DW$319, DW_AT_name("rsvd8")
    6660                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_rsvd8")
    6661                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6662                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6663              
    6664              $C$DW$320       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$38)
    6666                      .dwattr $C$DW$320, DW_AT_name("ADCSOCOVFCLR1")
    6667                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6668                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6669                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6670              
    6671              $C$DW$321       .dwtag  DW_TAG_member
    6672                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    6673                      .dwattr $C$DW$321, DW_AT_name("rsvd9")
    6674                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_rsvd9")
    6675                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6676                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6677              
    6678              $C$DW$322       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$40)
    6680                      .dwattr $C$DW$322, DW_AT_name("ADCSOC0CTL")
    6681                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    6682                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6683                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6684              
    6685              $C$DW$323       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$40)
    6687                      .dwattr $C$DW$323, DW_AT_name("ADCSOC1CTL")
    6688                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    6689                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6690                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6691              
    6692              $C$DW$324       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$40)
    6694                      .dwattr $C$DW$324, DW_AT_name("ADCSOC2CTL")
    6695                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    6696                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6697                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6698              
    6699              $C$DW$325       .dwtag  DW_TAG_member
    6700                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$40)
    6701                      .dwattr $C$DW$325, DW_AT_name("ADCSOC3CTL")
    6702                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    6703                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6704                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6705              
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  137

    6706              $C$DW$326       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$40)
    6708                      .dwattr $C$DW$326, DW_AT_name("ADCSOC4CTL")
    6709                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    6710                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6711                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6712              
    6713              $C$DW$327       .dwtag  DW_TAG_member
    6714                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$40)
    6715                      .dwattr $C$DW$327, DW_AT_name("ADCSOC5CTL")
    6716                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    6717                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6718                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6719              
    6720              $C$DW$328       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$40)
    6722                      .dwattr $C$DW$328, DW_AT_name("ADCSOC6CTL")
    6723                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    6724                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6725                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6726              
    6727              $C$DW$329       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$40)
    6729                      .dwattr $C$DW$329, DW_AT_name("ADCSOC7CTL")
    6730                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    6731                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6732                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6733              
    6734              $C$DW$330       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$40)
    6736                      .dwattr $C$DW$330, DW_AT_name("ADCSOC8CTL")
    6737                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    6738                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6739                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6740              
    6741              $C$DW$331       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$40)
    6743                      .dwattr $C$DW$331, DW_AT_name("ADCSOC9CTL")
    6744                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    6745                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6746                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6747              
    6748              $C$DW$332       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$40)
    6750                      .dwattr $C$DW$332, DW_AT_name("ADCSOC10CTL")
    6751                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_ADCSOC10CTL")
    6752                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6753                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6754              
    6755              $C$DW$333       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$40)
    6757                      .dwattr $C$DW$333, DW_AT_name("ADCSOC11CTL")
    6758                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    6759                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    6760                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{B525D61D-0FEC-4E05-A471-AEBE7E65079C} PAGE  138

    6761              
    6762              $C$DW$334       .dwtag  DW_TAG_member
    6763                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$40)
    6764                      .dwattr $C$DW$334, DW_AT_name("ADCSOC12CTL")
    6765                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    6766                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6767                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6768              
    6769              $C$DW$335       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$40)
    6771                      .dwattr $C$DW$335, DW_AT_name("ADCSOC13CTL")
    6772                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    6773                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    6774                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6775              
    6776              $C$DW$336       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$40)
    6778                      .dwattr $C$DW$336, DW_AT_name("ADCSOC14CTL")
    6779                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    6780                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6781                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6782              
    6783              $C$DW$337       .dwtag  DW_TAG_member
    6784                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$40)
    6785                      .dwattr $C$DW$337, DW_AT_name("ADCSOC15CTL")
    6786                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_ADCSOC15CTL")
    6787                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    6788                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6789              
    6790              $C$DW$338       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$43)
    6792                      .dwattr $C$DW$338, DW_AT_name("rsvd10")
    6793                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_rsvd10")
    6794                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6795                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6796              
    6797              $C$DW$339       .dwtag  DW_TAG_member
    6798                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$34)
    6799                      .dwattr $C$DW$339, DW_AT_name("ADCREFTRIM")
    6800                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6801                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6802                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6803              
    6804              $C$DW$340       .dwtag  DW_TAG_member
    6805                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$32)
    6806                      .dwattr $C$DW$340, DW_AT_name("ADCOFFTRIM")
    6807                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6808                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6809                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6810              
    6811              $C$DW$341       .dwtag  DW_TAG_member
    6812                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$44)
    6813                      .dwattr $C$DW$341, DW_AT_name("rsvd11")
    6814                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_rsvd11")
    6815                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
TMS320C2000 Assembler PC v16.9.6 Tue Mar 06 19:39:33 2018

